{
  "text": "So in the spring if you're thinking about\ntesting your soil in the garden you have a couple of options. One is to collect a soil sample and send it\ninto the lab for analysis, and the second is to buy one of these simple kits that allows\nyou to analyze your soil at home and get some general recommendations for either adding\nfertilizer or adjusting your soil pH. They are all based on adding soil and water\nto a tube and then adding a reagent, and then matching the color in the tube to the color\non a card. So they're a simple test and will give us\nsome general information about the status of our soil. Once you've put the soil in and the reagent\nand the water, and followed the instructions, you will match the color to one of the color\ncards. So for the pH test you'll match it to the\npH card, phosphorous, nitrogen and potassium. It's a pretty simple kit, it's putting the\nreagents in the water and the soil into the tube and matching the color. So these kits are all available generally\nfor under $30 at most garden stores or you can order them online. There are also other kits available. These results won't be as precise as sending\nthem into the lab for analysis, but for most of us in the garden it will get us close enough\nand it will help us determine how much fertilizer we might need to add or if we need to adjust\nour pH. With the University of Wyoming Extension,\nI'm Caitlin Youngquist and you're watching From the Ground Up.",
  "segments": [
    {
      "id": 0,
      "start": 8.2,
      "end": 10.921,
      "text": "So in the spring if you're thinking about\ntesting your soil in the garden you have a"
    },
    {
      "id": 1,
      "start": 10.921,
      "end": 12.08,
      "text": "couple of options."
    },
    {
      "id": 2,
      "start": 12.08,
      "end": 16.07,
      "text": "One is to collect a soil sample and send it\ninto the lab for analysis, and the second"
    },
    {
      "id": 3,
      "start": 16.07,
      "end": 20.11,
      "text": "is to buy one of these simple kits that allows\nyou to analyze your soil at home and get some"
    },
    {
      "id": 4,
      "start": 20.11,
      "end": 24.63,
      "text": "general recommendations for either adding\nfertilizer or adjusting your soil pH."
    },
    {
      "id": 5,
      "start": 24.63,
      "end": 30.48,
      "text": "They are all based on adding soil and water\nto a tube and then adding a reagent, and then"
    },
    {
      "id": 6,
      "start": 30.48,
      "end": 33.43,
      "text": "matching the color in the tube to the color\non a card."
    },
    {
      "id": 7,
      "start": 33.43,
      "end": 36.54,
      "text": "So they're a simple test and will give us\nsome general information about the status"
    },
    {
      "id": 8,
      "start": 36.54,
      "end": 37.62,
      "text": "of our soil."
    },
    {
      "id": 9,
      "start": 37.62,
      "end": 41.52,
      "text": "Once you've put the soil in and the reagent\nand the water, and followed the instructions,"
    },
    {
      "id": 10,
      "start": 41.52,
      "end": 44.38,
      "text": "you will match the color to one of the color\ncards."
    },
    {
      "id": 11,
      "start": 44.38,
      "end": 51.25,
      "text": "So for the pH test you'll match it to the\npH card, phosphorous, nitrogen and potassium."
    },
    {
      "id": 12,
      "start": 51.25,
      "end": 54.79,
      "text": "It's a pretty simple kit, it's putting the\nreagents in the water and the soil into the"
    },
    {
      "id": 13,
      "start": 54.79,
      "end": 56.36,
      "text": "tube and matching the color."
    },
    {
      "id": 14,
      "start": 56.36,
      "end": 60.13,
      "text": "So these kits are all available generally\nfor under $30 at most garden stores or you"
    },
    {
      "id": 15,
      "start": 60.13,
      "end": 61.28,
      "text": "can order them online."
    },
    {
      "id": 16,
      "start": 61.28,
      "end": 63.17,
      "text": "There are also other kits available."
    },
    {
      "id": 17,
      "start": 63.17,
      "end": 67.08,
      "text": "These results won't be as precise as sending\nthem into the lab for analysis, but for most"
    },
    {
      "id": 18,
      "start": 67.08,
      "end": 70.96,
      "text": "of us in the garden it will get us close enough\nand it will help us determine how much fertilizer"
    },
    {
      "id": 19,
      "start": 70.96,
      "end": 73.759,
      "text": "we might need to add or if we need to adjust\nour pH."
    },
    {
      "id": 20,
      "start": 73.759,
      "end": 76.659,
      "text": "With the University of Wyoming Extension,\nI'm Caitlin Youngquist and you're watching"
    },
    {
      "id": 21,
      "start": 76.659,
      "end": 77.409,
      "text": "From the Ground Up."
    }
  ],
  "language": "en"
}