{
  "text": "When people come to the extension office asking\nabout pesticides, they oftentimes have questions about the effectiveness or availability of\norganic pesticide options. Now, there are many options available that\nare considered or labeled as organic and are certified for organic production. Despite the fact that a product may be labelled\nas organic, it’s still important that we take the proper precautions and use the appropriate\nPPE, or personal protective equipment. And this means, at a minimum, we should have\na long-sleeved shirt, long pants, shoes, socks, chemical resistant gloves, and preferably\neye protection as well. It’s also important to remember that these\nproducts can also be toxic to beneficial insects, such as our pollinators, if used incorrectly. So, it’s still very important that we open\nthe label, take the time to read it, and familiarize yourself with the product, and understand\nhow to safely use that product. Due to a limited availability, there’s not\nalways going to be an organic option for every pest, so you may have to get creative or look\nat other control measures in some cases. Even if a product is listed as organic, it’s\nstill important that when using that product that we take the proper precautions and treat\nthat as a chemical. This has been Caleb Carter with the University\nof Wyoming Extension, and you’re watching “From the Ground Up.”",
  "segments": [
    {
      "id": 0,
      "start": 7.49,
      "end": 12.0,
      "text": "When people come to the extension office asking\nabout pesticides, they oftentimes have questions"
    },
    {
      "id": 1,
      "start": 12.0,
      "end": 17.5,
      "text": "about the effectiveness or availability of\norganic pesticide options."
    },
    {
      "id": 2,
      "start": 17.5,
      "end": 23.73,
      "text": "Now, there are many options available that\nare considered or labeled as organic and are"
    },
    {
      "id": 3,
      "start": 23.73,
      "end": 27.109,
      "text": "certified for organic production."
    },
    {
      "id": 4,
      "start": 27.109,
      "end": 30.72,
      "text": "Despite the fact that a product may be labelled\nas organic, it’s still important that we"
    },
    {
      "id": 5,
      "start": 30.72,
      "end": 36.71,
      "text": "take the proper precautions and use the appropriate\nPPE, or personal protective equipment."
    },
    {
      "id": 6,
      "start": 36.71,
      "end": 42.41,
      "text": "And this means, at a minimum, we should have\na long-sleeved shirt, long pants, shoes, socks,"
    },
    {
      "id": 7,
      "start": 42.41,
      "end": 46.55,
      "text": "chemical resistant gloves, and preferably\neye protection as well."
    },
    {
      "id": 8,
      "start": 46.55,
      "end": 51.869,
      "text": "It’s also important to remember that these\nproducts can also be toxic to beneficial insects,"
    },
    {
      "id": 9,
      "start": 51.869,
      "end": 54.239,
      "text": "such as our pollinators, if used incorrectly."
    },
    {
      "id": 10,
      "start": 54.239,
      "end": 60.08,
      "text": "So, it’s still very important that we open\nthe label, take the time to read it, and familiarize"
    },
    {
      "id": 11,
      "start": 60.08,
      "end": 65.03,
      "text": "yourself with the product, and understand\nhow to safely use that product."
    },
    {
      "id": 12,
      "start": 65.03,
      "end": 69.22,
      "text": "Due to a limited availability, there’s not\nalways going to be an organic option for every"
    },
    {
      "id": 13,
      "start": 69.22,
      "end": 74.71,
      "text": "pest, so you may have to get creative or look\nat other control measures in some cases."
    },
    {
      "id": 14,
      "start": 74.71,
      "end": 78.729,
      "text": "Even if a product is listed as organic, it’s\nstill important that when using that product"
    },
    {
      "id": 15,
      "start": 78.729,
      "end": 81.92,
      "text": "that we take the proper precautions and treat\nthat as a chemical."
    },
    {
      "id": 16,
      "start": 81.92,
      "end": 85.09,
      "text": "This has been Caleb Carter with the University\nof Wyoming Extension, and you’re watching"
    },
    {
      "id": 17,
      "start": 85.09,
      "end": 86.64,
      "text": "“From the Ground Up.”"
    }
  ],
  "language": "en"
}