{
  "text": "So, whether you’re looking for garden tools\nfor yourself or someone else who may have some gardening accessibility issues, there\nare a variety of tools on the market these days. One of the early ones that came out were tools\nthat had these arched handles to them. And they give a little bit more leverage for\npeople who may have arthritis or some mobility issues in their hands and their wrists. There are some more tools on the market now\nthat have a longer handle to them so they could be used from a wheelchair or from a\nstanding point. And they also have extendable handles. There are also some hand tools that you can\nuse on the ground that will give you accessibility into shrubbery that’s oftentimes difficult\nto get into. And then we also have watering tools that\nwill help you reach plants to water them either from a standing or a sitting position, or\nto reach plants that are overhead and to make sure that you can get water to them. Many different garden centers will carry different\nbrands and different accessibility tools, but you can ask them to shop for them. We also have a publication that was put together\nby one of our retired specialists just a few few years ago. And if you’re looking for tools for accessibility\nyou can also order some of them from suppliers online. With the university of Wyoming Extension,\nI’m Donna Hoffman, From the Ground Up.",
  "segments": [
    {
      "id": 0,
      "start": 5.81,
      "end": 9.37,
      "text": "So, whether you’re looking for garden tools\nfor yourself or someone else who may have"
    },
    {
      "id": 1,
      "start": 9.37,
      "end": 13.1,
      "text": "some gardening accessibility issues, there\nare a variety of tools on the market"
    },
    {
      "id": 2,
      "start": 13.1,
      "end": 15.14,
      "text": "these days."
    },
    {
      "id": 3,
      "start": 15.14,
      "end": 20.0,
      "text": "One of the early ones that came out were tools\nthat had these arched handles to them."
    },
    {
      "id": 4,
      "start": 20.0,
      "end": 24.519,
      "text": "And they give a little bit more leverage for\npeople who may have arthritis or some mobility"
    },
    {
      "id": 5,
      "start": 24.519,
      "end": 26.869,
      "text": "issues in their hands and their wrists."
    },
    {
      "id": 6,
      "start": 26.869,
      "end": 31.22,
      "text": "There are some more tools on the market now\nthat have a longer handle to them so they"
    },
    {
      "id": 7,
      "start": 31.22,
      "end": 35.36,
      "text": "could be used from a wheelchair or from a\nstanding point."
    },
    {
      "id": 8,
      "start": 35.36,
      "end": 39.17,
      "text": "And they also have extendable handles."
    },
    {
      "id": 9,
      "start": 39.17,
      "end": 44.17,
      "text": "There are also some hand tools that you can\nuse on the ground that will give you accessibility"
    },
    {
      "id": 10,
      "start": 44.17,
      "end": 48.73,
      "text": "into shrubbery that’s oftentimes difficult\nto get into."
    },
    {
      "id": 11,
      "start": 48.73,
      "end": 54.38,
      "text": "And then we also have watering tools that\nwill help you reach plants to water them either"
    },
    {
      "id": 12,
      "start": 54.38,
      "end": 59.49,
      "text": "from a standing or a sitting position, or\nto reach plants that are overhead and to make"
    },
    {
      "id": 13,
      "start": 59.49,
      "end": 61.49,
      "text": "sure that you can get water to them."
    },
    {
      "id": 14,
      "start": 61.49,
      "end": 65.88,
      "text": "Many different garden centers will carry different\nbrands and different accessibility tools,"
    },
    {
      "id": 15,
      "start": 65.88,
      "end": 68.119,
      "text": "but you can ask them to shop for them."
    },
    {
      "id": 16,
      "start": 68.119,
      "end": 71.5,
      "text": "We also have a publication that was put together\nby one of our retired specialists just a few"
    },
    {
      "id": 17,
      "start": 71.5,
      "end": 73.35,
      "text": "few years ago."
    },
    {
      "id": 18,
      "start": 73.35,
      "end": 78.46,
      "text": "And if you’re looking for tools for accessibility\nyou can also order some of them from suppliers"
    },
    {
      "id": 19,
      "start": 78.46,
      "end": 79.46,
      "text": "online."
    },
    {
      "id": 20,
      "start": 79.46,
      "end": 84.3,
      "text": "With the university of Wyoming Extension,\nI’m Donna Hoffman, From the Ground Up."
    }
  ],
  "language": "en"
}