{
  "text": "Hello every one,\nWelcome to JADAM In this episode, I will show you\\h\nhow to make a natural wetting agent\\h\\h which can be used as an\\h\ninsecticide for agriculture. I have invented this technology without\\h\nusing external heating equipment.\\h And it is called JADAM Weting agent. The main ingredient I will be using\\h\ntoday is the 3.6 liters of canola oil.\\h You can also use various vegetable oil.\\h I m using canola oil simply because of it\\h\nis cheapest oil available in south korea. And next ingredient is 640 grams\\h\nof 90% pure potassium hydroxide. When making JADAM Wetting\\h\nagent, soft water must be used.\\h The best soft water you can get is the clean\\h\nrain water after 30 minutes of raining.\\h Also there are lot of soft\\h\nwater below the ground as well.\\h And it is not just limited to those two.\\h You can also use water from the air\\h\ncondition, dehumidifier and distilled water. It is mandatory to use soft water\\h\nfor making JADAM Wetting agent\\h\\h also for the water that you are\\h\ngoing to use for the pest solution. Best way to identify the quality of water is\\h\nusing small portion of JADAM Wetting agent.\\h The soft water show very clean and transparent. And alternative way to identify soft\\h\nwater is by using natural ditergent\\h\\h sold in the market when you don\\h\nt have a JADAM wetting agent .\n\\h First I will weight 500 ml of\\h\nsoft water for initial process.\\h second I m adding 640 grams\\h\nof potassium hydroxide. And next I m adding 500 ml of soft\\h\nwater on top of potassium hydroxide. Now you may see the boiling due\\h\nchemical reaction with water. Close the lid and stir the bucket\\h\nto melt the potassium hydroxide. Once you are done with this, open the\\h\nlid to add 3.6 liters of canola oil. From now I will start blending the oil, before\\h\ndoing this, make sure your blender is clean.\\h Once I start, you will be able\\h\nto see the changes in color. I have blended about 5 minutes, and as you can\\h\nsee the oil has turned into like a thin mayonese.\\h This is the completion of first initial process. It has been 20 minutes after aging, as you\\h\ncan see the solution is getting harden.\\h Right now the temperature goes\\h\nmore than 80 celcius degree.\\h The temperature will gradually increase\\h\nthen decrease overtime while aging\\h\\h the solution for 3 days.\nDuring this aging process\\h\\h the solution inside will turn\\h\ninto like a block of butter When the initial process was not done well,\\h\nyou will b e seeing the separate layer.\\h But here, I don t see any separation\\h\n. so that means it is good to go. I have waited for 3 days.\nI usually recommend aging for 3 days\\h\\h but during emergency. You\\h\ncan also wait just 24 hours. let s see how it s look like inside.\\h When you touch it, It feel like a soften butter\\h\nor soap that has been inside of water for an hour. However, If your solution is bit watery or\\h\nmore softer even after aging it for 3 days,\\h\\h that means the initial process is not done well.\\h So to solve those issue, you\\h\nwill have to blend it once more. And in next step, I will add total of 16\\h\nliters of water, but at first I will just\\h\\h add 4 liters to cleave the solution so\\h\nthat it will be easier to melt it down. Once you are done poruing water, split the\\h\nsolution to make small particle at first.\\h Then use the handblender to fasten the process. Since I have added 4 liters, now I\\h\nwill weight 12 liters of water to add. Next step is very easy.\\h Just stir the solution\\h\noccasionally once in an hour. Then later you will be able to see it\\h\nhas melted within 24 hours or more. You can also use a electric\\h\ndrill to fasten the process.\\h Use a lowe RPM to aboid overflow. I have stirred total of 5\\h\ntimes with 1 hour intervals.\\h It is almost melted but you have to check if there\\h\nis any solution left on the corner of the bucket. In the early stage in this video, we have\\h\nused the small hand blender, but at this point\\h It is short to proceed the bl ending. So I would\\h\nrecommend using the long one like this drill.\\h I will now close the lid and wait little bit. It is now all perfectly melted\\h\nwithin 22 hours after aging.\\h I have stired 5 to 6 six time\\h\nwith one hour interval total. I will now going to store this in the bottle.\\h In the previous video, I have stored\\h\nthe JADAM Sulfur in the separate bottle.\\h\\h But for this one it is not so necessary. You can\\h\njust store it in a bucket with the lid for use. It is all completed.\nSo total ingredient I used was the 3.6 litters\\h\\h of canola oil, 16.5 litters of water and 640\\h\ngrams to obtain 20 liters of JADAM Wetting agent. And total time consumed is approximately 4 days.\\h 3 days for the aging and 1\\h\nday for the melting procedure. This is the one that I made one month ago.\nAs you age the solution it will get clearer\\h\\h and gets bit darker.\nAnd there is no shelf life of JADAM Wetting Agent. More attractive part of this is that it can\\h\nbe your laundry soap, dish soap and shampoo. As I m introducing you the JADAM\\h\nwetting agent as an agriculture input\\h\\h but this is 100% decomposable natural detergent. By making JADAM Wetting agent. You are not\\h\\h getting a agricultural input but\\h\nalso your daily life material. Thank you for watching and I will\\h\nsee you guys on the next video.",
  "segments": [
    {
      "id": 0,
      "start": 11.04,
      "end": 12.96,
      "text": "Hello every one,\nWelcome to JADAM"
    },
    {
      "id": 1,
      "start": 12.96,
      "end": 16.56,
      "text": "In this episode, I will show you\\h\nhow to make a natural wetting agent\\h\\h"
    },
    {
      "id": 2,
      "start": 16.56,
      "end": 19.68,
      "text": "which can be used as an\\h\ninsecticide for agriculture."
    },
    {
      "id": 3,
      "start": 19.68,
      "end": 23.76,
      "text": "I have invented this technology without\\h\nusing external heating equipment.\\h"
    },
    {
      "id": 4,
      "start": 23.76,
      "end": 26.56,
      "text": "And it is called JADAM Weting agent."
    },
    {
      "id": 5,
      "start": 26.56,
      "end": 32.24,
      "text": "The main ingredient I will be using\\h\ntoday is the 3.6 liters of canola oil.\\h"
    },
    {
      "id": 6,
      "start": 32.24,
      "end": 34.48,
      "text": "You can also use various vegetable oil.\\h"
    },
    {
      "id": 7,
      "start": 34.48,
      "end": 39.68,
      "text": "I m using canola oil simply because of it\\h\nis cheapest oil available in south korea."
    },
    {
      "id": 8,
      "start": 39.68,
      "end": 44.96,
      "text": "And next ingredient is 640 grams\\h\nof 90% pure potassium hydroxide."
    },
    {
      "id": 9,
      "start": 44.96,
      "end": 48.24,
      "text": "When making JADAM Wetting\\h\nagent, soft water must be used.\\h"
    },
    {
      "id": 10,
      "start": 48.24,
      "end": 53.36,
      "text": "The best soft water you can get is the clean\\h\nrain water after 30 minutes of raining.\\h"
    },
    {
      "id": 11,
      "start": 53.36,
      "end": 56.48,
      "text": "Also there are lot of soft\\h\nwater below the ground as well.\\h"
    },
    {
      "id": 12,
      "start": 56.48,
      "end": 58.96,
      "text": "And it is not just limited to those two.\\h"
    },
    {
      "id": 13,
      "start": 58.96,
      "end": 64.8,
      "text": "You can also use water from the air\\h\ncondition, dehumidifier and distilled water."
    },
    {
      "id": 14,
      "start": 64.8,
      "end": 68.56,
      "text": "It is mandatory to use soft water\\h\nfor making JADAM Wetting agent\\h\\h"
    },
    {
      "id": 15,
      "start": 68.56,
      "end": 71.84,
      "text": "also for the water that you are\\h\ngoing to use for the pest solution."
    },
    {
      "id": 16,
      "start": 75.76,
      "end": 81.6,
      "text": "Best way to identify the quality of water is\\h\nusing small portion of JADAM Wetting agent.\\h"
    },
    {
      "id": 17,
      "start": 81.6,
      "end": 85.84,
      "text": "The soft water show very clean and transparent."
    },
    {
      "id": 18,
      "start": 88.2,
      "end": 93.52,
      "text": "And alternative way to identify soft\\h\nwater is by using natural ditergent\\h\\h"
    },
    {
      "id": 19,
      "start": 93.52,
      "end": 97.48,
      "text": "sold in the market when you don\\h\nt have a JADAM wetting agent .\n\\h"
    },
    {
      "id": 20,
      "start": 98.16,
      "end": 102.4,
      "text": "First I will weight 500 ml of\\h\nsoft water for initial process.\\h"
    },
    {
      "id": 21,
      "start": 103.04,
      "end": 114.08,
      "text": "second I m adding 640 grams\\h\nof potassium hydroxide."
    },
    {
      "id": 22,
      "start": 114.08,
      "end": 119.52,
      "text": "And next I m adding 500 ml of soft\\h\nwater on top of potassium hydroxide."
    },
    {
      "id": 23,
      "start": 122.88,
      "end": 126.4,
      "text": "Now you may see the boiling due\\h\nchemical reaction with water."
    },
    {
      "id": 24,
      "start": 126.4,
      "end": 131.12,
      "text": "Close the lid and stir the bucket\\h\nto melt the potassium hydroxide."
    },
    {
      "id": 25,
      "start": 134.72,
      "end": 141.84,
      "text": "Once you are done with this, open the\\h\nlid to add 3.6 liters of canola oil."
    },
    {
      "id": 26,
      "start": 146.24,
      "end": 152.0,
      "text": "From now I will start blending the oil, before\\h\ndoing this, make sure your blender is clean.\\h"
    },
    {
      "id": 27,
      "start": 152.72,
      "end": 156.88,
      "text": "Once I start, you will be able\\h\nto see the changes in color."
    },
    {
      "id": 28,
      "start": 168.8,
      "end": 175.04,
      "text": "I have blended about 5 minutes, and as you can\\h\nsee the oil has turned into like a thin mayonese.\\h"
    },
    {
      "id": 29,
      "start": 175.04,
      "end": 178.08,
      "text": "This is the completion of first initial process."
    },
    {
      "id": 30,
      "start": 181.12,
      "end": 186.08,
      "text": "It has been 20 minutes after aging, as you\\h\ncan see the solution is getting harden.\\h"
    },
    {
      "id": 31,
      "start": 186.08,
      "end": 189.6,
      "text": "Right now the temperature goes\\h\nmore than 80 celcius degree.\\h"
    },
    {
      "id": 32,
      "start": 189.6,
      "end": 194.32,
      "text": "The temperature will gradually increase\\h\nthen decrease overtime while aging\\h\\h"
    },
    {
      "id": 33,
      "start": 194.32,
      "end": 198.0,
      "text": "the solution for 3 days.\nDuring this aging process\\h\\h"
    },
    {
      "id": 34,
      "start": 198.0,
      "end": 201.12,
      "text": "the solution inside will turn\\h\ninto like a block of butter"
    },
    {
      "id": 35,
      "start": 201.84,
      "end": 206.64,
      "text": "When the initial process was not done well,\\h\nyou will b e seeing the separate layer.\\h"
    },
    {
      "id": 36,
      "start": 206.64,
      "end": 210.08,
      "text": "But here, I don t see any separation\\h\n. so that means it is good to go."
    },
    {
      "id": 37,
      "start": 211.12,
      "end": 215.28,
      "text": "I have waited for 3 days.\nI usually recommend aging for 3 days\\h\\h"
    },
    {
      "id": 38,
      "start": 215.28,
      "end": 219.12,
      "text": "but during emergency. You\\h\ncan also wait just 24 hours."
    },
    {
      "id": 39,
      "start": 220.08,
      "end": 226.32,
      "text": "let s see how it s look like inside.\\h"
    },
    {
      "id": 40,
      "start": 226.32,
      "end": 234.08,
      "text": "When you touch it, It feel like a soften butter\\h\nor soap that has been inside of water for an hour."
    },
    {
      "id": 41,
      "start": 234.08,
      "end": 240.64,
      "text": "However, If your solution is bit watery or\\h\nmore softer even after aging it for 3 days,\\h\\h"
    },
    {
      "id": 42,
      "start": 240.64,
      "end": 243.44,
      "text": "that means the initial process is not done well.\\h"
    },
    {
      "id": 43,
      "start": 244.4,
      "end": 248.4,
      "text": "So to solve those issue, you\\h\nwill have to blend it once more."
    },
    {
      "id": 44,
      "start": 249.52,
      "end": 255.36,
      "text": "And in next step, I will add total of 16\\h\nliters of water, but at first I will just\\h\\h"
    },
    {
      "id": 45,
      "start": 255.36,
      "end": 267.84,
      "text": "add 4 liters to cleave the solution so\\h\nthat it will be easier to melt it down."
    },
    {
      "id": 46,
      "start": 268.4,
      "end": 274.24,
      "text": "Once you are done poruing water, split the\\h\nsolution to make small particle at first.\\h"
    },
    {
      "id": 47,
      "start": 276.8,
      "end": 281.84,
      "text": "Then use the handblender to fasten the process."
    },
    {
      "id": 48,
      "start": 284.56,
      "end": 289.12,
      "text": "Since I have added 4 liters, now I\\h\nwill weight 12 liters of water to add."
    },
    {
      "id": 49,
      "start": 293.52,
      "end": 295.6,
      "text": "Next step is very easy.\\h"
    },
    {
      "id": 50,
      "start": 295.6,
      "end": 298.72,
      "text": "Just stir the solution\\h\noccasionally once in an hour."
    },
    {
      "id": 51,
      "start": 299.28,
      "end": 304.16,
      "text": "Then later you will be able to see it\\h\nhas melted within 24 hours or more."
    },
    {
      "id": 52,
      "start": 305.2,
      "end": 308.88,
      "text": "You can also use a electric\\h\ndrill to fasten the process.\\h"
    },
    {
      "id": 53,
      "start": 309.6,
      "end": 313.748,
      "text": "Use a lowe RPM to aboid overflow."
    },
    {
      "id": 54,
      "start": 338.08,
      "end": 342.16,
      "text": "I have stirred total of 5\\h\ntimes with 1 hour intervals.\\h"
    },
    {
      "id": 55,
      "start": 342.16,
      "end": 351.84,
      "text": "It is almost melted but you have to check if there\\h\nis any solution left on the corner of the bucket."
    },
    {
      "id": 56,
      "start": 354.08,
      "end": 359.68,
      "text": "In the early stage in this video, we have\\h\nused the small hand blender, but at this point\\h"
    },
    {
      "id": 57,
      "start": 359.68,
      "end": 366.32,
      "text": "It is short to proceed the bl ending. So I would\\h\nrecommend using the long one like this drill.\\h"
    },
    {
      "id": 58,
      "start": 371.28,
      "end": 372.0,
      "text": "I will now close the lid and wait little bit."
    },
    {
      "id": 59,
      "start": 380.96,
      "end": 385.6,
      "text": "It is now all perfectly melted\\h\nwithin 22 hours after aging.\\h"
    },
    {
      "id": 60,
      "start": 386.48,
      "end": 391.44,
      "text": "I have stired 5 to 6 six time\\h\nwith one hour interval total."
    },
    {
      "id": 61,
      "start": 392.56,
      "end": 395.28,
      "text": "I will now going to store this in the bottle.\\h"
    },
    {
      "id": 62,
      "start": 395.84,
      "end": 400.0,
      "text": "In the previous video, I have stored\\h\nthe JADAM Sulfur in the separate bottle.\\h\\h"
    },
    {
      "id": 63,
      "start": 400.0,
      "end": 407.84,
      "text": "But for this one it is not so necessary. You can\\h\njust store it in a bucket with the lid for use."
    },
    {
      "id": 64,
      "start": 426.96,
      "end": 431.76,
      "text": "It is all completed.\nSo total ingredient I used was the 3.6 litters\\h\\h"
    },
    {
      "id": 65,
      "start": 431.76,
      "end": 439.84,
      "text": "of canola oil, 16.5 litters of water and 640\\h\ngrams to obtain 20 liters of JADAM Wetting agent."
    },
    {
      "id": 66,
      "start": 440.48,
      "end": 443.6,
      "text": "And total time consumed is approximately 4 days.\\h"
    },
    {
      "id": 67,
      "start": 443.6,
      "end": 446.88,
      "text": "3 days for the aging and 1\\h\nday for the melting procedure."
    },
    {
      "id": 68,
      "start": 447.52,
      "end": 453.6,
      "text": "This is the one that I made one month ago.\nAs you age the solution it will get clearer\\h\\h"
    },
    {
      "id": 69,
      "start": 453.6,
      "end": 458.24,
      "text": "and gets bit darker.\nAnd there is no shelf life of JADAM Wetting Agent."
    },
    {
      "id": 70,
      "start": 458.24,
      "end": 465.36,
      "text": "More attractive part of this is that it can\\h\nbe your laundry soap, dish soap and shampoo."
    },
    {
      "id": 71,
      "start": 466.0,
      "end": 470.56,
      "text": "As I m introducing you the JADAM\\h\nwetting agent as an agriculture input\\h\\h"
    },
    {
      "id": 72,
      "start": 470.56,
      "end": 475.28,
      "text": "but this is 100% decomposable natural detergent."
    },
    {
      "id": 73,
      "start": 475.28,
      "end": 477.76,
      "text": "By making JADAM Wetting agent. You are not\\h\\h"
    },
    {
      "id": 74,
      "start": 477.76,
      "end": 481.76,
      "text": "getting a agricultural input but\\h\nalso your daily life material."
    },
    {
      "id": 75,
      "start": 481.76,
      "end": 485.652,
      "text": "Thank you for watching and I will\\h\nsee you guys on the next video."
    }
  ],
  "language": "en"
}