{
  "text": "[Music] All over the world, rice is a staple food of the people. [Music] Over the last 20 years, rice production in Africa has increased by 4% [Music] peranom. But consumption has increased [Music] faster. So Africa is forced to import large quantities of rice. [Music] imported rice can be rice that's been produced 5 years ago. So the time imported rice is produced and the moment we eat it in Benin will take at least 5 years. So this rice is old compared to the local rice. Therefore my choice is made. I prefer living rice. Rice is produced in Benin. We can be sure this rice has all the qualities we're looking for in rice. That is all the nutritional values. [Music] Even though the rice produced in Africa often has superior cooking characteristics to the imported rice, several practices reduce the quality. To convince African consumers to eat local rice, it's imperative to prevent deterioration in quality. [Music] Among the factors affecting rice quality are varietal mixture, harvest date, impurities such as stones and drying and storage conditions. [Music] Here we'll learn how to avoid devaluing the local rights. To ensure good quality rice, you must start right from sewing by avoiding the use of a mixture of varieties. The chairman of Central Bernin's rice farmers union stresses why this is important. When one wants to grow rice, they go to the market or they buy rice from the neighbor or from any source. So there's already a mixture of varieties in the field. When this mixture is mil, depending on the calibration of the grader, if this is large, the finest grains pass through without being dehusted and the biggest grains will be broken before coming out of the machine because you take a mixture to the miller. You can be sure you'll get a heterogeneous rice. That's obvious. So the seed problem must be solved and producers have to learn that rice is not like maze where yellow, red, white grains can all be mixed but rice it needs to be selected. The rice field needs to be divided into plots according to varieties so that it makes milling easy and effective. This is very important. This seed is from a single variety. It's only from this type of seed that a homogeneous harvest can be obtained and therefore there's a standard product after milling. The picture on the right shows a mixture of varieties. With such seed, we obtain a harvest that turns out a poor product after milling. So, it's very important to avoid mixing varieties right from sewing. It's also recommended to separate the various varieties immediately after harvest to thresh them and store them separately because during milling a mixture produces a non-standard product. Apart from high amounts of unmilled and broken grains, mixtures are also hard to cook. Because each variety has its own cooking time. So to satisfy the consumer, avoid mixing the varieties at all stages. Harvesting at the right time also helps maintain the quality of the final product. When we harvest too early, the patty contains a lot of green grains and during milling they turn into flour. In this way, you lose a lot of rice and therefore a lot of money. Rice production demands a lot of work and without care, we cannot obtain a good product. The harvest must not be delayed until the panacles are too dry. Because during milling, the overdrive patty will only produce broken grains. The right harvesting time for rice is generally 5 weeks after flowering or 5 weeks after the appearance of the panacle which is a characteristic easily detectable by farmers. At this stage also the color in the grains change. The green will turn strawlike, yellow or even gold depending on the variety. And generally when 80% of the field has changed color, we can start harvesting. To ensure good quality rice, ensure you harvest at the right time. During threshing, stones and other impurities can get in. To avoid this, prepare a clean threshing floor. It may be a tarpolin, bags sewn together, a cemented or compacted floor. Farmers in Bangladesh even thresh on a table enclosed by bags sewn together. Threshing can be done by several methods. Manually or the use of pedal and power threshers. Regardless of the method used, threshing must always be done on a clean floor. Let's hear about an innovative example of hand threshing. Some farmers in the way we valley gather the panacles and thresh them on a barrel inside a mosquito net calmly and the grains will not escape. They stay in the net. This is an initiative of a farmer who doesn't have a thresher. So to avoid the contact with the soil and other debris, they spread the nets and thresh them. After threshing, carefully pick the grains and winnow them on a clean floor. Winnow the patty several times and make sure no weed seeds remain. After cleaning the patty of all impurities, it's important to dry it on a clean floor. We use the tarpolin to dry the patty to prevent stones from getting in. Avoid drying on the bare floor or by the roadside because stones and other impurities can get in. Now let's hear from the director of the Songai Center, an NGO involved in rice sector development in Africa. quality rice could be sold twice the price. So it is very very important for them to invest themselves in producing rice of quality making sure the sand is not there the unripe rice is not there so that the consumer who is becoming more and more demanding will like to go. Now that we've learned how to avoid mixing varieties, to harvest at the right time, and to avoid impurities, let's see what effect the water content has on the grains during milling. Grains that are too dry have cracks and break during milling. The cracks are so small that they can't be seen with the naked eye. This phenomenon is comparable to clay cracking in the sun. When the rice is too dry, it breaks. That's why it's tested every time by rubbing it in the palms of the hands. In this way, we avoid drying it too much. If the sun is too high, dry the rice for only a few hours in the open air. Turn over the patty from time to time to dry it evenly. And if possible, continue to dry it afterwards in the shade. Dry until the grains have an acceptable moisture content. Let's see how women in a Benine village test this. To know that the patty is dry, we take some and rub it between the palms of our hands. We also test it with our teeth. When it breaks at a dry crack, then the patty is dry. And if you think that after proper drying the quality is guaranteed, no way. Storage also determines the quality of the rice because during storage the patty can become moist again. When the patty is stored directly on a cement floor, It absorbs moisture and then goes moldy. When the patty is kept in a bag and stored on dry wood, its conservation is good and it doesn't go moldy. As we've just heard from an experienced trader, you should always store patty on materials that support and isolate it from the ground. Avoid storing bags on rusted iron. Also leave a gap between the banks to allow air to circulate and make pest control easier. As we saw, the quality of the rice improves when we avoid varietal mixtures and impurities. We must also harvest at the right time and ensure good drying and patty storage. Handling the patty well before milling helps to avoid huge losses and ensures quality. As you may well be aware by now, good quality rice requires commitment and a lot of discipline. It is important for we Africans to really invest ourselves in quality production. That culture of success, culture of quality is very important for us to push back all the dumping from outside. If we don't do it, whether it's African, whether it's from my mother's kitchen, people are not going to buy it. So we have to come to the left to be competitive, we have to develop competitive advantage and quality is the most important element in competitive advantage and it's at our reach. Within our reach, we can do it. [Music] African rice has excellent nutritional and cooking characteristics. To ensure that the final product is attractive to the consumer, its quality must be guaranteed at all times. Rice farmers, traders, processes, and consumers, we all have everything to gain from protecting the quality of our rice. [Music] [Music]",
  "segments": [
    {
      "id": 0,
      "start": 0.71,
      "end": 21.369,
      "text": "[Music]"
    },
    {
      "id": 1,
      "start": 24.32,
      "end": 28.95,
      "text": "All over the world, rice is a staple"
    },
    {
      "id": 2,
      "start": 26.8,
      "end": 30.359,
      "text": "food of the people."
    },
    {
      "id": 3,
      "start": 28.95,
      "end": 33.52,
      "text": "[Music]"
    },
    {
      "id": 4,
      "start": 30.359,
      "end": 37.29,
      "text": "Over the last 20 years, rice production"
    },
    {
      "id": 5,
      "start": 33.52,
      "end": 38.52,
      "text": "in Africa has increased by 4%"
    },
    {
      "id": 6,
      "start": 37.29,
      "end": 41.89,
      "text": "[Music]"
    },
    {
      "id": 7,
      "start": 38.52,
      "end": 46.72,
      "text": "peranom. But consumption has increased"
    },
    {
      "id": 8,
      "start": 41.89,
      "end": 46.72,
      "text": "[Music]"
    },
    {
      "id": 9,
      "start": 47.32,
      "end": 52.83,
      "text": "faster. So Africa is forced to import"
    },
    {
      "id": 10,
      "start": 50.32,
      "end": 56.31,
      "text": "large quantities of rice."
    },
    {
      "id": 11,
      "start": 52.83,
      "end": 56.31,
      "text": "[Music]"
    },
    {
      "id": 12,
      "start": 58.64,
      "end": 63.359,
      "text": "imported rice can be rice that's been"
    },
    {
      "id": 13,
      "start": 60.48,
      "end": 65.28,
      "text": "produced 5 years ago. So the time"
    },
    {
      "id": 14,
      "start": 63.359,
      "end": 68.2,
      "text": "imported rice is produced and the moment"
    },
    {
      "id": 15,
      "start": 65.28,
      "end": 71.28,
      "text": "we eat it in Benin will take at least 5"
    },
    {
      "id": 16,
      "start": 68.2,
      "end": 73.76,
      "text": "years. So this rice is old compared to"
    },
    {
      "id": 17,
      "start": 71.28,
      "end": 73.76,
      "text": "the local"
    },
    {
      "id": 18,
      "start": 75.4,
      "end": 81.759,
      "text": "rice. Therefore my choice is made. I"
    },
    {
      "id": 19,
      "start": 79.119,
      "end": 84.08,
      "text": "prefer living rice. Rice is produced in"
    },
    {
      "id": 20,
      "start": 81.759,
      "end": 86.32,
      "text": "Benin. We can be sure this rice has all"
    },
    {
      "id": 21,
      "start": 84.08,
      "end": 90.27,
      "text": "the qualities we're looking for in rice."
    },
    {
      "id": 22,
      "start": 86.32,
      "end": 93.33,
      "text": "That is all the nutritional values."
    },
    {
      "id": 23,
      "start": 90.27,
      "end": 93.33,
      "text": "[Music]"
    },
    {
      "id": 24,
      "start": 94.4,
      "end": 98.0,
      "text": "Even though the rice produced in Africa"
    },
    {
      "id": 25,
      "start": 96.4,
      "end": 100.28,
      "text": "often has superior cooking"
    },
    {
      "id": 26,
      "start": 98.0,
      "end": 103.799,
      "text": "characteristics to the imported"
    },
    {
      "id": 27,
      "start": 100.28,
      "end": 106.64,
      "text": "rice, several practices reduce the"
    },
    {
      "id": 28,
      "start": 103.799,
      "end": 109.52,
      "text": "quality. To convince African consumers"
    },
    {
      "id": 29,
      "start": 106.64,
      "end": 113.759,
      "text": "to eat local rice, it's imperative to"
    },
    {
      "id": 30,
      "start": 109.52,
      "end": 113.759,
      "text": "prevent deterioration in quality."
    },
    {
      "id": 31,
      "start": 114.51,
      "end": 119.68,
      "text": "[Music]"
    },
    {
      "id": 32,
      "start": 117.36,
      "end": 122.04,
      "text": "Among the factors affecting rice quality"
    },
    {
      "id": 33,
      "start": 119.68,
      "end": 124.68,
      "text": "are varietal"
    },
    {
      "id": 34,
      "start": 122.04,
      "end": 128.64,
      "text": "mixture, harvest"
    },
    {
      "id": 35,
      "start": 124.68,
      "end": 132.759,
      "text": "date, impurities such as stones and"
    },
    {
      "id": 36,
      "start": 128.64,
      "end": 132.759,
      "text": "drying and storage conditions."
    },
    {
      "id": 37,
      "start": 132.79,
      "end": 135.889,
      "text": "[Music]"
    },
    {
      "id": 38,
      "start": 137.68,
      "end": 143.12,
      "text": "Here we'll learn how to avoid devaluing"
    },
    {
      "id": 39,
      "start": 140.0,
      "end": 143.12,
      "text": "the local rights."
    },
    {
      "id": 40,
      "start": 143.599,
      "end": 148.959,
      "text": "To ensure good quality rice, you must"
    },
    {
      "id": 41,
      "start": 146.239,
      "end": 151.319,
      "text": "start right from sewing by avoiding the"
    },
    {
      "id": 42,
      "start": 148.959,
      "end": 153.519,
      "text": "use of a mixture of"
    },
    {
      "id": 43,
      "start": 151.319,
      "end": 156.0,
      "text": "varieties. The chairman of Central"
    },
    {
      "id": 44,
      "start": 153.519,
      "end": 159.4,
      "text": "Bernin's rice farmers union stresses why"
    },
    {
      "id": 45,
      "start": 156.0,
      "end": 159.4,
      "text": "this is important."
    },
    {
      "id": 46,
      "start": 160.48,
      "end": 164.879,
      "text": "When one wants to grow rice, they go to"
    },
    {
      "id": 47,
      "start": 162.8,
      "end": 167.599,
      "text": "the market or they buy rice from the"
    },
    {
      "id": 48,
      "start": 164.879,
      "end": 169.44,
      "text": "neighbor or from any source. So there's"
    },
    {
      "id": 49,
      "start": 167.599,
      "end": 172.4,
      "text": "already a mixture of varieties in the"
    },
    {
      "id": 50,
      "start": 169.44,
      "end": 173.959,
      "text": "field. When this mixture is mil,"
    },
    {
      "id": 51,
      "start": 172.4,
      "end": 176.56,
      "text": "depending on the calibration of the"
    },
    {
      "id": 52,
      "start": 173.959,
      "end": 178.76,
      "text": "grader, if this is large, the finest"
    },
    {
      "id": 53,
      "start": 176.56,
      "end": 181.2,
      "text": "grains pass through without being"
    },
    {
      "id": 54,
      "start": 178.76,
      "end": 184.159,
      "text": "dehusted and the biggest grains will be"
    },
    {
      "id": 55,
      "start": 181.2,
      "end": 185.959,
      "text": "broken before coming out of the machine"
    },
    {
      "id": 56,
      "start": 184.159,
      "end": 188.4,
      "text": "because you take a mixture to the"
    },
    {
      "id": 57,
      "start": 185.959,
      "end": 191.599,
      "text": "miller. You can be sure you'll get a"
    },
    {
      "id": 58,
      "start": 188.4,
      "end": 194.959,
      "text": "heterogeneous rice. That's obvious. So"
    },
    {
      "id": 59,
      "start": 191.599,
      "end": 198.0,
      "text": "the seed problem must be solved and"
    },
    {
      "id": 60,
      "start": 194.959,
      "end": 201.68,
      "text": "producers have to learn that rice is not"
    },
    {
      "id": 61,
      "start": 198.0,
      "end": 204.879,
      "text": "like maze where yellow, red, white"
    },
    {
      "id": 62,
      "start": 201.68,
      "end": 207.12,
      "text": "grains can all be mixed but rice it"
    },
    {
      "id": 63,
      "start": 204.879,
      "end": 210.08,
      "text": "needs to be selected. The rice field"
    },
    {
      "id": 64,
      "start": 207.12,
      "end": 212.879,
      "text": "needs to be divided into plots according"
    },
    {
      "id": 65,
      "start": 210.08,
      "end": 216.239,
      "text": "to varieties so that it makes milling"
    },
    {
      "id": 66,
      "start": 212.879,
      "end": 219.239,
      "text": "easy and effective. This is very"
    },
    {
      "id": 67,
      "start": 216.239,
      "end": 219.239,
      "text": "important."
    },
    {
      "id": 68,
      "start": 220.319,
      "end": 225.44,
      "text": "This seed is from a single"
    },
    {
      "id": 69,
      "start": 222.92,
      "end": 228.599,
      "text": "variety. It's only from this type of"
    },
    {
      "id": 70,
      "start": 225.44,
      "end": 231.04,
      "text": "seed that a homogeneous harvest can be"
    },
    {
      "id": 71,
      "start": 228.599,
      "end": 234.04,
      "text": "obtained and therefore there's a"
    },
    {
      "id": 72,
      "start": 231.04,
      "end": 236.799,
      "text": "standard product after"
    },
    {
      "id": 73,
      "start": 234.04,
      "end": 238.76,
      "text": "milling. The picture on the right shows"
    },
    {
      "id": 74,
      "start": 236.799,
      "end": 241.68,
      "text": "a mixture of"
    },
    {
      "id": 75,
      "start": 238.76,
      "end": 244.319,
      "text": "varieties. With such seed, we obtain a"
    },
    {
      "id": 76,
      "start": 241.68,
      "end": 246.48,
      "text": "harvest that turns out a poor product"
    },
    {
      "id": 77,
      "start": 244.319,
      "end": 248.64,
      "text": "after milling."
    },
    {
      "id": 78,
      "start": 246.48,
      "end": 251.84,
      "text": "So, it's very important to avoid mixing"
    },
    {
      "id": 79,
      "start": 248.64,
      "end": 251.84,
      "text": "varieties right from"
    },
    {
      "id": 80,
      "start": 252.36,
      "end": 256.959,
      "text": "sewing. It's also recommended to"
    },
    {
      "id": 81,
      "start": 254.72,
      "end": 260.639,
      "text": "separate the various varieties"
    },
    {
      "id": 82,
      "start": 256.959,
      "end": 262.6,
      "text": "immediately after harvest to thresh them"
    },
    {
      "id": 83,
      "start": 260.639,
      "end": 265.44,
      "text": "and store them"
    },
    {
      "id": 84,
      "start": 262.6,
      "end": 270.08,
      "text": "separately because during milling a"
    },
    {
      "id": 85,
      "start": 265.44,
      "end": 270.08,
      "text": "mixture produces a non-standard"
    },
    {
      "id": 86,
      "start": 270.36,
      "end": 276.08,
      "text": "product. Apart from high amounts of"
    },
    {
      "id": 87,
      "start": 272.8,
      "end": 279.12,
      "text": "unmilled and broken grains, mixtures are"
    },
    {
      "id": 88,
      "start": 276.08,
      "end": 281.68,
      "text": "also hard to cook. Because each variety"
    },
    {
      "id": 89,
      "start": 279.12,
      "end": 285.199,
      "text": "has its own cooking time. So to satisfy"
    },
    {
      "id": 90,
      "start": 281.68,
      "end": 287.72,
      "text": "the consumer, avoid mixing the varieties"
    },
    {
      "id": 91,
      "start": 285.199,
      "end": 290.72,
      "text": "at all"
    },
    {
      "id": 92,
      "start": 287.72,
      "end": 292.88,
      "text": "stages. Harvesting at the right time"
    },
    {
      "id": 93,
      "start": 290.72,
      "end": 294.96,
      "text": "also helps maintain the quality of the"
    },
    {
      "id": 94,
      "start": 292.88,
      "end": 297.52,
      "text": "final product."
    },
    {
      "id": 95,
      "start": 294.96,
      "end": 300.0,
      "text": "When we harvest too early, the patty"
    },
    {
      "id": 96,
      "start": 297.52,
      "end": 302.36,
      "text": "contains a lot of green grains and"
    },
    {
      "id": 97,
      "start": 300.0,
      "end": 304.8,
      "text": "during milling they turn into"
    },
    {
      "id": 98,
      "start": 302.36,
      "end": 309.12,
      "text": "flour. In this way, you lose a lot of"
    },
    {
      "id": 99,
      "start": 304.8,
      "end": 309.12,
      "text": "rice and therefore a lot of"
    },
    {
      "id": 100,
      "start": 311.479,
      "end": 317.919,
      "text": "money. Rice production demands a lot of"
    },
    {
      "id": 101,
      "start": 314.44,
      "end": 319.08,
      "text": "work and without care, we cannot obtain"
    },
    {
      "id": 102,
      "start": 317.919,
      "end": 321.6,
      "text": "a good"
    },
    {
      "id": 103,
      "start": 319.08,
      "end": 324.56,
      "text": "product. The harvest must not be delayed"
    },
    {
      "id": 104,
      "start": 321.6,
      "end": 326.72,
      "text": "until the panacles are too dry."
    },
    {
      "id": 105,
      "start": 324.56,
      "end": 331.4,
      "text": "Because during milling, the overdrive"
    },
    {
      "id": 106,
      "start": 326.72,
      "end": 331.4,
      "text": "patty will only produce broken grains."
    },
    {
      "id": 107,
      "start": 341.6,
      "end": 347.199,
      "text": "The right harvesting time for rice is"
    },
    {
      "id": 108,
      "start": 343.6,
      "end": 349.0,
      "text": "generally 5 weeks after flowering or 5"
    },
    {
      "id": 109,
      "start": 347.199,
      "end": 352.32,
      "text": "weeks after the appearance of the"
    },
    {
      "id": 110,
      "start": 349.0,
      "end": 353.72,
      "text": "panacle which is a characteristic easily"
    },
    {
      "id": 111,
      "start": 352.32,
      "end": 357.6,
      "text": "detectable by"
    },
    {
      "id": 112,
      "start": 353.72,
      "end": 359.16,
      "text": "farmers. At this stage also the color in"
    },
    {
      "id": 113,
      "start": 357.6,
      "end": 362.199,
      "text": "the grains"
    },
    {
      "id": 114,
      "start": 359.16,
      "end": 366.56,
      "text": "change. The green will turn"
    },
    {
      "id": 115,
      "start": 362.199,
      "end": 369.919,
      "text": "strawlike, yellow or even gold depending"
    },
    {
      "id": 116,
      "start": 366.56,
      "end": 373.039,
      "text": "on the variety. And generally when 80%"
    },
    {
      "id": 117,
      "start": 369.919,
      "end": 375.28,
      "text": "of the field has changed color, we can"
    },
    {
      "id": 118,
      "start": 373.039,
      "end": 375.28,
      "text": "start"
    },
    {
      "id": 119,
      "start": 377.0,
      "end": 384.479,
      "text": "harvesting. To ensure good quality rice,"
    },
    {
      "id": 120,
      "start": 380.4,
      "end": 384.479,
      "text": "ensure you harvest at the right"
    },
    {
      "id": 121,
      "start": 385.4,
      "end": 392.319,
      "text": "time. During threshing, stones and other"
    },
    {
      "id": 122,
      "start": 388.72,
      "end": 395.44,
      "text": "impurities can get in. To avoid this,"
    },
    {
      "id": 123,
      "start": 392.319,
      "end": 399.12,
      "text": "prepare a clean threshing floor. It may"
    },
    {
      "id": 124,
      "start": 395.44,
      "end": 401.8,
      "text": "be a tarpolin, bags sewn together, a"
    },
    {
      "id": 125,
      "start": 399.12,
      "end": 404.88,
      "text": "cemented or compacted"
    },
    {
      "id": 126,
      "start": 401.8,
      "end": 407.039,
      "text": "floor. Farmers in Bangladesh even thresh"
    },
    {
      "id": 127,
      "start": 404.88,
      "end": 409.199,
      "text": "on a table enclosed by bags sewn"
    },
    {
      "id": 128,
      "start": 407.039,
      "end": 411.24,
      "text": "together."
    },
    {
      "id": 129,
      "start": 409.199,
      "end": 413.0,
      "text": "Threshing can be done by several"
    },
    {
      "id": 130,
      "start": 411.24,
      "end": 417.72,
      "text": "methods."
    },
    {
      "id": 131,
      "start": 413.0,
      "end": 419.919,
      "text": "Manually or the use of pedal and power"
    },
    {
      "id": 132,
      "start": 417.72,
      "end": 422.639,
      "text": "threshers. Regardless of the method"
    },
    {
      "id": 133,
      "start": 419.919,
      "end": 423.72,
      "text": "used, threshing must always be done on a"
    },
    {
      "id": 134,
      "start": 422.639,
      "end": 426.56,
      "text": "clean"
    },
    {
      "id": 135,
      "start": 423.72,
      "end": 430.599,
      "text": "floor. Let's hear about an innovative"
    },
    {
      "id": 136,
      "start": 426.56,
      "end": 430.599,
      "text": "example of hand threshing."
    },
    {
      "id": 137,
      "start": 431.599,
      "end": 436.479,
      "text": "Some farmers in the way we valley gather"
    },
    {
      "id": 138,
      "start": 433.759,
      "end": 439.52,
      "text": "the panacles and thresh them on a barrel"
    },
    {
      "id": 139,
      "start": 436.479,
      "end": 443.24,
      "text": "inside a mosquito net calmly and the"
    },
    {
      "id": 140,
      "start": 439.52,
      "end": 446.0,
      "text": "grains will not escape. They stay in the"
    },
    {
      "id": 141,
      "start": 443.24,
      "end": 448.56,
      "text": "net. This is an initiative of a farmer"
    },
    {
      "id": 142,
      "start": 446.0,
      "end": 450.24,
      "text": "who doesn't have a thresher. So to avoid"
    },
    {
      "id": 143,
      "start": 448.56,
      "end": 455.36,
      "text": "the contact with the soil and other"
    },
    {
      "id": 144,
      "start": 450.24,
      "end": 455.36,
      "text": "debris, they spread the nets and thresh"
    },
    {
      "id": 145,
      "start": 455.8,
      "end": 461.4,
      "text": "them. After threshing, carefully pick"
    },
    {
      "id": 146,
      "start": 458.8,
      "end": 464.88,
      "text": "the grains and winnow them on a clean"
    },
    {
      "id": 147,
      "start": 461.4,
      "end": 468.96,
      "text": "floor. Winnow the patty several times"
    },
    {
      "id": 148,
      "start": 464.88,
      "end": 468.96,
      "text": "and make sure no weed seeds"
    },
    {
      "id": 149,
      "start": 470.84,
      "end": 476.4,
      "text": "remain. After cleaning the patty of all"
    },
    {
      "id": 150,
      "start": 473.8,
      "end": 479.879,
      "text": "impurities, it's important to dry it on"
    },
    {
      "id": 151,
      "start": 476.4,
      "end": 479.879,
      "text": "a clean floor."
    },
    {
      "id": 152,
      "start": 483.599,
      "end": 489.84,
      "text": "We use the tarpolin to dry the patty to"
    },
    {
      "id": 153,
      "start": 486.639,
      "end": 489.84,
      "text": "prevent stones from getting"
    },
    {
      "id": 154,
      "start": 490.28,
      "end": 495.68,
      "text": "in. Avoid drying on the bare floor or by"
    },
    {
      "id": 155,
      "start": 493.44,
      "end": 498.8,
      "text": "the roadside because stones and other"
    },
    {
      "id": 156,
      "start": 495.68,
      "end": 498.8,
      "text": "impurities can get"
    },
    {
      "id": 157,
      "start": 499.56,
      "end": 504.96,
      "text": "in. Now let's hear from the director of"
    },
    {
      "id": 158,
      "start": 502.16,
      "end": 507.36,
      "text": "the Songai Center, an NGO involved in"
    },
    {
      "id": 159,
      "start": 504.96,
      "end": 509.52,
      "text": "rice sector development in Africa."
    },
    {
      "id": 160,
      "start": 507.36,
      "end": 511.68,
      "text": "quality rice could be sold twice the"
    },
    {
      "id": 161,
      "start": 509.52,
      "end": 513.919,
      "text": "price. So it is very very important for"
    },
    {
      "id": 162,
      "start": 511.68,
      "end": 516.88,
      "text": "them to invest themselves in producing"
    },
    {
      "id": 163,
      "start": 513.919,
      "end": 520.719,
      "text": "rice of quality making sure the sand is"
    },
    {
      "id": 164,
      "start": 516.88,
      "end": 523.519,
      "text": "not there the unripe rice is not there"
    },
    {
      "id": 165,
      "start": 520.719,
      "end": 528.56,
      "text": "so that the consumer who is becoming"
    },
    {
      "id": 166,
      "start": 523.519,
      "end": 530.32,
      "text": "more and more demanding will like to go."
    },
    {
      "id": 167,
      "start": 528.56,
      "end": 533.04,
      "text": "Now that we've learned how to avoid"
    },
    {
      "id": 168,
      "start": 530.32,
      "end": 535.56,
      "text": "mixing varieties, to harvest at the"
    },
    {
      "id": 169,
      "start": 533.04,
      "end": 537.92,
      "text": "right time, and to avoid"
    },
    {
      "id": 170,
      "start": 535.56,
      "end": 542.399,
      "text": "impurities, let's see what effect the"
    },
    {
      "id": 171,
      "start": 537.92,
      "end": 542.399,
      "text": "water content has on the grains during"
    },
    {
      "id": 172,
      "start": 542.76,
      "end": 548.2,
      "text": "milling. Grains that are too dry have"
    },
    {
      "id": 173,
      "start": 545.68,
      "end": 551.12,
      "text": "cracks and break during"
    },
    {
      "id": 174,
      "start": 548.2,
      "end": 553.399,
      "text": "milling. The cracks are so small that"
    },
    {
      "id": 175,
      "start": 551.12,
      "end": 556.0,
      "text": "they can't be seen with the naked"
    },
    {
      "id": 176,
      "start": 553.399,
      "end": 559.68,
      "text": "eye. This phenomenon is comparable to"
    },
    {
      "id": 177,
      "start": 556.0,
      "end": 559.68,
      "text": "clay cracking in the sun."
    },
    {
      "id": 178,
      "start": 563.92,
      "end": 568.56,
      "text": "When the rice is too dry, it breaks."
    },
    {
      "id": 179,
      "start": 566.8,
      "end": 571.519,
      "text": "That's why it's tested every time by"
    },
    {
      "id": 180,
      "start": 568.56,
      "end": 576.68,
      "text": "rubbing it in the palms of the hands. In"
    },
    {
      "id": 181,
      "start": 571.519,
      "end": 576.68,
      "text": "this way, we avoid drying it too much."
    },
    {
      "id": 182,
      "start": 578.48,
      "end": 584.32,
      "text": "If the sun is too high, dry the rice for"
    },
    {
      "id": 183,
      "start": 581.68,
      "end": 586.32,
      "text": "only a few hours in the open air. Turn"
    },
    {
      "id": 184,
      "start": 584.32,
      "end": 587.68,
      "text": "over the patty from time to time to dry"
    },
    {
      "id": 185,
      "start": 586.32,
      "end": 590.0,
      "text": "it evenly."
    },
    {
      "id": 186,
      "start": 587.68,
      "end": 592.959,
      "text": "And if possible, continue to dry it"
    },
    {
      "id": 187,
      "start": 590.0,
      "end": 595.12,
      "text": "afterwards in the shade."
    },
    {
      "id": 188,
      "start": 592.959,
      "end": 597.839,
      "text": "Dry until the grains have an acceptable"
    },
    {
      "id": 189,
      "start": 595.12,
      "end": 602.12,
      "text": "moisture content. Let's see how women in"
    },
    {
      "id": 190,
      "start": 597.839,
      "end": 602.12,
      "text": "a Benine village test this."
    },
    {
      "id": 191,
      "start": 603.279,
      "end": 607.68,
      "text": "To know that the patty is dry, we take"
    },
    {
      "id": 192,
      "start": 605.68,
      "end": 610.68,
      "text": "some and rub it between the palms of our"
    },
    {
      "id": 193,
      "start": 607.68,
      "end": 610.68,
      "text": "hands."
    },
    {
      "id": 194,
      "start": 611.04,
      "end": 616.32,
      "text": "We also test it with our teeth."
    },
    {
      "id": 195,
      "start": 614.079,
      "end": 619.959,
      "text": "When it breaks at a dry crack, then the"
    },
    {
      "id": 196,
      "start": 616.32,
      "end": 619.959,
      "text": "patty is dry."
    },
    {
      "id": 197,
      "start": 622.079,
      "end": 626.839,
      "text": "And if you think that after proper"
    },
    {
      "id": 198,
      "start": 623.76,
      "end": 629.839,
      "text": "drying the quality is guaranteed, no"
    },
    {
      "id": 199,
      "start": 626.839,
      "end": 633.04,
      "text": "way. Storage also determines the quality"
    },
    {
      "id": 200,
      "start": 629.839,
      "end": 636.399,
      "text": "of the rice because during storage the"
    },
    {
      "id": 201,
      "start": 633.04,
      "end": 636.399,
      "text": "patty can become moist"
    },
    {
      "id": 202,
      "start": 638.839,
      "end": 644.48,
      "text": "again. When the patty is stored directly"
    },
    {
      "id": 203,
      "start": 641.36,
      "end": 646.959,
      "text": "on a cement floor, It absorbs moisture"
    },
    {
      "id": 204,
      "start": 644.48,
      "end": 649.68,
      "text": "and then goes moldy. When the patty is"
    },
    {
      "id": 205,
      "start": 646.959,
      "end": 653.12,
      "text": "kept in a bag and stored on dry wood,"
    },
    {
      "id": 206,
      "start": 649.68,
      "end": 656.36,
      "text": "its conservation is good and it doesn't"
    },
    {
      "id": 207,
      "start": 653.12,
      "end": 656.36,
      "text": "go moldy."
    },
    {
      "id": 208,
      "start": 656.64,
      "end": 662.16,
      "text": "As we've just heard from an experienced"
    },
    {
      "id": 209,
      "start": 659.24,
      "end": 664.72,
      "text": "trader, you should always store patty on"
    },
    {
      "id": 210,
      "start": 662.16,
      "end": 665.8,
      "text": "materials that support and isolate it"
    },
    {
      "id": 211,
      "start": 664.72,
      "end": 668.959,
      "text": "from the"
    },
    {
      "id": 212,
      "start": 665.8,
      "end": 671.36,
      "text": "ground. Avoid storing bags on rusted"
    },
    {
      "id": 213,
      "start": 668.959,
      "end": 674.399,
      "text": "iron."
    },
    {
      "id": 214,
      "start": 671.36,
      "end": 677.6,
      "text": "Also leave a gap between the banks to"
    },
    {
      "id": 215,
      "start": 674.399,
      "end": 680.48,
      "text": "allow air to circulate and make pest"
    },
    {
      "id": 216,
      "start": 677.6,
      "end": 680.48,
      "text": "control"
    },
    {
      "id": 217,
      "start": 681.399,
      "end": 686.959,
      "text": "easier. As we saw, the quality of the"
    },
    {
      "id": 218,
      "start": 684.16,
      "end": 689.92,
      "text": "rice improves when we avoid varietal"
    },
    {
      "id": 219,
      "start": 686.959,
      "end": 689.92,
      "text": "mixtures and"
    },
    {
      "id": 220,
      "start": 690.92,
      "end": 696.959,
      "text": "impurities. We must also harvest at the"
    },
    {
      "id": 221,
      "start": 693.76,
      "end": 700.44,
      "text": "right time and ensure good drying and"
    },
    {
      "id": 222,
      "start": 696.959,
      "end": 700.44,
      "text": "patty storage."
    },
    {
      "id": 223,
      "start": 701.2,
      "end": 708.8,
      "text": "Handling the patty well before milling"
    },
    {
      "id": 224,
      "start": 703.519,
      "end": 708.8,
      "text": "helps to avoid huge losses and ensures"
    },
    {
      "id": 225,
      "start": 710.44,
      "end": 716.519,
      "text": "quality. As you may well be aware by"
    },
    {
      "id": 226,
      "start": 712.959,
      "end": 720.959,
      "text": "now, good quality rice requires"
    },
    {
      "id": 227,
      "start": 716.519,
      "end": 722.959,
      "text": "commitment and a lot of discipline."
    },
    {
      "id": 228,
      "start": 720.959,
      "end": 725.519,
      "text": "It is important for we Africans to"
    },
    {
      "id": 229,
      "start": 722.959,
      "end": 727.519,
      "text": "really invest ourselves in quality"
    },
    {
      "id": 230,
      "start": 725.519,
      "end": 729.36,
      "text": "production. That culture of success,"
    },
    {
      "id": 231,
      "start": 727.519,
      "end": 732.48,
      "text": "culture of quality is very important for"
    },
    {
      "id": 232,
      "start": 729.36,
      "end": 734.959,
      "text": "us to push back all the dumping from"
    },
    {
      "id": 233,
      "start": 732.48,
      "end": 736.48,
      "text": "outside. If we don't do it, whether it's"
    },
    {
      "id": 234,
      "start": 734.959,
      "end": 739.04,
      "text": "African, whether it's from my mother's"
    },
    {
      "id": 235,
      "start": 736.48,
      "end": 740.8,
      "text": "kitchen, people are not going to buy it."
    },
    {
      "id": 236,
      "start": 739.04,
      "end": 742.639,
      "text": "So we have to come to the left to be"
    },
    {
      "id": 237,
      "start": 740.8,
      "end": 745.279,
      "text": "competitive, we have to develop"
    },
    {
      "id": 238,
      "start": 742.639,
      "end": 747.6,
      "text": "competitive advantage and quality is the"
    },
    {
      "id": 239,
      "start": 745.279,
      "end": 749.92,
      "text": "most important element in competitive"
    },
    {
      "id": 240,
      "start": 747.6,
      "end": 752.56,
      "text": "advantage and it's at our reach. Within"
    },
    {
      "id": 241,
      "start": 749.92,
      "end": 755.04,
      "text": "our reach, we can do it."
    },
    {
      "id": 242,
      "start": 752.56,
      "end": 757.36,
      "text": "[Music]"
    },
    {
      "id": 243,
      "start": 755.04,
      "end": 760.079,
      "text": "African rice has excellent nutritional"
    },
    {
      "id": 244,
      "start": 757.36,
      "end": 762.0,
      "text": "and cooking characteristics. To ensure"
    },
    {
      "id": 245,
      "start": 760.079,
      "end": 764.56,
      "text": "that the final product is attractive to"
    },
    {
      "id": 246,
      "start": 762.0,
      "end": 767.44,
      "text": "the consumer, its quality must be"
    },
    {
      "id": 247,
      "start": 764.56,
      "end": 767.44,
      "text": "guaranteed at all"
    },
    {
      "id": 248,
      "start": 767.639,
      "end": 774.24,
      "text": "times. Rice farmers, traders, processes,"
    },
    {
      "id": 249,
      "start": 771.68,
      "end": 776.72,
      "text": "and consumers, we all have everything to"
    },
    {
      "id": 250,
      "start": 774.24,
      "end": 778.67,
      "text": "gain from protecting the quality of our"
    },
    {
      "id": 251,
      "start": 776.72,
      "end": 790.649,
      "text": "rice."
    },
    {
      "id": 252,
      "start": 778.67,
      "end": 790.649,
      "text": "[Music]"
    },
    {
      "id": 253,
      "start": 792.7,
      "end": 803.889,
      "text": "[Music]"
    }
  ],
  "language": "en"
}