{
  "text": "This list of mistakes is prepared when analyzing the statistics of questions on social networks, when an amateur asks us for help From year to year, the top five is constant and does not change. The first mistake: planting a cactus whenever you want. 80% of cacti and other succulents are bought in autumn, winter, and spring. Usually, the seller can simultaneously sell you a pot and a soil mixture. And then most of us almost immediately run to transplant the plant, not paying attention to the season of the year. If the transplanting is carried out during the time period from October to February, then there is a very high probability that the plant will die. This period in the temperate zone is characterized by insufficient intensity of illumination and a short duration of daylight hours. In such conditions, the roots will not be able to develop and absorb water from the soil mixture. In consequence, the plant will suffer from the so-called \"wet-feet\" effect. As a result, the roots will rot, and over time, the above-ground part of the plant will be affected. The 2nd mistake: planting the cactus in a container that is too large. The majority of plants are grown and subsequently sold in technical pots - containers with brown or black color. In most cases, the pot for transplanting is selected based on design features or from what is available on the market. The size of the pot is usually chosen by amateurs like this They say: \"The main thing is to get roots into the pot\" As a result, you look at the so-called comp. and you see a huge pot of soil and a small plant, which is lost in it The properly sized pot is the same as the one in which the plant grows or 10-15% more volume than previous one. Follow the rule: as a result we should enjoy the beauty of the plant and not a pot with the soil mixture. The next mistake: using wrong soil mixtures for planting a cactus \"soil mix under the tree, based on peat\" and so on All soil mixtures should be sterilized before planting a cactus into them, very few people do it in practice. Even a peat mixture, which theoretically should have no pests and diseases, has both of them. A probability of having something harmful to the plant exists everywhere For example, in turf ground, sand, mineral curbs, moss and so on. If the mixture has a strong deviation of acidity from the recommended the plant will immediately begin to suffer after planting it in such a mixture. Properly made mixture is a guarantee of good development of cacti for several years without transplanting. The mixture that we offer has all the properties that are necessary for cacti. It is sterilized and has a lot of nutrients. It does not require additional drainage. You can learn more information about making it from our video. The link is in the description below. The next mistake: watering a cactus whenever you want A lot of amateurs think that regular watering is the main rule for the care of the plant. As a result, such plant often dies after a couple of weeks. Many of succulents need to be watered once a month at most. The frequency of watering varies depending on the season of the year. When you buy a plant, it is preferable to learn its specific features. Even if you don't know what kind or family it belongs to you can place its photo in a social network in an appropriate group and you will be given a piece of advice on how the plant is called and how to water it. And the final mistake is: \"The more light and higher temp. - the better it is for the plant\" \"Cactus comes from a desert, so the sun doesn't scare it\" It is a common misconception among the amateurs. That's true! Most cacti come from deserts but in natural conditions cactus grows on the slope of the rock and it hides in shadow ofthe rock in the hottest time of the day. Or, for example, it can grow among thorns that also scatter sunlight. Moreover, in natural habitat the sky is covered with clouds that reduce lighting in the daytime. And what the conditions are we creating? We put the pot with the plant on sthe southern window and as a result, the midday heat combined with the strongest radiation puts our cactus into a state of shock. In addition to this, direct sunlight overheats the pot and the roots in it. The subsequent frequent watering makes the situation even worse. Roots under stress conditions are not capable of absorbing water Ss they will rot in wet soil mixture. Almost all succulents develop vegetatively at the temperature range from +15-30 C. All values that go beyond this range, put the plant under stress.",
  "segments": [
    {
      "id": 0,
      "start": 0.16,
      "end": 9.4,
      "text": "This list of mistakes is prepared when analyzing the statistics of questions on social networks, when an amateur asks us for help"
    },
    {
      "id": 1,
      "start": 9.4,
      "end": 14.303,
      "text": "From year to year, the top five is constant and does not change."
    },
    {
      "id": 2,
      "start": 14.303,
      "end": 18.0,
      "text": "The first mistake: planting a cactus whenever you want."
    },
    {
      "id": 3,
      "start": 18.0,
      "end": 24.62,
      "text": "80% of cacti and other succulents are bought in autumn, winter, and spring."
    },
    {
      "id": 4,
      "start": 24.76,
      "end": 30.38,
      "text": "Usually, the seller can simultaneously sell you a pot and a soil mixture."
    },
    {
      "id": 5,
      "start": 30.38,
      "end": 37.49,
      "text": "And then most of us almost immediately run to transplant the plant, not paying attention to the season of the year."
    },
    {
      "id": 6,
      "start": 37.49,
      "end": 46.671,
      "text": "If the transplanting is carried out during the time period from October to February, then there is a very high probability that the plant will die."
    },
    {
      "id": 7,
      "start": 46.671,
      "end": 55.716,
      "text": "This period in the temperate zone is characterized by insufficient intensity of illumination and a short duration of daylight hours."
    },
    {
      "id": 8,
      "start": 55.716,
      "end": 62.76,
      "text": "In such conditions, the roots will not be able to develop and absorb water from the soil mixture."
    },
    {
      "id": 9,
      "start": 62.76,
      "end": 68.34,
      "text": "In consequence, the plant will suffer from the so-called \"wet-feet\" effect."
    },
    {
      "id": 10,
      "start": 68.34,
      "end": 74.9,
      "text": "As a result, the roots will rot, and over time, the above-ground part of the plant will be affected."
    },
    {
      "id": 11,
      "start": 75.3,
      "end": 80.32,
      "text": "The 2nd mistake: planting the cactus in a container that is too large."
    },
    {
      "id": 12,
      "start": 80.32,
      "end": 85.38,
      "text": "The majority of plants are grown and subsequently sold in technical pots -"
    },
    {
      "id": 13,
      "start": 85.38,
      "end": 88.3,
      "text": "containers with brown or black color."
    },
    {
      "id": 14,
      "start": 88.3,
      "end": 93.64,
      "text": "In most cases, the pot for transplanting is selected based on design features"
    },
    {
      "id": 15,
      "start": 93.64,
      "end": 95.94,
      "text": "or from what is available on the market."
    },
    {
      "id": 16,
      "start": 96.38,
      "end": 100.22,
      "text": "The size of the pot is usually chosen by amateurs like this"
    },
    {
      "id": 17,
      "start": 100.36,
      "end": 104.14,
      "text": "They say: \"The main thing is to get roots into the pot\""
    },
    {
      "id": 18,
      "start": 104.28,
      "end": 112.02,
      "text": "As a result, you look at the so-called comp. and you see a huge pot of soil and a small plant, which is lost in it"
    },
    {
      "id": 19,
      "start": 112.62,
      "end": 117.48,
      "text": "The properly sized pot is the same as the one in which the plant grows"
    },
    {
      "id": 20,
      "start": 117.56,
      "end": 122.0,
      "text": "or 10-15% more volume than previous one."
    },
    {
      "id": 21,
      "start": 122.34,
      "end": 129.18,
      "text": "Follow the rule: as a result we should enjoy the beauty of the plant and not a pot with the soil mixture."
    },
    {
      "id": 22,
      "start": 129.62,
      "end": 134.34,
      "text": "The next mistake: using wrong soil mixtures for planting a cactus"
    },
    {
      "id": 23,
      "start": 134.44,
      "end": 138.46,
      "text": "\"soil mix under the tree, based on peat\" and so on"
    },
    {
      "id": 24,
      "start": 139.0,
      "end": 146.04,
      "text": "All soil mixtures should be sterilized before planting a cactus into them, very few people do it in practice."
    },
    {
      "id": 25,
      "start": 146.3,
      "end": 152.7,
      "text": "Even a peat mixture, which theoretically should have no pests and diseases, has both of them."
    },
    {
      "id": 26,
      "start": 152.7,
      "end": 157.5,
      "text": "A probability of having something harmful to the plant exists everywhere"
    },
    {
      "id": 27,
      "start": 157.72,
      "end": 163.66,
      "text": "For example, in turf ground, sand, mineral curbs, moss and so on."
    },
    {
      "id": 28,
      "start": 163.74,
      "end": 168.38,
      "text": "If the mixture has a strong deviation of acidity from the recommended"
    },
    {
      "id": 29,
      "start": 168.38,
      "end": 173.46,
      "text": "the plant will immediately begin to suffer after planting it in such a mixture."
    },
    {
      "id": 30,
      "start": 173.74,
      "end": 180.74,
      "text": "Properly made mixture is a guarantee of good development of cacti for several years without transplanting."
    },
    {
      "id": 31,
      "start": 181.14,
      "end": 186.68,
      "text": "The mixture that we offer has all the properties that are necessary for cacti."
    },
    {
      "id": 32,
      "start": 186.78,
      "end": 192.46,
      "text": "It is sterilized and has a lot of nutrients. It does not require additional drainage."
    },
    {
      "id": 33,
      "start": 192.46,
      "end": 198.62,
      "text": "You can learn more information about making it from our video. The link is in the description below."
    },
    {
      "id": 34,
      "start": 199.04,
      "end": 202.84,
      "text": "The next mistake: watering a cactus whenever you want"
    },
    {
      "id": 35,
      "start": 203.2,
      "end": 209.02,
      "text": "A lot of amateurs think that regular watering is the main rule for the care of the plant."
    },
    {
      "id": 36,
      "start": 209.22,
      "end": 213.8,
      "text": "As a result, such plant often dies after a couple of weeks."
    },
    {
      "id": 37,
      "start": 213.94,
      "end": 217.78,
      "text": "Many of succulents need to be watered once a month at most."
    },
    {
      "id": 38,
      "start": 217.78,
      "end": 221.98,
      "text": "The frequency of watering varies depending on the season of the year."
    },
    {
      "id": 39,
      "start": 222.08,
      "end": 226.72,
      "text": "When you buy a plant, it is preferable to learn its specific features."
    },
    {
      "id": 40,
      "start": 226.84,
      "end": 230.84,
      "text": "Even if you don't know what kind or family it belongs to"
    },
    {
      "id": 41,
      "start": 230.84,
      "end": 234.96,
      "text": "you can place its photo in a social network in an appropriate group"
    },
    {
      "id": 42,
      "start": 235.02,
      "end": 240.46,
      "text": "and you will be given a piece of advice on how the plant is called and how to water it."
    },
    {
      "id": 43,
      "start": 241.2,
      "end": 247.22,
      "text": "And the final mistake is: \"The more light and higher temp. - the better it is for the plant\""
    },
    {
      "id": 44,
      "start": 247.52,
      "end": 251.28,
      "text": "\"Cactus comes from a desert, so the sun doesn't scare it\""
    },
    {
      "id": 45,
      "start": 251.28,
      "end": 254.38,
      "text": "It is a common misconception among the amateurs."
    },
    {
      "id": 46,
      "start": 254.74,
      "end": 257.9,
      "text": "That's true! Most cacti come from deserts"
    },
    {
      "id": 47,
      "start": 257.9,
      "end": 261.78,
      "text": "but in natural conditions cactus grows on the slope of the rock"
    },
    {
      "id": 48,
      "start": 261.78,
      "end": 265.94,
      "text": "and it hides in shadow ofthe rock in the hottest time of the day."
    },
    {
      "id": 49,
      "start": 266.14,
      "end": 271.0,
      "text": "Or, for example, it can grow among thorns that also scatter sunlight."
    },
    {
      "id": 50,
      "start": 271.3,
      "end": 277.86,
      "text": "Moreover, in natural habitat the sky is covered with clouds that reduce lighting in the daytime."
    },
    {
      "id": 51,
      "start": 277.86,
      "end": 280.38,
      "text": "And what the conditions are we creating?"
    },
    {
      "id": 52,
      "start": 280.38,
      "end": 283.72,
      "text": "We put the pot with the plant on sthe southern window"
    },
    {
      "id": 53,
      "start": 283.72,
      "end": 291.02,
      "text": "and as a result, the midday heat combined with the strongest radiation puts our cactus into a state of shock."
    },
    {
      "id": 54,
      "start": 291.02,
      "end": 295.92,
      "text": "In addition to this, direct sunlight overheats the pot and the roots in it."
    },
    {
      "id": 55,
      "start": 296.02,
      "end": 300.5,
      "text": "The subsequent frequent watering makes the situation even worse."
    },
    {
      "id": 56,
      "start": 300.5,
      "end": 304.7,
      "text": "Roots under stress conditions are not capable of absorbing water"
    },
    {
      "id": 57,
      "start": 304.7,
      "end": 307.28,
      "text": "Ss they will rot in wet soil mixture."
    },
    {
      "id": 58,
      "start": 307.64,
      "end": 315.44,
      "text": "Almost all succulents develop vegetatively at the temperature range from +15-30 C."
    },
    {
      "id": 59,
      "start": 315.56,
      "end": 320.16,
      "text": "All values that go beyond this range, put the plant under stress."
    }
  ],
  "language": "en"
}