{
  "text": "There are many useful products you can find\non the shelves of your local garden center, and a few products that most gardeners in\nWyoming should avoid purchasing. One in particular is gypsum. Gypsum is made out of calcium sulphate and\nis advertised as a general soil conditioner. However, gypsum really serves one purpose,\nand that is to remediate sodic soils. And the only way to know that you have a sodic\nsoil, which is high levels of exchangeable sodium, is to get a soil test. But don’t use gypsum as a general soil conditioner. It has not been shown to adjust soil pH, or\nto necessarily lighten clay soils, unless they are sodic. Another product that many Wyoming gardeners\nshould avoid using is lime. Lime is calcium carbonate. Most of our soils in Wyoming are already high\nin calcium, and quite alkaline, meaning they have a high pH. And while many gardeners that move to Wyoming\nfrom other states are used to using lime, Wyoming soils typically do not benefit from\nthe addition of lime. The best thing we can do to improve our soils\nin Wyoming is to add organic matter, either in the form of compost, mulch, or manure. I recommend that you work with your local\nExtension educator to get a soil test to determine what nutrients your soil is lacking, and to\ndevelop a plan for managing the soil health in your garden. For the University of Wyoming Extension, I’m\nCaitlin Youngquist, and you’re watching From the Ground Up.",
  "segments": [
    {
      "id": 0,
      "start": 7.06,
      "end": 9.98,
      "text": "There are many useful products you can find\non the shelves of your local garden center,"
    },
    {
      "id": 1,
      "start": 9.98,
      "end": 14.49,
      "text": "and a few products that most gardeners in\nWyoming should avoid purchasing."
    },
    {
      "id": 2,
      "start": 14.49,
      "end": 16.46,
      "text": "One in particular is gypsum."
    },
    {
      "id": 3,
      "start": 16.46,
      "end": 20.41,
      "text": "Gypsum is made out of calcium sulphate and\nis advertised as a general soil conditioner."
    },
    {
      "id": 4,
      "start": 20.41,
      "end": 25.88,
      "text": "However, gypsum really serves one purpose,\nand that is to remediate sodic soils."
    },
    {
      "id": 5,
      "start": 25.88,
      "end": 29.529,
      "text": "And the only way to know that you have a sodic\nsoil, which is high levels of exchangeable"
    },
    {
      "id": 6,
      "start": 29.529,
      "end": 31.31,
      "text": "sodium, is to get a soil test."
    },
    {
      "id": 7,
      "start": 31.31,
      "end": 34.21,
      "text": "But don’t use gypsum as a general soil conditioner."
    },
    {
      "id": 8,
      "start": 34.21,
      "end": 39.96,
      "text": "It has not been shown to adjust soil pH, or\nto necessarily lighten clay soils, unless"
    },
    {
      "id": 9,
      "start": 39.96,
      "end": 41.41,
      "text": "they are sodic."
    },
    {
      "id": 10,
      "start": 41.41,
      "end": 45.36,
      "text": "Another product that many Wyoming gardeners\nshould avoid using is lime."
    },
    {
      "id": 11,
      "start": 45.36,
      "end": 47.14,
      "text": "Lime is calcium carbonate."
    },
    {
      "id": 12,
      "start": 47.14,
      "end": 51.51,
      "text": "Most of our soils in Wyoming are already high\nin calcium, and quite alkaline, meaning they"
    },
    {
      "id": 13,
      "start": 51.51,
      "end": 52.86,
      "text": "have a high pH."
    },
    {
      "id": 14,
      "start": 52.86,
      "end": 57.0,
      "text": "And while many gardeners that move to Wyoming\nfrom other states are used to using lime,"
    },
    {
      "id": 15,
      "start": 57.0,
      "end": 60.68,
      "text": "Wyoming soils typically do not benefit from\nthe addition of lime."
    },
    {
      "id": 16,
      "start": 60.68,
      "end": 64.54,
      "text": "The best thing we can do to improve our soils\nin Wyoming is to add organic matter, either"
    },
    {
      "id": 17,
      "start": 64.54,
      "end": 68.04,
      "text": "in the form of compost, mulch, or manure."
    },
    {
      "id": 18,
      "start": 68.04,
      "end": 71.99,
      "text": "I recommend that you work with your local\nExtension educator to get a soil test to determine"
    },
    {
      "id": 19,
      "start": 71.99,
      "end": 75.899,
      "text": "what nutrients your soil is lacking, and to\ndevelop a plan for managing the soil health"
    },
    {
      "id": 20,
      "start": 75.899,
      "end": 77.02,
      "text": "in your garden."
    },
    {
      "id": 21,
      "start": 77.02,
      "end": 80.1,
      "text": "For the University of Wyoming Extension, I’m\nCaitlin Youngquist, and you’re watching"
    },
    {
      "id": 22,
      "start": 80.1,
      "end": 80.929,
      "text": "From the Ground Up."
    }
  ],
  "language": "en"
}