{
  "text": "Hello everyone\nWelcome to jadam In this episode I m going to talk about how\nto use and store the JADAM Natural pesticide. Here I have prepared Jadam wetting agent,\njadam sulfur and Jadam herbal solution. With this combination you are getting perfect\nnatural pesticide for your garden. And in this vdeo I will show you how mix all\nthe solution in proper way. This is Jadam herbal solution. Which is the extract of any herbs with insect\nrepellent effect. And usual herbs that are often used is pepper\nmint, rose marry, lavender, Jerusalem artichoke, and bracken. Recently we have been testing the cosmos (flower)\nand it is showing significant result. With all these plants you can control aphid\nand mite. But above all our most favorite plant is the\ngingko until now. Because there is not a single pest that we\nwon t be able to control with this plant. All the details and ratio are recorded in\nmy book JADAM Organic Farming and JADAM Organic Pest and Disease control. Briefly speaking, It is very simple to make\nplant extracts. All you need is to boil the plant for 5 hours. And more detail information is spoken in my\nlecture. So please click the link above to see the\nlecture video. The first thing I would like to talk about\nis how to store the herbal solution. Once you are done with the boiling the herbs. Pour the solution in a bottle and put in a\nside way so that it will be vacuumed sealed. In this way you can store the herbal solution\nfor couple of years. But the problem is when you opened it for\nuse. Because when it contacts with the air, The\nproperties of the solution start to change gradually which cause decrease in its insecticidal\nfunction. Easy way to identify that the solution is\nusable or not is the air pressure of the bottle due to fermentation. But to make sure, best way is to drop small\nportion of JADAM wetting agent into it. Once you drop the JWA, if the color of the\nJHS doesn t change, that means it is still good for use. The another problem is how to properly store\na opened bottle. Even if you put into refrigerator, the changes\ncannot be stopped. So best way is to get a help of ethanol. There are usually two types of ethanol sold\nin a market,. One is with 84% purity and the other one is\nwith 99% purity. When you are using 99% ethanol, add 15% of\nethanol from what is left over. And 84% with 25%. With the help of the ethanol you can increase\nthe shelf life of JADAM herbal solution even in atmospheric temperature. When non of herbs are available near you,\nYou can also use the sodium hydroxide as an alternative. And the ratio is 1 kilo of sodium hydroxide\nfor 500 liters and 40 grams for 20 liters. With sodium hydroxide you can treat a problem\nof scale insects and snail. However, I do not recommend constant use of\nthis substance because of concentration damage. JWA is recommended to use around 200 to 600\nml for 20 liters and 5 to 15 liters for 500 Liters. JS is 40 ml to 60 ml for 20 liters And JHS is 200 ml to 600 ml for 20 liters. Recently, We have been receiving lot of question\nfrom floweriest and Gardner about our JADAM solution. So let me elaborate how to combine all three\nsolution for pest and disease control. This is the spray tool that I use for testing\nthe solution first before the field test. This particular brand of spray is my favorite\ndue to its long lasting durability. It cost little more but this is a product\nworth to checkout. Since we are testing 1 liter of small amount,\nthing that we measure the ratio also have to be syringes. Before doing mixing process. Please do use soft water. It is mandatory in order to achive it s full\ncapability. And now, Iet me show you how the disinfectant\nis made. I will measure 800 ml of soft water. First I will add 10 ml of JADAM Wetting agent. Next, 2ml of JADAM Sulfur. This yellowish liquid is the natural disinfectant. It can treat downy mildew, powdery mildew\nand anthracnose. Speaking of anthracnose, you can also control\nthis just by increasing the JWA, As you can see JADAM s Natural pest solutions\nare very easy to do with best effect on pest and disease control. And by adding JADAM Herbal solution, It becomes\nall purpose natural pest and disease solution. Then add a little more water to make it 1\nfull liter. Best thing about JADAM solution, unlike any\ncommercially available chemical solutions. JADAM solution is very safe to use. There will be no big problem even it is contacted\non our skin. You can also just wash the fruit to eat right\nafter spraying. JADAM Natural pest solution is all about the\ncombination of JWA, JS and JHS. To increase insecticidal effects, all you\nneed to do is increasing the amouing of JWA and JHS. And for disinfectant increase JS. But do concentration test in advance for JS\nbefore spraying into crops. In this way you can control almost all pest\nand disease, You can add additional sodium hydroxide and\nred clay powder for scale insect and snail. Let me show you how to add them Just add the sodium hydroxide in a beaker\nwith water to melt it down. This is very useful for scale insect. And red clay powder is for increasing penetration\neffect. With this simple you don t have to worry about\nthe pest and disease that occurs during farming. However, when you are adding sodium hydroxide,\nthe solution can irritate your skin when it makes a contact. I have also made all the detail videos how\nto all of these. It is also stated in my book so that you can\nread one for your self. Thank you for watching and I will see you\nguys in the next video.",
  "segments": [
    {
      "id": 0,
      "start": 15.65,
      "end": 18.36,
      "text": "Hello everyone\nWelcome to jadam"
    },
    {
      "id": 1,
      "start": 18.36,
      "end": 23.1,
      "text": "In this episode I m going to talk about how\nto use and store the JADAM Natural pesticide."
    },
    {
      "id": 2,
      "start": 23.1,
      "end": 27.08,
      "text": "Here I have prepared Jadam wetting agent,\njadam sulfur and Jadam herbal solution."
    },
    {
      "id": 3,
      "start": 27.08,
      "end": 30.17,
      "text": "With this combination you are getting perfect\nnatural pesticide for your garden."
    },
    {
      "id": 4,
      "start": 30.17,
      "end": 36.589,
      "text": "And in this vdeo I will show you how mix all\nthe solution in proper way."
    },
    {
      "id": 5,
      "start": 36.589,
      "end": 38.67,
      "text": "This is Jadam herbal solution."
    },
    {
      "id": 6,
      "start": 38.67,
      "end": 40.07,
      "text": "Which is the extract of any herbs with insect\nrepellent effect."
    },
    {
      "id": 7,
      "start": 40.07,
      "end": 44.18,
      "text": "And usual herbs that are often used is pepper\nmint, rose marry, lavender, Jerusalem artichoke,"
    },
    {
      "id": 8,
      "start": 44.18,
      "end": 45.18,
      "text": "and bracken."
    },
    {
      "id": 9,
      "start": 45.18,
      "end": 47.82,
      "text": "Recently we have been testing the cosmos (flower)\nand it is showing significant result."
    },
    {
      "id": 10,
      "start": 47.82,
      "end": 51.1,
      "text": "With all these plants you can control aphid\nand mite."
    },
    {
      "id": 11,
      "start": 51.1,
      "end": 54.44,
      "text": "But above all our most favorite plant is the\ngingko until now."
    },
    {
      "id": 12,
      "start": 54.44,
      "end": 61.71,
      "text": "Because there is not a single pest that we\nwon t be able to control with this plant."
    },
    {
      "id": 13,
      "start": 61.71,
      "end": 65.75,
      "text": "All the details and ratio are recorded in\nmy book JADAM Organic Farming and JADAM Organic"
    },
    {
      "id": 14,
      "start": 65.75,
      "end": 66.93,
      "text": "Pest and Disease control."
    },
    {
      "id": 15,
      "start": 66.93,
      "end": 69.52,
      "text": "Briefly speaking, It is very simple to make\nplant extracts."
    },
    {
      "id": 16,
      "start": 69.52,
      "end": 71.801,
      "text": "All you need is to boil the plant for 5 hours."
    },
    {
      "id": 17,
      "start": 71.801,
      "end": 73.082,
      "text": "And more detail information is spoken in my\nlecture."
    },
    {
      "id": 18,
      "start": 73.082,
      "end": 74.71,
      "text": "So please click the link above to see the\nlecture video."
    },
    {
      "id": 19,
      "start": 74.71,
      "end": 77.369,
      "text": "The first thing I would like to talk about\nis how to store the herbal solution."
    },
    {
      "id": 20,
      "start": 77.369,
      "end": 80.02,
      "text": "Once you are done with the boiling the herbs."
    },
    {
      "id": 21,
      "start": 80.02,
      "end": 85.67,
      "text": "Pour the solution in a bottle and put in a\nside way so that it will be vacuumed sealed."
    },
    {
      "id": 22,
      "start": 85.67,
      "end": 89.61,
      "text": "In this way you can store the herbal solution\nfor couple of years."
    },
    {
      "id": 23,
      "start": 89.61,
      "end": 90.61,
      "text": "But the problem is when you opened it for\nuse."
    },
    {
      "id": 24,
      "start": 90.61,
      "end": 93.93,
      "text": "Because when it contacts with the air, The\nproperties of the solution start to change"
    },
    {
      "id": 25,
      "start": 93.93,
      "end": 96.28,
      "text": "gradually which cause decrease in its insecticidal\nfunction."
    },
    {
      "id": 26,
      "start": 96.28,
      "end": 101.75,
      "text": "Easy way to identify that the solution is\nusable or not is the air pressure of the bottle"
    },
    {
      "id": 27,
      "start": 101.75,
      "end": 102.88,
      "text": "due to fermentation."
    },
    {
      "id": 28,
      "start": 102.88,
      "end": 120.549,
      "text": "But to make sure, best way is to drop small\nportion of JADAM wetting agent into it."
    },
    {
      "id": 29,
      "start": 120.549,
      "end": 140.93,
      "text": "Once you drop the JWA, if the color of the\nJHS doesn t change, that means it is still"
    },
    {
      "id": 30,
      "start": 140.93,
      "end": 142.95,
      "text": "good for use."
    },
    {
      "id": 31,
      "start": 142.95,
      "end": 151.639,
      "text": "The another problem is how to properly store\na opened bottle."
    },
    {
      "id": 32,
      "start": 151.639,
      "end": 158.459,
      "text": "Even if you put into refrigerator, the changes\ncannot be stopped."
    },
    {
      "id": 33,
      "start": 158.459,
      "end": 161.78,
      "text": "So best way is to get a help of ethanol."
    },
    {
      "id": 34,
      "start": 161.78,
      "end": 173.299,
      "text": "There are usually two types of ethanol sold\nin a market,."
    },
    {
      "id": 35,
      "start": 173.299,
      "end": 178.359,
      "text": "One is with 84% purity and the other one is\nwith 99% purity."
    },
    {
      "id": 36,
      "start": 178.359,
      "end": 184.04,
      "text": "When you are using 99% ethanol, add 15% of\nethanol from what is left over."
    },
    {
      "id": 37,
      "start": 184.04,
      "end": 185.989,
      "text": "And 84% with 25%."
    },
    {
      "id": 38,
      "start": 185.989,
      "end": 193.549,
      "text": "With the help of the ethanol you can increase\nthe shelf life of JADAM herbal solution even"
    },
    {
      "id": 39,
      "start": 193.549,
      "end": 194.569,
      "text": "in atmospheric temperature."
    },
    {
      "id": 40,
      "start": 194.569,
      "end": 199.79,
      "text": "When non of herbs are available near you,\nYou can also use the sodium hydroxide as an"
    },
    {
      "id": 41,
      "start": 199.79,
      "end": 200.79,
      "text": "alternative."
    },
    {
      "id": 42,
      "start": 200.79,
      "end": 206.26,
      "text": "And the ratio is 1 kilo of sodium hydroxide\nfor 500 liters and 40 grams for 20 liters."
    },
    {
      "id": 43,
      "start": 206.26,
      "end": 211.069,
      "text": "With sodium hydroxide you can treat a problem\nof scale insects and snail."
    },
    {
      "id": 44,
      "start": 211.069,
      "end": 216.23,
      "text": "However, I do not recommend constant use of\nthis substance because of concentration damage."
    },
    {
      "id": 45,
      "start": 216.23,
      "end": 233.45,
      "text": "JWA is recommended to use around 200 to 600\nml for 20 liters and 5 to 15 liters for 500"
    },
    {
      "id": 46,
      "start": 233.45,
      "end": 234.45,
      "text": "Liters."
    },
    {
      "id": 47,
      "start": 234.45,
      "end": 242.44,
      "text": "JS is 40 ml to 60 ml for 20 liters"
    },
    {
      "id": 48,
      "start": 242.44,
      "end": 246.75,
      "text": "And JHS is 200 ml to 600 ml for 20 liters."
    },
    {
      "id": 49,
      "start": 246.75,
      "end": 249.68,
      "text": "Recently, We have been receiving lot of question\nfrom floweriest and Gardner about our JADAM"
    },
    {
      "id": 50,
      "start": 249.68,
      "end": 250.68,
      "text": "solution."
    },
    {
      "id": 51,
      "start": 250.68,
      "end": 253.839,
      "text": "So let me elaborate how to combine all three\nsolution for pest and disease control."
    },
    {
      "id": 52,
      "start": 253.839,
      "end": 261.459,
      "text": "This is the spray tool that I use for testing\nthe solution first before the field test."
    },
    {
      "id": 53,
      "start": 261.459,
      "end": 271.21,
      "text": "This particular brand of spray is my favorite\ndue to its long lasting durability."
    },
    {
      "id": 54,
      "start": 271.21,
      "end": 296.229,
      "text": "It cost little more but this is a product\nworth to checkout."
    },
    {
      "id": 55,
      "start": 296.229,
      "end": 302.0,
      "text": "Since we are testing 1 liter of small amount,\nthing that we measure the ratio also have"
    },
    {
      "id": 56,
      "start": 302.0,
      "end": 303.02,
      "text": "to be syringes."
    },
    {
      "id": 57,
      "start": 303.02,
      "end": 304.379,
      "text": "Before doing mixing process."
    },
    {
      "id": 58,
      "start": 304.379,
      "end": 306.09,
      "text": "Please do use soft water."
    },
    {
      "id": 59,
      "start": 306.09,
      "end": 337.53,
      "text": "It is mandatory in order to achive it s full\ncapability."
    },
    {
      "id": 60,
      "start": 337.53,
      "end": 345.129,
      "text": "And now, Iet me show you how the disinfectant\nis made."
    },
    {
      "id": 61,
      "start": 345.129,
      "end": 351.37,
      "text": "I will measure 800 ml of soft water."
    },
    {
      "id": 62,
      "start": 351.37,
      "end": 360.3,
      "text": "First I will add 10 ml of JADAM Wetting agent."
    },
    {
      "id": 63,
      "start": 360.3,
      "end": 364.76,
      "text": "Next, 2ml of JADAM Sulfur."
    },
    {
      "id": 64,
      "start": 364.76,
      "end": 370.639,
      "text": "This yellowish liquid is the natural disinfectant."
    },
    {
      "id": 65,
      "start": 370.639,
      "end": 385.54,
      "text": "It can treat downy mildew, powdery mildew\nand anthracnose."
    },
    {
      "id": 66,
      "start": 385.54,
      "end": 391.8,
      "text": "Speaking of anthracnose, you can also control\nthis just by increasing the JWA,"
    },
    {
      "id": 67,
      "start": 391.8,
      "end": 397.871,
      "text": "As you can see JADAM s Natural pest solutions\nare very easy to do with best effect on pest"
    },
    {
      "id": 68,
      "start": 397.871,
      "end": 400.46,
      "text": "and disease control."
    },
    {
      "id": 69,
      "start": 400.46,
      "end": 406.819,
      "text": "And by adding JADAM Herbal solution, It becomes\nall purpose natural pest and disease solution."
    },
    {
      "id": 70,
      "start": 406.819,
      "end": 411.58,
      "text": "Then add a little more water to make it 1\nfull liter."
    },
    {
      "id": 71,
      "start": 411.58,
      "end": 414.77,
      "text": "Best thing about JADAM solution, unlike any\ncommercially available chemical solutions."
    },
    {
      "id": 72,
      "start": 414.77,
      "end": 420.37,
      "text": "JADAM solution is very safe to use."
    },
    {
      "id": 73,
      "start": 420.37,
      "end": 429.949,
      "text": "There will be no big problem even it is contacted\non our skin."
    },
    {
      "id": 74,
      "start": 429.949,
      "end": 435.599,
      "text": "You can also just wash the fruit to eat right\nafter spraying."
    },
    {
      "id": 75,
      "start": 435.599,
      "end": 443.46,
      "text": "JADAM Natural pest solution is all about the\ncombination of JWA, JS and JHS."
    },
    {
      "id": 76,
      "start": 443.46,
      "end": 473.99,
      "text": "To increase insecticidal effects, all you\nneed to do is increasing the amouing of JWA"
    },
    {
      "id": 77,
      "start": 473.99,
      "end": 475.479,
      "text": "and JHS."
    },
    {
      "id": 78,
      "start": 475.479,
      "end": 477.249,
      "text": "And for disinfectant increase JS."
    },
    {
      "id": 79,
      "start": 477.249,
      "end": 494.509,
      "text": "But do concentration test in advance for JS\nbefore spraying into crops."
    },
    {
      "id": 80,
      "start": 494.509,
      "end": 496.969,
      "text": "In this way you can control almost all pest\nand disease,"
    },
    {
      "id": 81,
      "start": 496.969,
      "end": 502.83,
      "text": "You can add additional sodium hydroxide and\nred clay powder for scale insect and snail."
    },
    {
      "id": 82,
      "start": 502.83,
      "end": 507.06,
      "text": "Let me show you how to add them"
    },
    {
      "id": 83,
      "start": 507.06,
      "end": 564.42,
      "text": "Just add the sodium hydroxide in a beaker\nwith water to melt it down."
    },
    {
      "id": 84,
      "start": 564.42,
      "end": 567.0,
      "text": "This is very useful for scale insect."
    },
    {
      "id": 85,
      "start": 567.0,
      "end": 571.07,
      "text": "And red clay powder is for increasing penetration\neffect."
    },
    {
      "id": 86,
      "start": 571.07,
      "end": 581.91,
      "text": "With this simple you don t have to worry about\nthe pest and disease that occurs during farming."
    },
    {
      "id": 87,
      "start": 581.91,
      "end": 590.62,
      "text": "However, when you are adding sodium hydroxide,\nthe solution can irritate your skin when it"
    },
    {
      "id": 88,
      "start": 590.62,
      "end": 591.62,
      "text": "makes a contact."
    },
    {
      "id": 89,
      "start": 591.62,
      "end": 596.2,
      "text": "I have also made all the detail videos how\nto all of these."
    },
    {
      "id": 90,
      "start": 596.2,
      "end": 601.88,
      "text": "It is also stated in my book so that you can\nread one for your self."
    },
    {
      "id": 91,
      "start": 601.88,
      "end": 605.35,
      "text": "Thank you for watching and I will see you\nguys in the next video."
    }
  ],
  "language": "en"
}