{
  "text": "Many landowners and homeowners around Wyoming\nchoose chemicals to help them manage weeds and insects around their properties. Chemicals can be used effectively when we\nmanage them effectively. One of the things we want to think about when\nmanaging chemicals is storage. The first thing we want to think about is\nlimiting access. We don’t want humans and animals to interact\nwith this unless they need to, especially youth, children, we want to keep them away\nfrom chemicals. One of the things we really want to focus\non when managing chemicals is the label. The label is going to tell us how toxic a\nchemical is, what the chemical’s used for, and how to store it. So, the University of Wyoming has a fact sheet\nonline at the University of Wyoming Extension webpage. It has 15 focus points to think about and\nto utilize when storing chemicals. You know, it talks about storing chemicals\nby category. We want our insecticides in a different place\nthan our herbicides. We want to certainly keep all chemicals in\ntheir original containers. We certainly don’t ever want to see them\nin food containers or anything like that. And the last thing we probably want to think\nabout is not to store our personal protective equipment, our gloves, our glasses, the things\nthat we’re thinking about keeping us safe from chemicals. We want to store them in a different place. If you have more questions, you can certainly\nlook at that fact sheet online. This is Hudson Hill with the University of\nWyoming Extension. You’re watching From the Ground Up.",
  "segments": [
    {
      "id": 0,
      "start": 7.37,
      "end": 12.86,
      "text": "Many landowners and homeowners around Wyoming\nchoose chemicals to help them manage weeds"
    },
    {
      "id": 1,
      "start": 12.86,
      "end": 15.719,
      "text": "and insects around their properties."
    },
    {
      "id": 2,
      "start": 15.719,
      "end": 18.77,
      "text": "Chemicals can be used effectively when we\nmanage them effectively."
    },
    {
      "id": 3,
      "start": 18.77,
      "end": 22.11,
      "text": "One of the things we want to think about when\nmanaging chemicals is storage."
    },
    {
      "id": 4,
      "start": 22.11,
      "end": 24.35,
      "text": "The first thing we want to think about is\nlimiting access."
    },
    {
      "id": 5,
      "start": 24.35,
      "end": 29.849,
      "text": "We don’t want humans and animals to interact\nwith this unless they need to, especially"
    },
    {
      "id": 6,
      "start": 29.849,
      "end": 32.759,
      "text": "youth, children, we want to keep them away\nfrom chemicals."
    },
    {
      "id": 7,
      "start": 32.759,
      "end": 36.16,
      "text": "One of the things we really want to focus\non when managing chemicals is the label."
    },
    {
      "id": 8,
      "start": 36.16,
      "end": 41.059,
      "text": "The label is going to tell us how toxic a\nchemical is, what the chemical’s used for,"
    },
    {
      "id": 9,
      "start": 41.059,
      "end": 42.19,
      "text": "and how to store it."
    },
    {
      "id": 10,
      "start": 42.19,
      "end": 48.43,
      "text": "So, the University of Wyoming has a fact sheet\nonline at the University of Wyoming Extension webpage."
    },
    {
      "id": 11,
      "start": 48.51,
      "end": 52.64,
      "text": "It has 15 focus points to think about and\nto utilize when storing chemicals."
    },
    {
      "id": 12,
      "start": 52.64,
      "end": 55.42,
      "text": "You know, it talks about storing chemicals\nby category."
    },
    {
      "id": 13,
      "start": 55.42,
      "end": 58.829,
      "text": "We want our insecticides in a different place\nthan our herbicides."
    },
    {
      "id": 14,
      "start": 58.829,
      "end": 62.019,
      "text": "We want to certainly keep all chemicals in\ntheir original containers."
    },
    {
      "id": 15,
      "start": 62.019,
      "end": 66.7,
      "text": "We certainly don’t ever want to see them\nin food containers or anything like that."
    },
    {
      "id": 16,
      "start": 66.7,
      "end": 71.44,
      "text": "And the last thing we probably want to think\nabout is not to store our personal protective"
    },
    {
      "id": 17,
      "start": 71.44,
      "end": 74.86,
      "text": "equipment, our gloves, our glasses, the things\nthat we’re thinking about keeping us safe"
    },
    {
      "id": 18,
      "start": 74.86,
      "end": 76.02,
      "text": "from chemicals."
    },
    {
      "id": 19,
      "start": 76.12,
      "end": 78.06,
      "text": "We want to store them in a different place."
    },
    {
      "id": 20,
      "start": 78.16,
      "end": 81.02,
      "text": "If you have more questions, you can certainly\nlook at that fact sheet online."
    },
    {
      "id": 21,
      "start": 81.03,
      "end": 84.08,
      "text": "This is Hudson Hill with the University of\nWyoming Extension."
    },
    {
      "id": 22,
      "start": 84.08,
      "end": 86.08,
      "text": "You’re watching From the Ground Up."
    }
  ],
  "language": "en"
}