{
  "text": "Today I want to share with you how I hash 200 chicks in a month as a small scale farmer and I hope this video will encourage someone out there who is just about to lose hope. I'm Esa and the channel name is Esafam and I'm from Kenya, East Africa. Continue supporting this channel and you'll be blessed. Now this is my cook and a small scale farmer. As you can see these are my laying hands. They are here and some of them are there up. These are the chickens that I use to produce my eggs so that I can incubate them and sell my chicks. As you can see, they're not so many, but they are enough for my incubator and they are enough for my sheep. There are several types of improved Kenya breeds. We have like, ho, sasso and we have raina and also we have curry. But for me here, I have chickens. These are the chickens that give me my eggs that I incubate. I hatch over 200 sheets per month and that is a good number considering that I am just a small scale farmer. And when I'm not hatching, sometimes I can sell the eggs to the the people who want to hatch. Now, this is where I brewed my chicks. And now, I want to take you through the process of incubation. How I start, how I place my eggs in the incubator. So, welcome as I show you the whole process until day 21 when the chicks are hashed. Welcome. I first start by collecting my eggs and storing them well until they are enough for my incubator. And I incubate eggs that are not more than 7 days for a good hatching because more than 7 days their hatching ability is low. That is why I prefer eggs that are not more than 7 days. After now collecting enough eggs for incubation, now I select uh the good ones like eggs with no cracks. I select also broken eggs and I I try to wipe the dirt ones with a piece of clo and also look for medium-sized eggs because sometimes large eggs can not be cannot hatch because most of the times it has a double yolk and it cannot hatch. Also I check whether it has one side with a sharp pointed head because the loud eggs they also don't hatch. So you have to select that that so that you get a good percentage of chicks when they hatch. After now I'm satisfied with my eggs. I put them in my incubator. My in cubet holds to 56 eggs. So you have to arrange them uh pointing one side like the way I'm doing here. You have to make them uh to to arrange them to point to one side so that they can be able to hatch well. That is what I do. I have an incubator with four compartments. So I arrange them the way they are. The same thing I'm arranging here is what I'm going to do to the other H compartments so that the eggs can h face on one side. You should not put h like some of them are facing the the other side other other eggs are facing the other side. So they should face one side so that they can hatch and you should keep you should put only the ones that are going to be enough in your incubator so that to give space for turning the eggs. Connect the wire to the motor and this wire is the one that help to roll the egg to turn the eggs. Then after you have finished, make sure that you close your incubator tightly so that the temperatures and humidity escaped at the right way. If you don't close your incubator well, the problem might occur during the incubation period period and you won't get good number of shakes. So be careful and close tightly. Then you turn the upper cover that has insulator that help the incubtor to restore heat. In case of blackout, the incubtor will still have heat. Now you switch on your incubtor and you need to set your humidity and temperature as per your incubtor. Now like this one, the first day the temperature should be 38° C and relative humidity 60%. From day 7 to 12, the temperature should be 37.8°. 28° C and relative humidity 55%. Day 13 to 18 the temperature should be 37.6° C and humidity should be 60 and 19 days after the temperature should be 37.2° C and the relative humidity should be 65. But all this depends with your incubator. From day seven, this is the time you need to do canding. And this is checking whether the eggs has started developing a neo. And at this time, from day one to day 18, the eggs will turn. But from day 19, remove your eggs from the rollers and put them on the hatching trays. And on day 21, hatching will start. and you'll get your cheeks. Now, this is how the incubtor looks like when it is fully connected. And you need to keep checking the humidity and temperature according to the days. And if the humidity is low, you need to add water. And I add water on the holes below to regulate the temperature and humidity. This is uh there is a way of measuring water depending on the advice you get from where you get your incubtor. Uh this incubator is AC and DC. Uh and that means it can use either electricity or it can use solar system. After 21 days, the the eggs are hatched and you remove the chicks from the incubator and transfer them to the brooder where you keep them uh and brood your cheeks with enough warmth and water and also feeds for at least a month. Then you can remove them and keep them somewhere else to get enough space. Sheets are so delicate and should be handled with great care and especially you supply them with enough heat. So in a buda you should have a eat sauce. You als you you can also use bulbs bros or depending on your choice. If I manage to sell my sheets at day old they are more profitable. So customers place orders and I hash for them and I find this a good idea because the expenses are minimal. We have come to the end of our video. I hope you have enjoyed the video. Thank you so much for watching. We appreciate you people for always being with us. people from my country Kenya, Uganda, Nigeria, South Africa, United States, United Kingdom, Zimbabwe and everybody who support us. We salute all of you for being part of us and the support you give you are showing to this channel. Thank you so much for the returning subscribers. And if you are very new to this channel, kindly subscribe, like, and you can share to as many people as you can. Now we are on to one 10,000 subscribers. Let's meet in another video and may God bless you.",
  "segments": [
    {
      "id": 0,
      "start": 4.16,
      "end": 10.08,
      "text": "Today I want to share with you how I"
    },
    {
      "id": 1,
      "start": 6.4,
      "end": 12.8,
      "text": "hash 200 chicks in a month as a small"
    },
    {
      "id": 2,
      "start": 10.08,
      "end": 15.44,
      "text": "scale farmer and I hope this video will"
    },
    {
      "id": 3,
      "start": 12.8,
      "end": 18.16,
      "text": "encourage someone out there who is just"
    },
    {
      "id": 4,
      "start": 15.44,
      "end": 20.96,
      "text": "about to lose hope. I'm Esa and the"
    },
    {
      "id": 5,
      "start": 18.16,
      "end": 23.92,
      "text": "channel name is Esafam and I'm from"
    },
    {
      "id": 6,
      "start": 20.96,
      "end": 27.439,
      "text": "Kenya, East Africa. Continue supporting"
    },
    {
      "id": 7,
      "start": 23.92,
      "end": 30.439,
      "text": "this channel and you'll be blessed."
    },
    {
      "id": 8,
      "start": 27.439,
      "end": 33.04,
      "text": "Now this is my cook and a small scale"
    },
    {
      "id": 9,
      "start": 30.439,
      "end": 34.2,
      "text": "farmer. As you can see these are my"
    },
    {
      "id": 10,
      "start": 33.04,
      "end": 37.04,
      "text": "laying"
    },
    {
      "id": 11,
      "start": 34.2,
      "end": 38.28,
      "text": "hands. They are here and some of them"
    },
    {
      "id": 12,
      "start": 37.04,
      "end": 41.44,
      "text": "are there"
    },
    {
      "id": 13,
      "start": 38.28,
      "end": 46.0,
      "text": "up. These are the chickens that I use to"
    },
    {
      "id": 14,
      "start": 41.44,
      "end": 49.68,
      "text": "produce my eggs so that I can incubate"
    },
    {
      "id": 15,
      "start": 46.0,
      "end": 55.16,
      "text": "them and sell my chicks."
    },
    {
      "id": 16,
      "start": 49.68,
      "end": 59.92,
      "text": "As you can see, they're not so many,"
    },
    {
      "id": 17,
      "start": 55.16,
      "end": 63.6,
      "text": "but they are enough for my incubator and"
    },
    {
      "id": 18,
      "start": 59.92,
      "end": 67.119,
      "text": "they are enough for my sheep. There are"
    },
    {
      "id": 19,
      "start": 63.6,
      "end": 73.32,
      "text": "several types of improved Kenya breeds."
    },
    {
      "id": 20,
      "start": 67.119,
      "end": 76.799,
      "text": "We have like, ho, sasso and we have"
    },
    {
      "id": 21,
      "start": 73.32,
      "end": 79.84,
      "text": "raina and also we have curry. But for me"
    },
    {
      "id": 22,
      "start": 76.799,
      "end": 85.28,
      "text": "here, I have chickens. These are the"
    },
    {
      "id": 23,
      "start": 79.84,
      "end": 85.28,
      "text": "chickens that give me my eggs that I"
    },
    {
      "id": 24,
      "start": 86.04,
      "end": 92.479,
      "text": "incubate. I hatch over 200 sheets per"
    },
    {
      "id": 25,
      "start": 89.72,
      "end": 95.4,
      "text": "month and that is a good number"
    },
    {
      "id": 26,
      "start": 92.479,
      "end": 98.64,
      "text": "considering that I am just a small scale"
    },
    {
      "id": 27,
      "start": 95.4,
      "end": 103.6,
      "text": "farmer. And when I'm not hatching,"
    },
    {
      "id": 28,
      "start": 98.64,
      "end": 106.96,
      "text": "sometimes I can sell the eggs to the the"
    },
    {
      "id": 29,
      "start": 103.6,
      "end": 109.759,
      "text": "people who want to hatch."
    },
    {
      "id": 30,
      "start": 106.96,
      "end": 112.32,
      "text": "Now, this is where I brewed my chicks."
    },
    {
      "id": 31,
      "start": 109.759,
      "end": 113.96,
      "text": "And now, I want to take you through the"
    },
    {
      "id": 32,
      "start": 112.32,
      "end": 117.759,
      "text": "process of"
    },
    {
      "id": 33,
      "start": 113.96,
      "end": 119.32,
      "text": "incubation. How I start, how I place my"
    },
    {
      "id": 34,
      "start": 117.759,
      "end": 122.96,
      "text": "eggs in the"
    },
    {
      "id": 35,
      "start": 119.32,
      "end": 126.84,
      "text": "incubator. So, welcome as I show you the"
    },
    {
      "id": 36,
      "start": 122.96,
      "end": 129.16,
      "text": "whole process until day 21 when the"
    },
    {
      "id": 37,
      "start": 126.84,
      "end": 133.16,
      "text": "chicks are"
    },
    {
      "id": 38,
      "start": 129.16,
      "end": 133.16,
      "text": "hashed. Welcome."
    },
    {
      "id": 39,
      "start": 133.76,
      "end": 140.72,
      "text": "I first start by collecting my eggs and"
    },
    {
      "id": 40,
      "start": 137.72,
      "end": 141.879,
      "text": "storing them well until they are enough"
    },
    {
      "id": 41,
      "start": 140.72,
      "end": 144.959,
      "text": "for my"
    },
    {
      "id": 42,
      "start": 141.879,
      "end": 148.48,
      "text": "incubator. And I incubate eggs that are"
    },
    {
      "id": 43,
      "start": 144.959,
      "end": 151.12,
      "text": "not more than 7 days for a good hatching"
    },
    {
      "id": 44,
      "start": 148.48,
      "end": 155.44,
      "text": "because more than 7 days their hatching"
    },
    {
      "id": 45,
      "start": 151.12,
      "end": 161.0,
      "text": "ability is low. That is why I prefer"
    },
    {
      "id": 46,
      "start": 155.44,
      "end": 161.0,
      "text": "eggs that are not more than 7 days."
    },
    {
      "id": 47,
      "start": 162.48,
      "end": 169.12,
      "text": "After now collecting enough eggs for"
    },
    {
      "id": 48,
      "start": 165.48,
      "end": 173.04,
      "text": "incubation, now I select uh the good"
    },
    {
      "id": 49,
      "start": 169.12,
      "end": 174.599,
      "text": "ones like eggs with no cracks. I select"
    },
    {
      "id": 50,
      "start": 173.04,
      "end": 180.08,
      "text": "also broken"
    },
    {
      "id": 51,
      "start": 174.599,
      "end": 182.72,
      "text": "eggs and I I try to wipe the dirt ones"
    },
    {
      "id": 52,
      "start": 180.08,
      "end": 185.76,
      "text": "with a piece of clo and also look for"
    },
    {
      "id": 53,
      "start": 182.72,
      "end": 189.4,
      "text": "medium-sized eggs because sometimes"
    },
    {
      "id": 54,
      "start": 185.76,
      "end": 192.48,
      "text": "large eggs can not be cannot hatch"
    },
    {
      "id": 55,
      "start": 189.4,
      "end": 196.8,
      "text": "because most of the times it has a"
    },
    {
      "id": 56,
      "start": 192.48,
      "end": 198.519,
      "text": "double yolk and it cannot hatch. Also I"
    },
    {
      "id": 57,
      "start": 196.8,
      "end": 203.48,
      "text": "check whether it"
    },
    {
      "id": 58,
      "start": 198.519,
      "end": 207.48,
      "text": "has one side with a sharp pointed head"
    },
    {
      "id": 59,
      "start": 203.48,
      "end": 211.84,
      "text": "because the loud eggs they also don't"
    },
    {
      "id": 60,
      "start": 207.48,
      "end": 214.799,
      "text": "hatch. So you have to select that that"
    },
    {
      "id": 61,
      "start": 211.84,
      "end": 216.92,
      "text": "so that you get a good percentage of"
    },
    {
      "id": 62,
      "start": 214.799,
      "end": 220.44,
      "text": "chicks when they"
    },
    {
      "id": 63,
      "start": 216.92,
      "end": 224.959,
      "text": "hatch. After now I'm satisfied with my"
    },
    {
      "id": 64,
      "start": 220.44,
      "end": 228.68,
      "text": "eggs. I put them in my incubator."
    },
    {
      "id": 65,
      "start": 224.959,
      "end": 232.48,
      "text": "My in cubet holds to 56"
    },
    {
      "id": 66,
      "start": 228.68,
      "end": 234.92,
      "text": "eggs. So you have to arrange them"
    },
    {
      "id": 67,
      "start": 232.48,
      "end": 238.68,
      "text": "uh pointing one"
    },
    {
      "id": 68,
      "start": 234.92,
      "end": 242.72,
      "text": "side like the way I'm doing"
    },
    {
      "id": 69,
      "start": 238.68,
      "end": 245.239,
      "text": "here. You have to make them uh to to"
    },
    {
      "id": 70,
      "start": 242.72,
      "end": 248.64,
      "text": "arrange them to point to one"
    },
    {
      "id": 71,
      "start": 245.239,
      "end": 251.64,
      "text": "side so that they can be able to hatch"
    },
    {
      "id": 72,
      "start": 248.64,
      "end": 251.64,
      "text": "well."
    },
    {
      "id": 73,
      "start": 254.56,
      "end": 259.88,
      "text": "That is what I"
    },
    {
      "id": 74,
      "start": 255.959,
      "end": 262.72,
      "text": "do. I have an incubator with four"
    },
    {
      "id": 75,
      "start": 259.88,
      "end": 265.68,
      "text": "compartments. So I arrange them the way"
    },
    {
      "id": 76,
      "start": 262.72,
      "end": 268.32,
      "text": "they are. The same thing I'm arranging"
    },
    {
      "id": 77,
      "start": 265.68,
      "end": 272.44,
      "text": "here is what I'm going to do to the"
    },
    {
      "id": 78,
      "start": 268.32,
      "end": 276.639,
      "text": "other H compartments so that the eggs"
    },
    {
      "id": 79,
      "start": 272.44,
      "end": 281.04,
      "text": "can h face on one side."
    },
    {
      "id": 80,
      "start": 276.639,
      "end": 283.919,
      "text": "You should not put h like some of them"
    },
    {
      "id": 81,
      "start": 281.04,
      "end": 288.08,
      "text": "are facing the the other side other"
    },
    {
      "id": 82,
      "start": 283.919,
      "end": 291.04,
      "text": "other eggs are facing the other side. So"
    },
    {
      "id": 83,
      "start": 288.08,
      "end": 295.199,
      "text": "they should face one side so that they"
    },
    {
      "id": 84,
      "start": 291.04,
      "end": 298.16,
      "text": "can hatch and you should keep you should"
    },
    {
      "id": 85,
      "start": 295.199,
      "end": 301.44,
      "text": "put only the ones that are going to be"
    },
    {
      "id": 86,
      "start": 298.16,
      "end": 305.44,
      "text": "enough in your incubator so that to give"
    },
    {
      "id": 87,
      "start": 301.44,
      "end": 309.24,
      "text": "space for turning the eggs."
    },
    {
      "id": 88,
      "start": 305.44,
      "end": 313.28,
      "text": "Connect the wire to the motor and this"
    },
    {
      "id": 89,
      "start": 309.24,
      "end": 316.0,
      "text": "wire is the one that help to roll the"
    },
    {
      "id": 90,
      "start": 313.28,
      "end": 319.52,
      "text": "egg to turn the eggs. Then after you"
    },
    {
      "id": 91,
      "start": 316.0,
      "end": 322.919,
      "text": "have finished, make sure that you close"
    },
    {
      "id": 92,
      "start": 319.52,
      "end": 326.0,
      "text": "your incubator tightly so that the"
    },
    {
      "id": 93,
      "start": 322.919,
      "end": 328.56,
      "text": "temperatures and humidity escaped at the"
    },
    {
      "id": 94,
      "start": 326.0,
      "end": 331.44,
      "text": "right way. If you don't close your"
    },
    {
      "id": 95,
      "start": 328.56,
      "end": 334.96,
      "text": "incubator well, the problem might occur"
    },
    {
      "id": 96,
      "start": 331.44,
      "end": 337.639,
      "text": "during the incubation period period and"
    },
    {
      "id": 97,
      "start": 334.96,
      "end": 343.6,
      "text": "you won't get good number of"
    },
    {
      "id": 98,
      "start": 337.639,
      "end": 343.6,
      "text": "shakes. So be careful and close"
    },
    {
      "id": 99,
      "start": 344.68,
      "end": 350.72,
      "text": "tightly. Then you turn the upper cover"
    },
    {
      "id": 100,
      "start": 347.6,
      "end": 353.52,
      "text": "that has insulator that help the"
    },
    {
      "id": 101,
      "start": 350.72,
      "end": 356.84,
      "text": "incubtor to restore heat. In case of"
    },
    {
      "id": 102,
      "start": 353.52,
      "end": 359.639,
      "text": "blackout, the incubtor will still have"
    },
    {
      "id": 103,
      "start": 356.84,
      "end": 362.4,
      "text": "heat. Now you switch on your"
    },
    {
      "id": 104,
      "start": 359.639,
      "end": 364.919,
      "text": "incubtor and you need to set your"
    },
    {
      "id": 105,
      "start": 362.4,
      "end": 367.96,
      "text": "humidity and temperature as per your"
    },
    {
      "id": 106,
      "start": 364.919,
      "end": 373.28,
      "text": "incubtor. Now like this one, the first"
    },
    {
      "id": 107,
      "start": 367.96,
      "end": 376.12,
      "text": "day the temperature should be 38° C and"
    },
    {
      "id": 108,
      "start": 373.28,
      "end": 379.84,
      "text": "relative humidity"
    },
    {
      "id": 109,
      "start": 376.12,
      "end": 381.8,
      "text": "60%. From day 7 to 12, the temperature"
    },
    {
      "id": 110,
      "start": 379.84,
      "end": 387.639,
      "text": "should be 37.8°."
    },
    {
      "id": 111,
      "start": 381.8,
      "end": 391.6,
      "text": "28° C and relative humidity"
    },
    {
      "id": 112,
      "start": 387.639,
      "end": 393.639,
      "text": "55%. Day 13 to 18 the temperature should"
    },
    {
      "id": 113,
      "start": 391.6,
      "end": 398.759,
      "text": "be"
    },
    {
      "id": 114,
      "start": 393.639,
      "end": 402.319,
      "text": "37.6° C and humidity should be"
    },
    {
      "id": 115,
      "start": 398.759,
      "end": 404.28,
      "text": "60 and 19 days after the temperature"
    },
    {
      "id": 116,
      "start": 402.319,
      "end": 408.56,
      "text": "should be"
    },
    {
      "id": 117,
      "start": 404.28,
      "end": 413.56,
      "text": "37.2° C and the relative humidity should"
    },
    {
      "id": 118,
      "start": 408.56,
      "end": 416.319,
      "text": "be 65. But all this depends with your"
    },
    {
      "id": 119,
      "start": 413.56,
      "end": 419.199,
      "text": "incubator. From day seven, this is the"
    },
    {
      "id": 120,
      "start": 416.319,
      "end": 421.52,
      "text": "time you need to do canding. And this is"
    },
    {
      "id": 121,
      "start": 419.199,
      "end": 422.919,
      "text": "checking whether the eggs has started"
    },
    {
      "id": 122,
      "start": 421.52,
      "end": 427.36,
      "text": "developing a"
    },
    {
      "id": 123,
      "start": 422.919,
      "end": 431.039,
      "text": "neo. And at this time, from day one to"
    },
    {
      "id": 124,
      "start": 427.36,
      "end": 433.599,
      "text": "day 18, the eggs will turn. But from day"
    },
    {
      "id": 125,
      "start": 431.039,
      "end": 436.96,
      "text": "19, remove your eggs from the rollers"
    },
    {
      "id": 126,
      "start": 433.599,
      "end": 440.08,
      "text": "and put them on the hatching trays. And"
    },
    {
      "id": 127,
      "start": 436.96,
      "end": 443.12,
      "text": "on day 21, hatching will start. and"
    },
    {
      "id": 128,
      "start": 440.08,
      "end": 443.12,
      "text": "you'll get your"
    },
    {
      "id": 129,
      "start": 443.72,
      "end": 450.08,
      "text": "cheeks. Now, this is how the incubtor"
    },
    {
      "id": 130,
      "start": 447.039,
      "end": 452.56,
      "text": "looks like when it is fully connected."
    },
    {
      "id": 131,
      "start": 450.08,
      "end": 454.96,
      "text": "And you need to keep checking the"
    },
    {
      "id": 132,
      "start": 452.56,
      "end": 457.759,
      "text": "humidity and temperature according to"
    },
    {
      "id": 133,
      "start": 454.96,
      "end": 461.039,
      "text": "the days. And if the humidity is low,"
    },
    {
      "id": 134,
      "start": 457.759,
      "end": 464.8,
      "text": "you need to add water. And I add water"
    },
    {
      "id": 135,
      "start": 461.039,
      "end": 467.36,
      "text": "on the holes below to regulate the"
    },
    {
      "id": 136,
      "start": 464.8,
      "end": 470.4,
      "text": "temperature and humidity."
    },
    {
      "id": 137,
      "start": 467.36,
      "end": 473.28,
      "text": "This is uh there is a way of measuring"
    },
    {
      "id": 138,
      "start": 470.4,
      "end": 475.639,
      "text": "water depending on the advice you get"
    },
    {
      "id": 139,
      "start": 473.28,
      "end": 481.08,
      "text": "from where you get your"
    },
    {
      "id": 140,
      "start": 475.639,
      "end": 485.0,
      "text": "incubtor. Uh this incubator is AC and"
    },
    {
      "id": 141,
      "start": 481.08,
      "end": 490.599,
      "text": "DC. Uh and that means it can use either"
    },
    {
      "id": 142,
      "start": 485.0,
      "end": 494.68,
      "text": "electricity or it can use solar"
    },
    {
      "id": 143,
      "start": 490.599,
      "end": 497.44,
      "text": "system. After 21 days, the the eggs are"
    },
    {
      "id": 144,
      "start": 494.68,
      "end": 500.599,
      "text": "hatched and you remove the chicks from"
    },
    {
      "id": 145,
      "start": 497.44,
      "end": 504.56,
      "text": "the incubator and transfer them to the"
    },
    {
      "id": 146,
      "start": 500.599,
      "end": 508.56,
      "text": "brooder where you keep them uh and brood"
    },
    {
      "id": 147,
      "start": 504.56,
      "end": 512.159,
      "text": "your cheeks with enough warmth and water"
    },
    {
      "id": 148,
      "start": 508.56,
      "end": 514.959,
      "text": "and also feeds for at least a month."
    },
    {
      "id": 149,
      "start": 512.159,
      "end": 520.68,
      "text": "Then you can remove them and keep them"
    },
    {
      "id": 150,
      "start": 514.959,
      "end": 520.68,
      "text": "somewhere else to get enough space."
    },
    {
      "id": 151,
      "start": 520.719,
      "end": 525.6,
      "text": "Sheets are so delicate and should be"
    },
    {
      "id": 152,
      "start": 522.959,
      "end": 529.279,
      "text": "handled with great care and especially"
    },
    {
      "id": 153,
      "start": 525.6,
      "end": 533.6,
      "text": "you supply them with enough heat. So in"
    },
    {
      "id": 154,
      "start": 529.279,
      "end": 537.279,
      "text": "a buda you should have a eat sauce. You"
    },
    {
      "id": 155,
      "start": 533.6,
      "end": 539.72,
      "text": "als you you can also use bulbs bros or"
    },
    {
      "id": 156,
      "start": 537.279,
      "end": 543.12,
      "text": "depending on your"
    },
    {
      "id": 157,
      "start": 539.72,
      "end": 546.0,
      "text": "choice. If I manage to sell my sheets at"
    },
    {
      "id": 158,
      "start": 543.12,
      "end": 548.56,
      "text": "day old they are more profitable. So"
    },
    {
      "id": 159,
      "start": 546.0,
      "end": 552.0,
      "text": "customers place orders and I hash for"
    },
    {
      "id": 160,
      "start": 548.56,
      "end": 555.36,
      "text": "them and I find this a good idea because"
    },
    {
      "id": 161,
      "start": 552.0,
      "end": 555.36,
      "text": "the expenses are"
    },
    {
      "id": 162,
      "start": 555.8,
      "end": 560.08,
      "text": "minimal. We have come to the end of our"
    },
    {
      "id": 163,
      "start": 558.32,
      "end": 562.48,
      "text": "video. I hope you have enjoyed the"
    },
    {
      "id": 164,
      "start": 560.08,
      "end": 564.24,
      "text": "video. Thank you so much for watching."
    },
    {
      "id": 165,
      "start": 562.48,
      "end": 566.56,
      "text": "We appreciate you people for always"
    },
    {
      "id": 166,
      "start": 564.24,
      "end": 570.16,
      "text": "being with us. people from my country"
    },
    {
      "id": 167,
      "start": 566.56,
      "end": 573.08,
      "text": "Kenya, Uganda, Nigeria, South Africa,"
    },
    {
      "id": 168,
      "start": 570.16,
      "end": 576.16,
      "text": "United States, United"
    },
    {
      "id": 169,
      "start": 573.08,
      "end": 578.72,
      "text": "Kingdom, Zimbabwe and everybody who"
    },
    {
      "id": 170,
      "start": 576.16,
      "end": 581.12,
      "text": "support us. We salute all of you for"
    },
    {
      "id": 171,
      "start": 578.72,
      "end": 583.839,
      "text": "being part of us and the support you"
    },
    {
      "id": 172,
      "start": 581.12,
      "end": 586.04,
      "text": "give you are showing to this channel."
    },
    {
      "id": 173,
      "start": 583.839,
      "end": 588.72,
      "text": "Thank you so much for the returning"
    },
    {
      "id": 174,
      "start": 586.04,
      "end": 592.16,
      "text": "subscribers. And if you are very new to"
    },
    {
      "id": 175,
      "start": 588.72,
      "end": 594.88,
      "text": "this channel, kindly subscribe, like,"
    },
    {
      "id": 176,
      "start": 592.16,
      "end": 596.279,
      "text": "and you can share to as many people as"
    },
    {
      "id": 177,
      "start": 594.88,
      "end": 603.36,
      "text": "you"
    },
    {
      "id": 178,
      "start": 596.279,
      "end": 603.36,
      "text": "can. Now we are on to one 10,000"
    },
    {
      "id": 179,
      "start": 603.48,
      "end": 611.32,
      "text": "subscribers. Let's meet in another video"
    },
    {
      "id": 180,
      "start": 607.279,
      "end": 611.32,
      "text": "and may God bless you."
    }
  ],
  "language": "en"
}