{
  "text": "Drip systems are great for efficiency in dry\nand arid climates. One thing to consider though, is the type\nof soil that you have in your garden or landscape that you’re watering. Depending on the soil type, you will want\nto select an emitter that matches that texture. The different types of emitters will emit\ndifferent amounts of water over a given amount of time. Most of these range from 1/2 a gallon to 2\ngallons in home and garden uses. This is amount of water per emitter, per hour. If you have a clay soil, you will want to\nselect an emitter closer to a 1/2 gallon per hour rate. These soils cannot accept as much water over\na given amount of time as compared to a sandy soil, which can handle a greater volume over\ntime. So, a 2 gallon emitter would be more appropriate\nfor a sandy soil. The University of Wyoming Extension can help\nin determining the type of soil you have in your garden or landscape. Once you’ve determined your soil texture\nand you’ve set up your irrigation system, you’ll need to run it for an appropriate\namount of time to make sure that you do not have any major leaks, you do not have any\npooling on top of the soil surface – meaning that you are over-applying water – and that\nthe water is actually going all the way through the root zone of the plants that you are looking\nto water. From the University of Wyoming Extension,\nI’m Brian Sebade, and you’re watching From the Ground Up.",
  "segments": [
    {
      "id": 0,
      "start": 7.379,
      "end": 11.95,
      "text": "Drip systems are great for efficiency in dry\nand arid climates."
    },
    {
      "id": 1,
      "start": 11.95,
      "end": 16.68,
      "text": "One thing to consider though, is the type\nof soil that you have in your garden or landscape"
    },
    {
      "id": 2,
      "start": 16.68,
      "end": 18.14,
      "text": "that you’re watering."
    },
    {
      "id": 3,
      "start": 18.14,
      "end": 23.759,
      "text": "Depending on the soil type, you will want\nto select an emitter that matches that texture."
    },
    {
      "id": 4,
      "start": 23.759,
      "end": 28.519,
      "text": "The different types of emitters will emit\ndifferent amounts of water over a given amount"
    },
    {
      "id": 5,
      "start": 28.519,
      "end": 29.519,
      "text": "of time."
    },
    {
      "id": 6,
      "start": 29.519,
      "end": 34.44,
      "text": "Most of these range from 1/2 a gallon to 2\ngallons in home and garden uses."
    },
    {
      "id": 7,
      "start": 34.44,
      "end": 37.53,
      "text": "This is amount of water per emitter, per hour."
    },
    {
      "id": 8,
      "start": 37.53,
      "end": 41.44,
      "text": "If you have a clay soil, you will want to\nselect an emitter closer to a 1/2 gallon per"
    },
    {
      "id": 9,
      "start": 41.44,
      "end": 42.48,
      "text": "hour rate."
    },
    {
      "id": 10,
      "start": 42.48,
      "end": 48.49,
      "text": "These soils cannot accept as much water over\na given amount of time as compared to a sandy"
    },
    {
      "id": 11,
      "start": 48.49,
      "end": 51.5,
      "text": "soil, which can handle a greater volume over\ntime."
    },
    {
      "id": 12,
      "start": 51.5,
      "end": 55.58,
      "text": "So, a 2 gallon emitter would be more appropriate\nfor a sandy soil."
    },
    {
      "id": 13,
      "start": 55.58,
      "end": 60.17,
      "text": "The University of Wyoming Extension can help\nin determining the type of soil you have in"
    },
    {
      "id": 14,
      "start": 60.17,
      "end": 62.26,
      "text": "your garden or landscape."
    },
    {
      "id": 15,
      "start": 62.26,
      "end": 66.05,
      "text": "Once you’ve determined your soil texture\nand you’ve set up your irrigation system,"
    },
    {
      "id": 16,
      "start": 66.05,
      "end": 70.0,
      "text": "you’ll need to run it for an appropriate\namount of time to make sure that you do not"
    },
    {
      "id": 17,
      "start": 70.0,
      "end": 74.859,
      "text": "have any major leaks, you do not have any\npooling on top of the soil surface – meaning"
    },
    {
      "id": 18,
      "start": 74.859,
      "end": 80.079,
      "text": "that you are over-applying water – and that\nthe water is actually going all the way through"
    },
    {
      "id": 19,
      "start": 80.079,
      "end": 82.93,
      "text": "the root zone of the plants that you are looking\nto water."
    },
    {
      "id": 20,
      "start": 82.93,
      "end": 86.579,
      "text": "From the University of Wyoming Extension,\nI’m Brian Sebade, and you’re watching"
    },
    {
      "id": 21,
      "start": 86.579,
      "end": 89.0,
      "text": "From the Ground Up."
    }
  ],
  "language": "en"
}