{
  "text": "Basic requirements to start your own pig farm. That will be the subject of today's video. All right guys, it's a beautiful moment right here. If you're new to this channel, please ensure you subscribe to this channel. Lots of great content on profitable pig farming will be made available to you. All right, let's start off quickly. What are the basic requirement for you to start your own pig farm? Now, number one, you need to have a space to keep them. That's basic. Uh you you wouldn't keep your animals. Of course, people run the extensive system, but I would advise you make use of the intensive because it's far more better than the the extensive system because pigs are fatty animals. So, you don't want your animals running all over the place. They would obviously lose lots of u energy and fat in the process. So, you want to ensure you keep them in an intensive system. So, one of the basic requirement is for you to have a space to keep them. And for you to build that space, one of the uh important thing you need to have is a fit trough. Of course, some people drop their feet on the ground like but I would not advise you run that all the time. I think it be good for you to have like a trough a feeding trough. It could be as big as this. It could be smaller than this. Anyh how you decide to do it. Uh works well as long as you can easily put their feeds in there conveniently and they can feed as they want. So that's one of the basic. Make sure you have a feeding trough for them. And then also ensure you make their ground the the flooring very solid because these guys are very destructive animals. If you have not if you have not heard that before, please quickly know this. These guys can dig almost anything. Once they get a a an avenue into the the hole, they keep they keep on digging. So you want to make sure you spend on quality materials for the flooring. That's one of the basic requirements you need. Make sure the flooring is very solid. Don't use too cheap material. Don't economize on that. Make a very solid flooring. So that's one of the other basic requirement you need to ensure that uh your animals are uh going to be all right and ensure that your farm will be good to go. Now you also need uh a way to give them water. Now there are different ways to go about that. Of course we in this pen right here, we're making use of this innovative way. But uh that's an alternative also. The trough you see there, one is actually meant for food, the other is meant for water. Now, this is like a deprecated system. Not too many people are using this system anymore where uh you are in short that serves not just as the water trough, but also as the wallow. I'm talking about this uh on trough right here. It also serve as the wall. But not many people are embibing this system anymore. The the modern way now is to make use of the shower system. the O system where you make use of O uh like this make use of O like this to uh to spray the animals. You could get better one to spray the animals and after spraying the animals the because one of the main reason why you have the wild system is because these guys are special animals that means they that means they don't have sweat paws. So they are special in the way in that sense their body doesn't have sweat paws. So whenever it's quite hot like a a situation like this. If you look right here, you can see what this guy is doing. You can see how this guy is sleeping inside the water, that's because it's trying to find a way to cool off the body. So because of that unique character unique characteristics of pigs, you have to make uh uh an avenue for them to be able to cool their body. And uh if you're not going to do the wall system, as I told you already is deprecated, you can also uh make use of the host. That means at a certain interval during the day, you will just uh take the O and spray the animals that's being used. Whichever one works for you. Some other people make use of the automated shower system or even the manual shower system where right on the top they fix uh the shower right on the top of their pen. They fix the shower there and they can switch there will be a switch where you can switch on the shower. the shower falls and uh when the shower is done at a point some people do some automated one where it comes at a certain moment in the day maybe in the afternoon maybe by 12:00 the shower will on for probably all depends that of course it's a modern world right now so lots of great innovations out there now but uh some people do the manual one where you just switch the shower on and it pours uh out for them that's of course all those things I talk about are quite expensive so depending on your budget you can decide on which want to use. So some people actually just make use of um the water paint. That means they use like a paint to just like a water container to just wet them with bowls. So that's another way people do it. So people use different means. So but you know some of these means are much more uh uh tedious than the other ones. So whichever one works for you, make sure you uh embibbe that. So one of the other basic requirement that we advise you to have on your farm is a water tank and there's a very big need for you to have this because these animals are are animals that have uh good they they use water a lot. Um pigs are animals that water is a basic requirement for them. So, you want to ensure you have a water tank depending on whatever capacity depending on the farm you have, you go for the capacity that you need, maybe 1,000 or 15 or 2,000 or probably bigger than that. So, you can get a water tank where you can easily pump your water into. So, also that also suggests that you are supposed to have a pumping machine where you pump your water into it. For those of us that don't have uh that are in places where the power supply is not connected there, we have to make use of the generator the automate uh the alternative means generator to obviously channel water into the tank. Of course, this is a new age where there is solar available. So, you can get some solar uh devices that would also help in pumping depending on your budget also. But there's a very big need for a water tank. It be very tedious for you to make use of a well. Of course, if your well is very close by, maybe your well is quite far, it be very tedious because these animals will need lots of water. And I would really advise you don't reduce the number of water you give them because of the stress that it takes. So what make sure you find a convenient means that would ensure that they will get water continually. Also obviously they will be needing a roof on their head. So please don't make that mistake of leaving your uh house to the open sky where water can easily fall in. Even though we say these guys needs water. We are not it doesn't mean they need water in that sense where the rain is always on them. They need a place where whenever rain is falling they can be under. They don't need water all the time. They need water at some certain time. So please you need to be informed that you need a roof. And for us right here, this roof was uh this is not the new one. You know, this this uh iron sheet you see here is uh the used one. Of course, when you are running a farm, you want to make use of the cheapest way to go about things as I already revealed in a video already. So, you want to make use of the cheapest way and you can see uh the way we did this using the bamboos and everything. So, make sure you uh do what works for you and do what works for your budget. But this is one of the basic grammar. You need a roof on the head of your piece. Also, you'll be making use of buckets obviously to mix your feeds. Uh the broom, the packa and all those many things. Those are some of the things you need to have. The shovel. You need a shovel. The what you use to mix your feed. All those things are basic requirements you should have while starting your farm. And you want to also make sure you have uh all the disinfectants that you will make use of to ensure the right bio security on your farm. So these are basic requirements you know basic meaning the most the things that you cannot afford but you must have on your farm. So please uh if you're planning to start your home pig farm these are some of the things you should look out for to start your farm you should look out to getting them on your farm. I really hope this has really helped you and has really inspired you. If you know you enjoy this video, click on the like button and uh give give us a thumbs up. And if you are yet to subscribe, you can subscribe. Enure sure you subscribe for lots of great quality content on profitable pig farming. Thank you very much. Bye-bye.",
  "segments": [
    {
      "id": 0,
      "start": 0.24,
      "end": 4.64,
      "text": "Basic requirements to start your own pig"
    },
    {
      "id": 1,
      "start": 2.879,
      "end": 6.64,
      "text": "farm. That will be the subject of"
    },
    {
      "id": 2,
      "start": 4.64,
      "end": 7.839,
      "text": "today's video. All right guys, it's a"
    },
    {
      "id": 3,
      "start": 6.64,
      "end": 9.12,
      "text": "beautiful moment right here. If you're"
    },
    {
      "id": 4,
      "start": 7.839,
      "end": 10.8,
      "text": "new to this channel, please ensure you"
    },
    {
      "id": 5,
      "start": 9.12,
      "end": 13.04,
      "text": "subscribe to this channel. Lots of great"
    },
    {
      "id": 6,
      "start": 10.8,
      "end": 14.559,
      "text": "content on profitable pig farming will"
    },
    {
      "id": 7,
      "start": 13.04,
      "end": 16.64,
      "text": "be made available to you. All right,"
    },
    {
      "id": 8,
      "start": 14.559,
      "end": 19.039,
      "text": "let's start off quickly. What are the"
    },
    {
      "id": 9,
      "start": 16.64,
      "end": 22.08,
      "text": "basic requirement for you to start your"
    },
    {
      "id": 10,
      "start": 19.039,
      "end": 25.68,
      "text": "own pig farm? Now, number one, you need"
    },
    {
      "id": 11,
      "start": 22.08,
      "end": 28.4,
      "text": "to have a space to keep them. That's"
    },
    {
      "id": 12,
      "start": 25.68,
      "end": 29.76,
      "text": "basic. Uh you you wouldn't keep your"
    },
    {
      "id": 13,
      "start": 28.4,
      "end": 32.48,
      "text": "animals. Of course, people run the"
    },
    {
      "id": 14,
      "start": 29.76,
      "end": 33.84,
      "text": "extensive system, but I would advise you"
    },
    {
      "id": 15,
      "start": 32.48,
      "end": 37.12,
      "text": "make use of the intensive because it's"
    },
    {
      "id": 16,
      "start": 33.84,
      "end": 40.48,
      "text": "far more better than the the extensive"
    },
    {
      "id": 17,
      "start": 37.12,
      "end": 42.079,
      "text": "system because pigs are fatty animals."
    },
    {
      "id": 18,
      "start": 40.48,
      "end": 43.52,
      "text": "So, you don't want your animals running"
    },
    {
      "id": 19,
      "start": 42.079,
      "end": 47.44,
      "text": "all over the place. They would obviously"
    },
    {
      "id": 20,
      "start": 43.52,
      "end": 49.28,
      "text": "lose lots of u energy and fat in the"
    },
    {
      "id": 21,
      "start": 47.44,
      "end": 51.2,
      "text": "process. So, you want to ensure you keep"
    },
    {
      "id": 22,
      "start": 49.28,
      "end": 53.039,
      "text": "them in an intensive system. So, one of"
    },
    {
      "id": 23,
      "start": 51.2,
      "end": 54.64,
      "text": "the basic requirement is for you to have"
    },
    {
      "id": 24,
      "start": 53.039,
      "end": 57.199,
      "text": "a space to keep them. And for you to"
    },
    {
      "id": 25,
      "start": 54.64,
      "end": 58.719,
      "text": "build that space, one of the uh"
    },
    {
      "id": 26,
      "start": 57.199,
      "end": 60.64,
      "text": "important thing you need to have is a"
    },
    {
      "id": 27,
      "start": 58.719,
      "end": 63.199,
      "text": "fit trough. Of course, some people drop"
    },
    {
      "id": 28,
      "start": 60.64,
      "end": 65.119,
      "text": "their feet on the ground like but I"
    },
    {
      "id": 29,
      "start": 63.199,
      "end": 67.2,
      "text": "would not advise you run that all the"
    },
    {
      "id": 30,
      "start": 65.119,
      "end": 69.76,
      "text": "time. I think it be good for you to have"
    },
    {
      "id": 31,
      "start": 67.2,
      "end": 71.52,
      "text": "like a trough a feeding trough. It could"
    },
    {
      "id": 32,
      "start": 69.76,
      "end": 74.56,
      "text": "be as big as this. It could be smaller"
    },
    {
      "id": 33,
      "start": 71.52,
      "end": 76.96,
      "text": "than this. Anyh how you decide to do it."
    },
    {
      "id": 34,
      "start": 74.56,
      "end": 79.119,
      "text": "Uh works well as long as you can easily"
    },
    {
      "id": 35,
      "start": 76.96,
      "end": 81.28,
      "text": "put their feeds in there conveniently"
    },
    {
      "id": 36,
      "start": 79.119,
      "end": 83.2,
      "text": "and they can feed as they want. So"
    },
    {
      "id": 37,
      "start": 81.28,
      "end": 85.759,
      "text": "that's one of the basic. Make sure you"
    },
    {
      "id": 38,
      "start": 83.2,
      "end": 88.08,
      "text": "have a feeding trough for them. And then"
    },
    {
      "id": 39,
      "start": 85.759,
      "end": 90.4,
      "text": "also ensure you make their ground the"
    },
    {
      "id": 40,
      "start": 88.08,
      "end": 93.119,
      "text": "the flooring very solid because these"
    },
    {
      "id": 41,
      "start": 90.4,
      "end": 94.4,
      "text": "guys are very destructive animals. If"
    },
    {
      "id": 42,
      "start": 93.119,
      "end": 96.64,
      "text": "you have not if you have not heard that"
    },
    {
      "id": 43,
      "start": 94.4,
      "end": 99.04,
      "text": "before, please quickly know this. These"
    },
    {
      "id": 44,
      "start": 96.64,
      "end": 102.479,
      "text": "guys can dig almost anything. Once they"
    },
    {
      "id": 45,
      "start": 99.04,
      "end": 104.56,
      "text": "get a a an avenue into the the hole,"
    },
    {
      "id": 46,
      "start": 102.479,
      "end": 107.32,
      "text": "they keep they keep on digging. So you"
    },
    {
      "id": 47,
      "start": 104.56,
      "end": 109.759,
      "text": "want to make sure you spend on quality"
    },
    {
      "id": 48,
      "start": 107.32,
      "end": 111.2,
      "text": "materials for the flooring. That's one"
    },
    {
      "id": 49,
      "start": 109.759,
      "end": 113.36,
      "text": "of the basic requirements you need. Make"
    },
    {
      "id": 50,
      "start": 111.2,
      "end": 115.36,
      "text": "sure the flooring is very solid. Don't"
    },
    {
      "id": 51,
      "start": 113.36,
      "end": 118.399,
      "text": "use too cheap material. Don't economize"
    },
    {
      "id": 52,
      "start": 115.36,
      "end": 119.68,
      "text": "on that. Make a very solid flooring. So"
    },
    {
      "id": 53,
      "start": 118.399,
      "end": 122.079,
      "text": "that's one of the other basic"
    },
    {
      "id": 54,
      "start": 119.68,
      "end": 125.68,
      "text": "requirement you need to ensure that uh"
    },
    {
      "id": 55,
      "start": 122.079,
      "end": 127.6,
      "text": "your animals are uh going to be all"
    },
    {
      "id": 56,
      "start": 125.68,
      "end": 129.84,
      "text": "right and ensure that your farm will be"
    },
    {
      "id": 57,
      "start": 127.6,
      "end": 131.44,
      "text": "good to go. Now you also need uh a way"
    },
    {
      "id": 58,
      "start": 129.84,
      "end": 133.04,
      "text": "to give them water. Now there are"
    },
    {
      "id": 59,
      "start": 131.44,
      "end": 135.44,
      "text": "different ways to go about that. Of"
    },
    {
      "id": 60,
      "start": 133.04,
      "end": 137.84,
      "text": "course we in this pen right here, we're"
    },
    {
      "id": 61,
      "start": 135.44,
      "end": 139.92,
      "text": "making use of this innovative way. But"
    },
    {
      "id": 62,
      "start": 137.84,
      "end": 141.68,
      "text": "uh that's an alternative also. The"
    },
    {
      "id": 63,
      "start": 139.92,
      "end": 143.68,
      "text": "trough you see there, one is actually"
    },
    {
      "id": 64,
      "start": 141.68,
      "end": 145.68,
      "text": "meant for food, the other is meant for"
    },
    {
      "id": 65,
      "start": 143.68,
      "end": 147.2,
      "text": "water. Now, this is like a deprecated"
    },
    {
      "id": 66,
      "start": 145.68,
      "end": 149.92,
      "text": "system. Not too many people are using"
    },
    {
      "id": 67,
      "start": 147.2,
      "end": 152.239,
      "text": "this system anymore where uh you are in"
    },
    {
      "id": 68,
      "start": 149.92,
      "end": 154.16,
      "text": "short that serves not just as the water"
    },
    {
      "id": 69,
      "start": 152.239,
      "end": 156.72,
      "text": "trough, but also as the wallow. I'm"
    },
    {
      "id": 70,
      "start": 154.16,
      "end": 159.84,
      "text": "talking about this uh on trough right"
    },
    {
      "id": 71,
      "start": 156.72,
      "end": 162.16,
      "text": "here. It also serve as the wall. But not"
    },
    {
      "id": 72,
      "start": 159.84,
      "end": 164.319,
      "text": "many people are embibing this system"
    },
    {
      "id": 73,
      "start": 162.16,
      "end": 166.56,
      "text": "anymore. The the modern way now is to"
    },
    {
      "id": 74,
      "start": 164.319,
      "end": 170.0,
      "text": "make use of the shower system. the O"
    },
    {
      "id": 75,
      "start": 166.56,
      "end": 174.239,
      "text": "system where you make use of O"
    },
    {
      "id": 76,
      "start": 170.0,
      "end": 177.519,
      "text": "uh like this make use of O like this to"
    },
    {
      "id": 77,
      "start": 174.239,
      "end": 180.16,
      "text": "uh to spray the animals. You could get"
    },
    {
      "id": 78,
      "start": 177.519,
      "end": 182.239,
      "text": "better one to spray the animals and"
    },
    {
      "id": 79,
      "start": 180.16,
      "end": 183.84,
      "text": "after spraying the animals the because"
    },
    {
      "id": 80,
      "start": 182.239,
      "end": 185.599,
      "text": "one of the main reason why you have the"
    },
    {
      "id": 81,
      "start": 183.84,
      "end": 188.48,
      "text": "wild system is because these guys are"
    },
    {
      "id": 82,
      "start": 185.599,
      "end": 190.56,
      "text": "special animals that means they that"
    },
    {
      "id": 83,
      "start": 188.48,
      "end": 192.159,
      "text": "means they don't have sweat paws. So"
    },
    {
      "id": 84,
      "start": 190.56,
      "end": 194.4,
      "text": "they are special in the way in that"
    },
    {
      "id": 85,
      "start": 192.159,
      "end": 197.2,
      "text": "sense their body doesn't have sweat"
    },
    {
      "id": 86,
      "start": 194.4,
      "end": 198.879,
      "text": "paws. So whenever it's quite hot like a"
    },
    {
      "id": 87,
      "start": 197.2,
      "end": 200.48,
      "text": "a situation like this. If you look right"
    },
    {
      "id": 88,
      "start": 198.879,
      "end": 202.56,
      "text": "here, you can see what this guy is"
    },
    {
      "id": 89,
      "start": 200.48,
      "end": 204.319,
      "text": "doing. You can see how this guy is"
    },
    {
      "id": 90,
      "start": 202.56,
      "end": 205.84,
      "text": "sleeping inside the water, that's"
    },
    {
      "id": 91,
      "start": 204.319,
      "end": 207.36,
      "text": "because it's trying to find a way to"
    },
    {
      "id": 92,
      "start": 205.84,
      "end": 209.12,
      "text": "cool off the body. So because of that"
    },
    {
      "id": 93,
      "start": 207.36,
      "end": 212.159,
      "text": "unique character unique characteristics"
    },
    {
      "id": 94,
      "start": 209.12,
      "end": 213.92,
      "text": "of pigs, you have to make uh uh an"
    },
    {
      "id": 95,
      "start": 212.159,
      "end": 216.0,
      "text": "avenue for them to be able to cool their"
    },
    {
      "id": 96,
      "start": 213.92,
      "end": 217.44,
      "text": "body. And uh if you're not going to do"
    },
    {
      "id": 97,
      "start": 216.0,
      "end": 220.56,
      "text": "the wall system, as I told you already"
    },
    {
      "id": 98,
      "start": 217.44,
      "end": 222.0,
      "text": "is deprecated, you can also uh make use"
    },
    {
      "id": 99,
      "start": 220.56,
      "end": 224.319,
      "text": "of the host. That means at a certain"
    },
    {
      "id": 100,
      "start": 222.0,
      "end": 227.04,
      "text": "interval during the day, you will just"
    },
    {
      "id": 101,
      "start": 224.319,
      "end": 228.799,
      "text": "uh take the O and spray the animals"
    },
    {
      "id": 102,
      "start": 227.04,
      "end": 230.48,
      "text": "that's being used. Whichever one works"
    },
    {
      "id": 103,
      "start": 228.799,
      "end": 232.72,
      "text": "for you. Some other people make use of"
    },
    {
      "id": 104,
      "start": 230.48,
      "end": 234.64,
      "text": "the automated shower system or even the"
    },
    {
      "id": 105,
      "start": 232.72,
      "end": 237.76,
      "text": "manual shower system where right on the"
    },
    {
      "id": 106,
      "start": 234.64,
      "end": 239.439,
      "text": "top they fix uh the shower right on the"
    },
    {
      "id": 107,
      "start": 237.76,
      "end": 241.439,
      "text": "top of their pen. They fix the shower"
    },
    {
      "id": 108,
      "start": 239.439,
      "end": 242.72,
      "text": "there and they can switch there will be"
    },
    {
      "id": 109,
      "start": 241.439,
      "end": 245.28,
      "text": "a switch where you can switch on the"
    },
    {
      "id": 110,
      "start": 242.72,
      "end": 247.92,
      "text": "shower. the shower falls and uh when the"
    },
    {
      "id": 111,
      "start": 245.28,
      "end": 249.68,
      "text": "shower is done at a point some people do"
    },
    {
      "id": 112,
      "start": 247.92,
      "end": 251.92,
      "text": "some automated one where it comes at a"
    },
    {
      "id": 113,
      "start": 249.68,
      "end": 254.72,
      "text": "certain moment in the day maybe in the"
    },
    {
      "id": 114,
      "start": 251.92,
      "end": 257.6,
      "text": "afternoon maybe by 12:00 the shower will"
    },
    {
      "id": 115,
      "start": 254.72,
      "end": 259.6,
      "text": "on for probably all depends that of"
    },
    {
      "id": 116,
      "start": 257.6,
      "end": 261.6,
      "text": "course it's a modern world right now so"
    },
    {
      "id": 117,
      "start": 259.6,
      "end": 263.68,
      "text": "lots of great innovations out there now"
    },
    {
      "id": 118,
      "start": 261.6,
      "end": 265.44,
      "text": "but uh some people do the manual one"
    },
    {
      "id": 119,
      "start": 263.68,
      "end": 267.68,
      "text": "where you just switch the shower on and"
    },
    {
      "id": 120,
      "start": 265.44,
      "end": 269.6,
      "text": "it pours uh out for them that's of"
    },
    {
      "id": 121,
      "start": 267.68,
      "end": 271.28,
      "text": "course all those things I talk about are"
    },
    {
      "id": 122,
      "start": 269.6,
      "end": 273.199,
      "text": "quite expensive so depending on your"
    },
    {
      "id": 123,
      "start": 271.28,
      "end": 275.36,
      "text": "budget you can decide on which want to"
    },
    {
      "id": 124,
      "start": 273.199,
      "end": 278.24,
      "text": "use. So some people actually just make"
    },
    {
      "id": 125,
      "start": 275.36,
      "end": 280.88,
      "text": "use of um the water paint. That means"
    },
    {
      "id": 126,
      "start": 278.24,
      "end": 282.8,
      "text": "they use like a paint to just like a"
    },
    {
      "id": 127,
      "start": 280.88,
      "end": 285.6,
      "text": "water container to just wet them with"
    },
    {
      "id": 128,
      "start": 282.8,
      "end": 287.68,
      "text": "bowls. So that's another way people do"
    },
    {
      "id": 129,
      "start": 285.6,
      "end": 289.52,
      "text": "it. So people use different means. So"
    },
    {
      "id": 130,
      "start": 287.68,
      "end": 293.04,
      "text": "but you know some of these means are"
    },
    {
      "id": 131,
      "start": 289.52,
      "end": 295.199,
      "text": "much more uh uh tedious than the other"
    },
    {
      "id": 132,
      "start": 293.04,
      "end": 299.12,
      "text": "ones. So whichever one works for you,"
    },
    {
      "id": 133,
      "start": 295.199,
      "end": 300.88,
      "text": "make sure you uh embibbe that. So one of"
    },
    {
      "id": 134,
      "start": 299.12,
      "end": 302.56,
      "text": "the other basic requirement that we"
    },
    {
      "id": 135,
      "start": 300.88,
      "end": 304.639,
      "text": "advise you to have on your farm is a"
    },
    {
      "id": 136,
      "start": 302.56,
      "end": 306.479,
      "text": "water tank and there's a very big need"
    },
    {
      "id": 137,
      "start": 304.639,
      "end": 310.56,
      "text": "for you to have this because these"
    },
    {
      "id": 138,
      "start": 306.479,
      "end": 313.759,
      "text": "animals are are animals that have uh"
    },
    {
      "id": 139,
      "start": 310.56,
      "end": 315.84,
      "text": "good they they use water a lot. Um pigs"
    },
    {
      "id": 140,
      "start": 313.759,
      "end": 317.28,
      "text": "are animals that water is a basic"
    },
    {
      "id": 141,
      "start": 315.84,
      "end": 320.4,
      "text": "requirement for them. So, you want to"
    },
    {
      "id": 142,
      "start": 317.28,
      "end": 321.759,
      "text": "ensure you have a water tank depending"
    },
    {
      "id": 143,
      "start": 320.4,
      "end": 324.16,
      "text": "on whatever capacity depending on the"
    },
    {
      "id": 144,
      "start": 321.759,
      "end": 328.08,
      "text": "farm you have, you go for the capacity"
    },
    {
      "id": 145,
      "start": 324.16,
      "end": 330.639,
      "text": "that you need, maybe 1,000 or 15 or"
    },
    {
      "id": 146,
      "start": 328.08,
      "end": 332.72,
      "text": "2,000 or probably bigger than that. So,"
    },
    {
      "id": 147,
      "start": 330.639,
      "end": 335.28,
      "text": "you can get a water tank where you can"
    },
    {
      "id": 148,
      "start": 332.72,
      "end": 337.039,
      "text": "easily pump your water into. So, also"
    },
    {
      "id": 149,
      "start": 335.28,
      "end": 339.199,
      "text": "that also suggests that you are supposed"
    },
    {
      "id": 150,
      "start": 337.039,
      "end": 341.52,
      "text": "to have a pumping machine where you pump"
    },
    {
      "id": 151,
      "start": 339.199,
      "end": 344.08,
      "text": "your water into it. For those of us that"
    },
    {
      "id": 152,
      "start": 341.52,
      "end": 346.8,
      "text": "don't have uh that are in places where"
    },
    {
      "id": 153,
      "start": 344.08,
      "end": 350.32,
      "text": "the power supply is not connected there,"
    },
    {
      "id": 154,
      "start": 346.8,
      "end": 352.56,
      "text": "we have to make use of the generator the"
    },
    {
      "id": 155,
      "start": 350.32,
      "end": 355.44,
      "text": "automate uh the alternative means"
    },
    {
      "id": 156,
      "start": 352.56,
      "end": 357.84,
      "text": "generator to obviously channel water"
    },
    {
      "id": 157,
      "start": 355.44,
      "end": 359.6,
      "text": "into the tank. Of course, this is a new"
    },
    {
      "id": 158,
      "start": 357.84,
      "end": 362.639,
      "text": "age where there is solar available. So,"
    },
    {
      "id": 159,
      "start": 359.6,
      "end": 364.319,
      "text": "you can get some solar uh devices that"
    },
    {
      "id": 160,
      "start": 362.639,
      "end": 366.24,
      "text": "would also help in pumping depending on"
    },
    {
      "id": 161,
      "start": 364.319,
      "end": 368.56,
      "text": "your budget also. But there's a very big"
    },
    {
      "id": 162,
      "start": 366.24,
      "end": 370.88,
      "text": "need for a water tank. It be very"
    },
    {
      "id": 163,
      "start": 368.56,
      "end": 372.24,
      "text": "tedious for you to make use of a well."
    },
    {
      "id": 164,
      "start": 370.88,
      "end": 374.88,
      "text": "Of course, if your well is very close"
    },
    {
      "id": 165,
      "start": 372.24,
      "end": 376.319,
      "text": "by, maybe your well is quite far, it be"
    },
    {
      "id": 166,
      "start": 374.88,
      "end": 377.68,
      "text": "very tedious because these animals will"
    },
    {
      "id": 167,
      "start": 376.319,
      "end": 381.52,
      "text": "need lots of water. And I would really"
    },
    {
      "id": 168,
      "start": 377.68,
      "end": 383.199,
      "text": "advise you don't reduce the number of"
    },
    {
      "id": 169,
      "start": 381.52,
      "end": 385.919,
      "text": "water you give them because of the"
    },
    {
      "id": 170,
      "start": 383.199,
      "end": 387.84,
      "text": "stress that it takes. So what make sure"
    },
    {
      "id": 171,
      "start": 385.919,
      "end": 390.759,
      "text": "you find a convenient means that would"
    },
    {
      "id": 172,
      "start": 387.84,
      "end": 393.199,
      "text": "ensure that they will get water"
    },
    {
      "id": 173,
      "start": 390.759,
      "end": 395.52,
      "text": "continually. Also obviously they will be"
    },
    {
      "id": 174,
      "start": 393.199,
      "end": 398.319,
      "text": "needing a roof on their head. So please"
    },
    {
      "id": 175,
      "start": 395.52,
      "end": 401.68,
      "text": "don't make that mistake of leaving your"
    },
    {
      "id": 176,
      "start": 398.319,
      "end": 403.52,
      "text": "uh house to the open sky where water can"
    },
    {
      "id": 177,
      "start": 401.68,
      "end": 405.759,
      "text": "easily fall in. Even though we say these"
    },
    {
      "id": 178,
      "start": 403.52,
      "end": 407.84,
      "text": "guys needs water. We are not it doesn't"
    },
    {
      "id": 179,
      "start": 405.759,
      "end": 410.4,
      "text": "mean they need water in that sense where"
    },
    {
      "id": 180,
      "start": 407.84,
      "end": 411.919,
      "text": "the rain is always on them. They need a"
    },
    {
      "id": 181,
      "start": 410.4,
      "end": 414.08,
      "text": "place where whenever rain is falling"
    },
    {
      "id": 182,
      "start": 411.919,
      "end": 415.84,
      "text": "they can be under. They don't need water"
    },
    {
      "id": 183,
      "start": 414.08,
      "end": 418.639,
      "text": "all the time. They need water at some"
    },
    {
      "id": 184,
      "start": 415.84,
      "end": 421.039,
      "text": "certain time. So please you need to be"
    },
    {
      "id": 185,
      "start": 418.639,
      "end": 423.919,
      "text": "informed that you need a roof. And for"
    },
    {
      "id": 186,
      "start": 421.039,
      "end": 427.039,
      "text": "us right here, this roof was uh this is"
    },
    {
      "id": 187,
      "start": 423.919,
      "end": 430.72,
      "text": "not the new one. You know, this this uh"
    },
    {
      "id": 188,
      "start": 427.039,
      "end": 432.56,
      "text": "iron sheet you see here is uh the used"
    },
    {
      "id": 189,
      "start": 430.72,
      "end": 434.56,
      "text": "one. Of course, when you are running a"
    },
    {
      "id": 190,
      "start": 432.56,
      "end": 436.56,
      "text": "farm, you want to make use of the"
    },
    {
      "id": 191,
      "start": 434.56,
      "end": 439.039,
      "text": "cheapest way to go about things as I"
    },
    {
      "id": 192,
      "start": 436.56,
      "end": 440.319,
      "text": "already revealed in a video already. So,"
    },
    {
      "id": 193,
      "start": 439.039,
      "end": 442.72,
      "text": "you want to make use of the cheapest way"
    },
    {
      "id": 194,
      "start": 440.319,
      "end": 444.56,
      "text": "and you can see uh the way we did this"
    },
    {
      "id": 195,
      "start": 442.72,
      "end": 447.12,
      "text": "using the bamboos and everything. So,"
    },
    {
      "id": 196,
      "start": 444.56,
      "end": 449.039,
      "text": "make sure you uh do what works for you"
    },
    {
      "id": 197,
      "start": 447.12,
      "end": 450.4,
      "text": "and do what works for your budget. But"
    },
    {
      "id": 198,
      "start": 449.039,
      "end": 453.0,
      "text": "this is one of the basic grammar. You"
    },
    {
      "id": 199,
      "start": 450.4,
      "end": 455.36,
      "text": "need a roof on the head of your"
    },
    {
      "id": 200,
      "start": 453.0,
      "end": 457.68,
      "text": "piece. Also, you'll be making use of"
    },
    {
      "id": 201,
      "start": 455.36,
      "end": 460.0,
      "text": "buckets obviously to mix your feeds. Uh"
    },
    {
      "id": 202,
      "start": 457.68,
      "end": 461.36,
      "text": "the broom, the packa and all those many"
    },
    {
      "id": 203,
      "start": 460.0,
      "end": 463.68,
      "text": "things. Those are some of the things you"
    },
    {
      "id": 204,
      "start": 461.36,
      "end": 465.759,
      "text": "need to have. The shovel. You need a"
    },
    {
      "id": 205,
      "start": 463.68,
      "end": 467.68,
      "text": "shovel. The what you use to mix your"
    },
    {
      "id": 206,
      "start": 465.759,
      "end": 469.44,
      "text": "feed. All those things are basic"
    },
    {
      "id": 207,
      "start": 467.68,
      "end": 471.759,
      "text": "requirements you should have while"
    },
    {
      "id": 208,
      "start": 469.44,
      "end": 473.919,
      "text": "starting your farm. And you want to also"
    },
    {
      "id": 209,
      "start": 471.759,
      "end": 476.16,
      "text": "make sure you have uh all the"
    },
    {
      "id": 210,
      "start": 473.919,
      "end": 479.52,
      "text": "disinfectants that you will make use of"
    },
    {
      "id": 211,
      "start": 476.16,
      "end": 482.8,
      "text": "to ensure the right bio security on your"
    },
    {
      "id": 212,
      "start": 479.52,
      "end": 486.56,
      "text": "farm. So these are basic requirements"
    },
    {
      "id": 213,
      "start": 482.8,
      "end": 488.56,
      "text": "you know basic meaning the most the"
    },
    {
      "id": 214,
      "start": 486.56,
      "end": 491.759,
      "text": "things that you cannot afford but you"
    },
    {
      "id": 215,
      "start": 488.56,
      "end": 493.44,
      "text": "must have on your farm. So please uh if"
    },
    {
      "id": 216,
      "start": 491.759,
      "end": 494.8,
      "text": "you're planning to start your home pig"
    },
    {
      "id": 217,
      "start": 493.44,
      "end": 496.96,
      "text": "farm these are some of the things you"
    },
    {
      "id": 218,
      "start": 494.8,
      "end": 498.72,
      "text": "should look out for to start your farm"
    },
    {
      "id": 219,
      "start": 496.96,
      "end": 500.479,
      "text": "you should look out to getting them on"
    },
    {
      "id": 220,
      "start": 498.72,
      "end": 502.4,
      "text": "your farm. I really hope this has really"
    },
    {
      "id": 221,
      "start": 500.479,
      "end": 504.08,
      "text": "helped you and has really inspired you."
    },
    {
      "id": 222,
      "start": 502.4,
      "end": 507.68,
      "text": "If you know you enjoy this video, click"
    },
    {
      "id": 223,
      "start": 504.08,
      "end": 509.52,
      "text": "on the like button and uh give give us a"
    },
    {
      "id": 224,
      "start": 507.68,
      "end": 511.199,
      "text": "thumbs up. And if you are yet to"
    },
    {
      "id": 225,
      "start": 509.52,
      "end": 513.36,
      "text": "subscribe, you can subscribe. Enure sure"
    },
    {
      "id": 226,
      "start": 511.199,
      "end": 516.32,
      "text": "you subscribe for lots of great quality"
    },
    {
      "id": 227,
      "start": 513.36,
      "end": 520.039,
      "text": "content on profitable pig farming. Thank"
    },
    {
      "id": 228,
      "start": 516.32,
      "end": 520.039,
      "text": "you very much. Bye-bye."
    }
  ],
  "language": "en"
}