{
  "text": "Good day everyone. We're just going to have a bit of a general clean up around here on this chilly, wet autumn day. Well, it's not, is it? It's quite warm, actually. Blue skies, no rain. It's still time to get some of the plants cleaned up a bit, some of the plants out cuz their crops have finished, and some new ones in. So, what are we going to do today? We're going to clean up the mint. We're going to get rid of our eggplant which is past it used by date and replace it with carrots. And the reason for that I shall explain. Now mint goes a bit funny. This is actually apple mint I think from memory that I grew from seed. We're just going to cut all the dead stuff off. Doesn't need a new basket at some point. You can tell if it's apple mint by the smell. Zapple mint. Going to take every dead bit off. And if you look here, we've got some lovely new growth. So, this should come good, ready for next summer when we'll have some more apple mint. But I will put it in a new basket. These aren't very good. they start to collapse and all the water comes out. We got the same sort of issue with our strawberries. So, we'll just cut some of the dead stuff off there. I'll cut some of this dead stuff off, too. Get around the other side later. But we still got some living things on there, but we need to just trim it back for the cold weather. There we go. Not looking healthy, but he should come back. We pulled out our eggplant from this bed here. As I mentioned, there's something about putting things in this eggplant bed. Eggplant is quite a hungry feeder. So, there's not going to be a lot of nutrients in this in this bed. And it's quite sandy. Not a lot of organic matter either. But guess what? That's great for carrots. So, I'm going to nip out and grab some more carrot seeds. We're going to just make a little bit of carrots up here. Probably just some fairly standard ones or the rainbow ones if they've got them. And hopefully couple months time we'll have lots more fresh carrots. Got a few up the back, but need more. This one here I think I need to clean out as well cuz I don't think there's anything growing in it. Used to have cucumbers. Still got the garlic chives, but that's about it. Uh, so what I'm thinking is I'll build that up just a fraction with some piggy past and we'll put some beetroot in that one. And I've got an empty pot over here which I'm going to put one of my new trees in. So hang about and we'll see how we get that lot done. So what I've got from Dy's nursery um cuz I just wanted to try it. Is a black pepper tree. Not quite sure how big this is. There we go. Gets to 2 to 5 meters but by being in a pot we should be able to keep it down to a couple of meters. It's self-pollinating. The reason I wanted to try pepper is I used to spend a lot of time in Sri Lanka working. And the pepper they grow there is absolutely superb. It is very different to what we buy locally if you're just buying the cheap peppercorns. And I want to see if growing my own will be any good. So, he's going to go over in that pot. We're going to clean this fell out except for our garlic chives. Might grab some of the seeds though. So, we're going to put some beetroot in there, not carrots. And I've just got some fairly generic beetroot. There's a Detroit from Elden. Uh more Detroit from Happy Valley Seeds. Globe beetroot. More elder beetroot. So, we'll just put some in there. We'll plant them fairly closely together uh and get them out as we need them. get some baby beets and let some of the others uh grow to full size for pickling. All right, let's get that one cleaned up. So, this is my garlic chive, and I'm just going to grab a few seeds, which I'll probably just give away cuz I don't use that many garlic chives, and this one will be good for what we need. I'm ashamed to waste them. So, we just rub those off. There's a stink bug. Just blow the light seed casings off. And here we have more garlic chive seeds than we will ever need. Let's go and put them away. We'll come back and clear out that bed. Okay. Okay. So, we're going to pop this out. Use that for my cucumbers. Said never throw anything away. We got our piggy past, which is the wonderful stuff. Put a really good whack of it in there. Like so. We're going to dig that through. That is going to give lots of organic matter to our beach fruit. What I'll also do, I'll get some earthworm casting since I've got so many of them. Maybe we'll get some earthworms active in here, too. a bulletproof a bulletproof garlic chise. Yeah, I'll just get a bit of earthworm castings. I actually might put some of this where the carrots are going as well, just to get some earthworms in there. So, that's plenty. Eggshells and all kinds of goodies in there. Lots of volunteer plants. So, probably from tomatoes and capsicum and things that have been composted in there. That won't do any harm. All right, that's nicely mixed in. And what we're going to do, as I said, we're going to over so and we'll thin them out when we need them. Have some baby beads. I like how old that one is. We might not use it. Do some for the Aldi Detroit be I said definitely over [Music] sewing. All right, just about to cover them up. We'll give them a water in there. Some of my baby earthworms. Okay, that done. Let's get over the back and get our pepper tree in. This had my star fruit in it. Seed that I grew from seed. And as you can see, it didn't make it. Oh well, we'll try again. Let's dig in there. See what we've got. We need to mon it as well. That's not looking too bad. All right, dig that through. Lovely stuff. It's piggy post. All right, nice deep hole for him. Come on. That's good boy. Don't want to disturb the roots too much. So, we just pop him in. We'll get some mulch and mulch it as well. There we go. Need a bigger steak. And another one. So, I'm going to get something to tie him up. All right. Need another one for over there. Little bit of this nice soft tie. Should hold him there. That'll keep them going. There we go. And we'll just let them grow up there. Nip them off when they get about six or seven feet tall. 6 ft tall. They won't be able to reach and try and turn it into a bit of a bush. All right. It's clear up here. All right. As we're tidying up a little bit here, I'm not sure my strawberries here have actually made it through. So, I'm going to a little bit of pe off in these just over the top. And that was a spearmint that certainly didn't might come back next year. We'll leave it and see. In the meantime, I'm going to put some of my various basil in here. Now, the basil, even if we don't use it, will give a really nice aroma around here and attract some bees. So, generally just a good thing to put in. Right, I'm going to loosen that up a bit. We'll pop some cinnamon basil in here. Again, using my little bottom press. Isn't that cute? I really like those. Pop a couple in [Music] here. Still hoping my strawberries will come back in summer, but if they don't, they don't. One last thing I'll show you. Bruce is no longer a growhouse at the moment. Bruce is full of mushrooms. So, I've got up the top here, there's blue syggies in buckets. It's my humidifier that I bought. Down here, we've got some king oyster that I'm not sure is going to grow cuz that's from very old grain spawn I got before Christmas, but I'm giving it a bit of time. See if it does. More blue veggies and leftovers just in a small bag. So, this is the environment I'm growing mushrooms in now. It has heat mats there for when we need them, but humidifier is the main thing. And now that it's meant to be cooling down, we might be able to grow mushrooms again. Well, there we go. Just a little bit of a cleanup, little bit of planting, watering those beetroot seeds in about ready for carrots. water my pepper tree in. So, what are you up to this autumn if you're in the southern hemisphere? What are you up to in spring if you're not? Let me know in the comments. We got lots more to do out here. Give you an update later on. Enjoy life. I'll catch you out here. Blue skies. Nothing but blue skies. Oh, I see.",
  "segments": [
    {
      "id": 0,
      "start": 0.24,
      "end": 3.28,
      "text": "Good day everyone. We're just going to"
    },
    {
      "id": 1,
      "start": 1.839,
      "end": 8.92,
      "text": "have a bit of a general clean up around"
    },
    {
      "id": 2,
      "start": 3.28,
      "end": 11.44,
      "text": "here on this chilly, wet autumn"
    },
    {
      "id": 3,
      "start": 8.92,
      "end": 14.719,
      "text": "day. Well, it's not, is it? It's quite"
    },
    {
      "id": 4,
      "start": 11.44,
      "end": 16.24,
      "text": "warm, actually. Blue skies, no rain."
    },
    {
      "id": 5,
      "start": 14.719,
      "end": 18.4,
      "text": "It's still time to get some of the"
    },
    {
      "id": 6,
      "start": 16.24,
      "end": 20.08,
      "text": "plants cleaned up a bit, some of the"
    },
    {
      "id": 7,
      "start": 18.4,
      "end": 23.039,
      "text": "plants out cuz their crops have"
    },
    {
      "id": 8,
      "start": 20.08,
      "end": 24.32,
      "text": "finished, and some new ones in. So, what"
    },
    {
      "id": 9,
      "start": 23.039,
      "end": 26.24,
      "text": "are we going to do today? We're going to"
    },
    {
      "id": 10,
      "start": 24.32,
      "end": 28.08,
      "text": "clean up the mint. We're going to get"
    },
    {
      "id": 11,
      "start": 26.24,
      "end": 30.16,
      "text": "rid of our eggplant which is past it"
    },
    {
      "id": 12,
      "start": 28.08,
      "end": 32.36,
      "text": "used by date and replace it with"
    },
    {
      "id": 13,
      "start": 30.16,
      "end": 35.6,
      "text": "carrots. And the reason for that I shall"
    },
    {
      "id": 14,
      "start": 32.36,
      "end": 38.44,
      "text": "explain. Now mint goes a bit funny. This"
    },
    {
      "id": 15,
      "start": 35.6,
      "end": 41.36,
      "text": "is actually apple mint I think from"
    },
    {
      "id": 16,
      "start": 38.44,
      "end": 44.399,
      "text": "memory that I grew from seed. We're just"
    },
    {
      "id": 17,
      "start": 41.36,
      "end": 44.399,
      "text": "going to cut all the dead stuff"
    },
    {
      "id": 18,
      "start": 45.16,
      "end": 49.68,
      "text": "off. Doesn't need a new basket at some"
    },
    {
      "id": 19,
      "start": 52.039,
      "end": 56.239,
      "text": "point. You can tell if it's apple mint"
    },
    {
      "id": 20,
      "start": 54.16,
      "end": 58.719,
      "text": "by the smell."
    },
    {
      "id": 21,
      "start": 56.239,
      "end": 61.039,
      "text": "Zapple mint. Going to take every dead"
    },
    {
      "id": 22,
      "start": 58.719,
      "end": 61.039,
      "text": "bit"
    },
    {
      "id": 23,
      "start": 67.4,
      "end": 73.28,
      "text": "off. And if you look"
    },
    {
      "id": 24,
      "start": 70.28,
      "end": 75.119,
      "text": "here, we've got some lovely new growth."
    },
    {
      "id": 25,
      "start": 73.28,
      "end": 77.119,
      "text": "So, this should come good, ready for"
    },
    {
      "id": 26,
      "start": 75.119,
      "end": 79.4,
      "text": "next summer when we'll have some more"
    },
    {
      "id": 27,
      "start": 77.119,
      "end": 82.479,
      "text": "apple mint. But I will put it in a new"
    },
    {
      "id": 28,
      "start": 79.4,
      "end": 84.08,
      "text": "basket. These aren't very good."
    },
    {
      "id": 29,
      "start": 82.479,
      "end": 86.56,
      "text": "they start to collapse and all the water"
    },
    {
      "id": 30,
      "start": 84.08,
      "end": 88.0,
      "text": "comes out. We got the same sort of issue"
    },
    {
      "id": 31,
      "start": 86.56,
      "end": 91.799,
      "text": "with our strawberries. So, we'll just"
    },
    {
      "id": 32,
      "start": 88.0,
      "end": 93.84,
      "text": "cut some of the dead stuff off"
    },
    {
      "id": 33,
      "start": 91.799,
      "end": 95.079,
      "text": "there. I'll cut some of this dead stuff"
    },
    {
      "id": 34,
      "start": 93.84,
      "end": 98.0,
      "text": "off,"
    },
    {
      "id": 35,
      "start": 95.079,
      "end": 99.759,
      "text": "too. Get around the other side later."
    },
    {
      "id": 36,
      "start": 98.0,
      "end": 103.68,
      "text": "But we still got some living things on"
    },
    {
      "id": 37,
      "start": 99.759,
      "end": 107.24,
      "text": "there, but we need to just trim it back"
    },
    {
      "id": 38,
      "start": 103.68,
      "end": 107.24,
      "text": "for the cold weather."
    },
    {
      "id": 39,
      "start": 116.479,
      "end": 120.119,
      "text": "There we go. Not looking healthy, but he"
    },
    {
      "id": 40,
      "start": 118.0,
      "end": 123.92,
      "text": "should come back. We pulled out our"
    },
    {
      "id": 41,
      "start": 120.119,
      "end": 125.52,
      "text": "eggplant from this bed here. As I"
    },
    {
      "id": 42,
      "start": 123.92,
      "end": 127.92,
      "text": "mentioned, there's something about"
    },
    {
      "id": 43,
      "start": 125.52,
      "end": 130.72,
      "text": "putting things in this eggplant bed."
    },
    {
      "id": 44,
      "start": 127.92,
      "end": 131.599,
      "text": "Eggplant is quite a hungry feeder. So,"
    },
    {
      "id": 45,
      "start": 130.72,
      "end": 134.319,
      "text": "there's not going to be a lot of"
    },
    {
      "id": 46,
      "start": 131.599,
      "end": 136.4,
      "text": "nutrients in this in this bed. And it's"
    },
    {
      "id": 47,
      "start": 134.319,
      "end": 138.0,
      "text": "quite sandy. Not a lot of organic matter"
    },
    {
      "id": 48,
      "start": 136.4,
      "end": 139.92,
      "text": "either."
    },
    {
      "id": 49,
      "start": 138.0,
      "end": 141.84,
      "text": "But guess what? That's great for"
    },
    {
      "id": 50,
      "start": 139.92,
      "end": 143.04,
      "text": "carrots. So, I'm going to nip out and"
    },
    {
      "id": 51,
      "start": 141.84,
      "end": 145.28,
      "text": "grab some more carrot seeds. We're going"
    },
    {
      "id": 52,
      "start": 143.04,
      "end": 146.8,
      "text": "to just make a little bit of carrots up"
    },
    {
      "id": 53,
      "start": 145.28,
      "end": 149.04,
      "text": "here. Probably just some fairly standard"
    },
    {
      "id": 54,
      "start": 146.8,
      "end": 152.08,
      "text": "ones or the rainbow ones if they've got"
    },
    {
      "id": 55,
      "start": 149.04,
      "end": 154.08,
      "text": "them. And hopefully couple months time"
    },
    {
      "id": 56,
      "start": 152.08,
      "end": 156.959,
      "text": "we'll have lots more fresh carrots. Got"
    },
    {
      "id": 57,
      "start": 154.08,
      "end": 158.959,
      "text": "a few up the back, but need more. This"
    },
    {
      "id": 58,
      "start": 156.959,
      "end": 160.0,
      "text": "one here I think I need to clean out as"
    },
    {
      "id": 59,
      "start": 158.959,
      "end": 162.0,
      "text": "well cuz I don't think there's anything"
    },
    {
      "id": 60,
      "start": 160.0,
      "end": 164.4,
      "text": "growing in it. Used to have cucumbers."
    },
    {
      "id": 61,
      "start": 162.0,
      "end": 166.56,
      "text": "Still got the garlic chives, but that's"
    },
    {
      "id": 62,
      "start": 164.4,
      "end": 167.84,
      "text": "about it. Uh, so what I'm thinking is"
    },
    {
      "id": 63,
      "start": 166.56,
      "end": 169.76,
      "text": "I'll build that up just a fraction with"
    },
    {
      "id": 64,
      "start": 167.84,
      "end": 172.239,
      "text": "some piggy past and we'll put some"
    },
    {
      "id": 65,
      "start": 169.76,
      "end": 174.08,
      "text": "beetroot in that one. And I've got an"
    },
    {
      "id": 66,
      "start": 172.239,
      "end": 176.64,
      "text": "empty pot over here which I'm going to"
    },
    {
      "id": 67,
      "start": 174.08,
      "end": 178.44,
      "text": "put one of my new trees in. So hang"
    },
    {
      "id": 68,
      "start": 176.64,
      "end": 182.72,
      "text": "about and we'll see how we get that lot"
    },
    {
      "id": 69,
      "start": 178.44,
      "end": 185.76,
      "text": "done. So what I've got from Dy's nursery"
    },
    {
      "id": 70,
      "start": 182.72,
      "end": 188.8,
      "text": "um cuz I just wanted to try it. Is a"
    },
    {
      "id": 71,
      "start": 185.76,
      "end": 191.12,
      "text": "black pepper tree. Not quite sure how"
    },
    {
      "id": 72,
      "start": 188.8,
      "end": 192.48,
      "text": "big this is. There we go. Gets to 2 to 5"
    },
    {
      "id": 73,
      "start": 191.12,
      "end": 193.599,
      "text": "meters but by being in a pot we should"
    },
    {
      "id": 74,
      "start": 192.48,
      "end": 195.56,
      "text": "be able to keep it down to a couple of"
    },
    {
      "id": 75,
      "start": 193.599,
      "end": 197.44,
      "text": "meters. It's"
    },
    {
      "id": 76,
      "start": 195.56,
      "end": 199.2,
      "text": "self-pollinating. The reason I wanted to"
    },
    {
      "id": 77,
      "start": 197.44,
      "end": 202.36,
      "text": "try pepper is I used to spend a lot of"
    },
    {
      "id": 78,
      "start": 199.2,
      "end": 205.04,
      "text": "time in Sri Lanka working."
    },
    {
      "id": 79,
      "start": 202.36,
      "end": 207.76,
      "text": "And the pepper they grow there is"
    },
    {
      "id": 80,
      "start": 205.04,
      "end": 209.84,
      "text": "absolutely superb. It is very different"
    },
    {
      "id": 81,
      "start": 207.76,
      "end": 211.92,
      "text": "to what we buy locally if you're just"
    },
    {
      "id": 82,
      "start": 209.84,
      "end": 214.959,
      "text": "buying the cheap peppercorns. And I want"
    },
    {
      "id": 83,
      "start": 211.92,
      "end": 218.36,
      "text": "to see if growing my own will be any"
    },
    {
      "id": 84,
      "start": 214.959,
      "end": 220.72,
      "text": "good. So, he's going to go over in that"
    },
    {
      "id": 85,
      "start": 218.36,
      "end": 222.64,
      "text": "pot. We're going to clean this fell out"
    },
    {
      "id": 86,
      "start": 220.72,
      "end": 224.159,
      "text": "except for our garlic chives. Might grab"
    },
    {
      "id": 87,
      "start": 222.64,
      "end": 226.12,
      "text": "some of the seeds though. So, we're"
    },
    {
      "id": 88,
      "start": 224.159,
      "end": 228.72,
      "text": "going to put some beetroot in there, not"
    },
    {
      "id": 89,
      "start": 226.12,
      "end": 231.08,
      "text": "carrots. And I've just got some fairly"
    },
    {
      "id": 90,
      "start": 228.72,
      "end": 235.48,
      "text": "generic beetroot. There's a Detroit from"
    },
    {
      "id": 91,
      "start": 231.08,
      "end": 238.879,
      "text": "Elden. Uh more Detroit from Happy Valley"
    },
    {
      "id": 92,
      "start": 235.48,
      "end": 240.48,
      "text": "Seeds. Globe beetroot. More elder"
    },
    {
      "id": 93,
      "start": 238.879,
      "end": 243.12,
      "text": "beetroot. So, we'll just put some in"
    },
    {
      "id": 94,
      "start": 240.48,
      "end": 246.159,
      "text": "there. We'll plant them fairly closely"
    },
    {
      "id": 95,
      "start": 243.12,
      "end": 248.159,
      "text": "together uh and get them out as we need"
    },
    {
      "id": 96,
      "start": 246.159,
      "end": 251.56,
      "text": "them. get some baby beets and let some"
    },
    {
      "id": 97,
      "start": 248.159,
      "end": 253.92,
      "text": "of the others uh grow to full size for"
    },
    {
      "id": 98,
      "start": 251.56,
      "end": 256.959,
      "text": "pickling. All right, let's get that one"
    },
    {
      "id": 99,
      "start": 253.92,
      "end": 259.44,
      "text": "cleaned up. So, this is my garlic chive,"
    },
    {
      "id": 100,
      "start": 256.959,
      "end": 260.799,
      "text": "and I'm just going to grab a few seeds,"
    },
    {
      "id": 101,
      "start": 259.44,
      "end": 262.32,
      "text": "which I'll probably just give away cuz I"
    },
    {
      "id": 102,
      "start": 260.799,
      "end": 264.96,
      "text": "don't use that many garlic chives, and"
    },
    {
      "id": 103,
      "start": 262.32,
      "end": 266.84,
      "text": "this one will be good for what we need."
    },
    {
      "id": 104,
      "start": 264.96,
      "end": 269.479,
      "text": "I'm ashamed to waste"
    },
    {
      "id": 105,
      "start": 266.84,
      "end": 274.12,
      "text": "them. So, we just rub those"
    },
    {
      "id": 106,
      "start": 269.479,
      "end": 274.12,
      "text": "off. There's a stink bug."
    },
    {
      "id": 107,
      "start": 281.52,
      "end": 286.16,
      "text": "Just blow the light seed casings"
    },
    {
      "id": 108,
      "start": 286.6,
      "end": 292.0,
      "text": "off. And here we"
    },
    {
      "id": 109,
      "start": 289.479,
      "end": 294.4,
      "text": "have more garlic chive seeds than we"
    },
    {
      "id": 110,
      "start": 292.0,
      "end": 294.4,
      "text": "will ever"
    },
    {
      "id": 111,
      "start": 294.44,
      "end": 301.28,
      "text": "need. Let's go and put them away. We'll"
    },
    {
      "id": 112,
      "start": 297.52,
      "end": 301.28,
      "text": "come back and clear out that"
    },
    {
      "id": 113,
      "start": 301.56,
      "end": 308.199,
      "text": "bed. Okay. Okay. So, we're going to pop"
    },
    {
      "id": 114,
      "start": 304.72,
      "end": 312.24,
      "text": "this out. Use that for my"
    },
    {
      "id": 115,
      "start": 308.199,
      "end": 312.24,
      "text": "cucumbers. Said never throw anything"
    },
    {
      "id": 116,
      "start": 313.16,
      "end": 318.0,
      "text": "away. We got our piggy past, which is"
    },
    {
      "id": 117,
      "start": 315.44,
      "end": 322.68,
      "text": "the wonderful stuff. Put a really good"
    },
    {
      "id": 118,
      "start": 318.0,
      "end": 322.68,
      "text": "whack of it in there. Like so."
    },
    {
      "id": 119,
      "start": 326.32,
      "end": 329.12,
      "text": "We're going to dig that"
    },
    {
      "id": 120,
      "start": 331.4,
      "end": 338.4,
      "text": "through. That is going to give lots of"
    },
    {
      "id": 121,
      "start": 333.88,
      "end": 341.039,
      "text": "organic matter to our beach fruit. What"
    },
    {
      "id": 122,
      "start": 338.4,
      "end": 344.24,
      "text": "I'll also do, I'll get some earthworm"
    },
    {
      "id": 123,
      "start": 341.039,
      "end": 344.24,
      "text": "casting since I've got so many of"
    },
    {
      "id": 124,
      "start": 345.32,
      "end": 351.8,
      "text": "them. Maybe we'll get some earthworms"
    },
    {
      "id": 125,
      "start": 347.919,
      "end": 351.8,
      "text": "active in here, too."
    },
    {
      "id": 126,
      "start": 351.919,
      "end": 356.72,
      "text": "a"
    },
    {
      "id": 127,
      "start": 353.4,
      "end": 358.84,
      "text": "bulletproof a bulletproof garlic chise."
    },
    {
      "id": 128,
      "start": 356.72,
      "end": 360.8,
      "text": "Yeah, I'll just get a bit of earthworm"
    },
    {
      "id": 129,
      "start": 358.84,
      "end": 363.479,
      "text": "castings. I actually might put some of"
    },
    {
      "id": 130,
      "start": 360.8,
      "end": 367.759,
      "text": "this where the carrots are going as"
    },
    {
      "id": 131,
      "start": 363.479,
      "end": 367.759,
      "text": "well, just to get some earthworms in"
    },
    {
      "id": 132,
      "start": 368.28,
      "end": 371.68,
      "text": "there. So, that's"
    },
    {
      "id": 133,
      "start": 372.199,
      "end": 377.199,
      "text": "plenty. Eggshells and all kinds of"
    },
    {
      "id": 134,
      "start": 374.319,
      "end": 380.28,
      "text": "goodies in there. Lots of volunteer"
    },
    {
      "id": 135,
      "start": 377.199,
      "end": 383.6,
      "text": "plants. So, probably from tomatoes"
    },
    {
      "id": 136,
      "start": 380.28,
      "end": 385.639,
      "text": "and capsicum and things that have been"
    },
    {
      "id": 137,
      "start": 383.6,
      "end": 389.52,
      "text": "composted in"
    },
    {
      "id": 138,
      "start": 385.639,
      "end": 389.52,
      "text": "there. That won't do any"
    },
    {
      "id": 139,
      "start": 390.36,
      "end": 396.0,
      "text": "harm. All right, that's nicely mixed in."
    },
    {
      "id": 140,
      "start": 393.84,
      "end": 397.4,
      "text": "And what we're going to do, as I said,"
    },
    {
      "id": 141,
      "start": 396.0,
      "end": 400.4,
      "text": "we're going to"
    },
    {
      "id": 142,
      "start": 397.4,
      "end": 400.4,
      "text": "over"
    },
    {
      "id": 143,
      "start": 403.319,
      "end": 409.36,
      "text": "so and we'll thin them out when we need"
    },
    {
      "id": 144,
      "start": 405.6,
      "end": 411.52,
      "text": "them. Have some baby beads."
    },
    {
      "id": 145,
      "start": 409.36,
      "end": 411.52,
      "text": "I"
    },
    {
      "id": 146,
      "start": 417.0,
      "end": 424.16,
      "text": "like how old that one"
    },
    {
      "id": 147,
      "start": 419.8,
      "end": 427.88,
      "text": "is. We might not use it. Do some for the"
    },
    {
      "id": 148,
      "start": 424.16,
      "end": 427.88,
      "text": "Aldi Detroit be"
    },
    {
      "id": 149,
      "start": 443.12,
      "end": 446.16,
      "text": "I said definitely over"
    },
    {
      "id": 150,
      "start": 453.93,
      "end": 459.44,
      "text": "[Music]"
    },
    {
      "id": 151,
      "start": 456.44,
      "end": 459.44,
      "text": "sewing. All"
    },
    {
      "id": 152,
      "start": 462.639,
      "end": 467.639,
      "text": "right, just about to cover them"
    },
    {
      "id": 153,
      "start": 465.16,
      "end": 471.599,
      "text": "up. We'll give them a water"
    },
    {
      "id": 154,
      "start": 467.639,
      "end": 471.599,
      "text": "in there. Some of my baby"
    },
    {
      "id": 155,
      "start": 473.319,
      "end": 477.28,
      "text": "earthworms."
    },
    {
      "id": 156,
      "start": 475.0,
      "end": 478.759,
      "text": "Okay, that done. Let's get over the back"
    },
    {
      "id": 157,
      "start": 477.28,
      "end": 482.8,
      "text": "and get our pepper tree"
    },
    {
      "id": 158,
      "start": 478.759,
      "end": 484.199,
      "text": "in. This had my star fruit in it. Seed"
    },
    {
      "id": 159,
      "start": 482.8,
      "end": 487.639,
      "text": "that I grew from"
    },
    {
      "id": 160,
      "start": 484.199,
      "end": 492.24,
      "text": "seed. And as you can"
    },
    {
      "id": 161,
      "start": 487.639,
      "end": 494.879,
      "text": "see, it didn't make it. Oh well, we'll"
    },
    {
      "id": 162,
      "start": 492.24,
      "end": 498.599,
      "text": "try again. Let's dig in there. See what"
    },
    {
      "id": 163,
      "start": 494.879,
      "end": 502.4,
      "text": "we've got. We need to mon it as"
    },
    {
      "id": 164,
      "start": 498.599,
      "end": 502.4,
      "text": "well. That's not looking too"
    },
    {
      "id": 165,
      "start": 513.64,
      "end": 517.479,
      "text": "bad. All"
    },
    {
      "id": 166,
      "start": 515.599,
      "end": 520.919,
      "text": "right, dig that"
    },
    {
      "id": 167,
      "start": 517.479,
      "end": 525.2,
      "text": "through. Lovely stuff. It's piggy"
    },
    {
      "id": 168,
      "start": 520.919,
      "end": 525.2,
      "text": "post. All right, nice deep hole for"
    },
    {
      "id": 169,
      "start": 529.72,
      "end": 535.76,
      "text": "him. Come on. That's good"
    },
    {
      "id": 170,
      "start": 533.399,
      "end": 540.519,
      "text": "boy. Don't want to disturb the roots too"
    },
    {
      "id": 171,
      "start": 535.76,
      "end": 540.519,
      "text": "much. So, we just pop him in."
    },
    {
      "id": 172,
      "start": 545.04,
      "end": 549.12,
      "text": "We'll get some mulch and mulch it as"
    },
    {
      "id": 173,
      "start": 551.0,
      "end": 558.8,
      "text": "well. There we go. Need a bigger"
    },
    {
      "id": 174,
      "start": 555.48,
      "end": 561.08,
      "text": "steak. And another one. So, I'm going to"
    },
    {
      "id": 175,
      "start": 558.8,
      "end": 563.519,
      "text": "get something to tie him"
    },
    {
      "id": 176,
      "start": 561.08,
      "end": 567.56,
      "text": "up. All right. Need another one for over"
    },
    {
      "id": 177,
      "start": 563.519,
      "end": 570.519,
      "text": "there. Little bit of this nice soft"
    },
    {
      "id": 178,
      "start": 567.56,
      "end": 574.32,
      "text": "tie. Should hold him"
    },
    {
      "id": 179,
      "start": 570.519,
      "end": 574.32,
      "text": "there. That'll keep them"
    },
    {
      "id": 180,
      "start": 574.92,
      "end": 579.519,
      "text": "going. There we go. And we'll just let"
    },
    {
      "id": 181,
      "start": 577.2,
      "end": 582.12,
      "text": "them grow up there. Nip them off when"
    },
    {
      "id": 182,
      "start": 579.519,
      "end": 585.12,
      "text": "they get about six or seven feet"
    },
    {
      "id": 183,
      "start": 582.12,
      "end": 587.36,
      "text": "tall. 6 ft tall. They won't be able to"
    },
    {
      "id": 184,
      "start": 585.12,
      "end": 591.56,
      "text": "reach and try and turn it into a bit of"
    },
    {
      "id": 185,
      "start": 587.36,
      "end": 593.839,
      "text": "a bush. All right. It's clear up"
    },
    {
      "id": 186,
      "start": 591.56,
      "end": 595.6,
      "text": "here. All right. As we're tidying up a"
    },
    {
      "id": 187,
      "start": 593.839,
      "end": 597.12,
      "text": "little bit here, I'm not sure my"
    },
    {
      "id": 188,
      "start": 595.6,
      "end": 600.0,
      "text": "strawberries here have actually made it"
    },
    {
      "id": 189,
      "start": 597.12,
      "end": 601.48,
      "text": "through. So, I'm going to a little bit"
    },
    {
      "id": 190,
      "start": 600.0,
      "end": 605.04,
      "text": "of pe off in"
    },
    {
      "id": 191,
      "start": 601.48,
      "end": 605.04,
      "text": "these just over the"
    },
    {
      "id": 192,
      "start": 605.48,
      "end": 610.68,
      "text": "top. And that was a spearmint that"
    },
    {
      "id": 193,
      "start": 607.68,
      "end": 613.44,
      "text": "certainly didn't might come back next"
    },
    {
      "id": 194,
      "start": 610.68,
      "end": 614.88,
      "text": "year. We'll leave it and see. In the"
    },
    {
      "id": 195,
      "start": 613.44,
      "end": 618.16,
      "text": "meantime, I'm going to put some of my"
    },
    {
      "id": 196,
      "start": 614.88,
      "end": 619.68,
      "text": "various basil in here. Now, the basil,"
    },
    {
      "id": 197,
      "start": 618.16,
      "end": 621.76,
      "text": "even if we don't use it, will give a"
    },
    {
      "id": 198,
      "start": 619.68,
      "end": 625.68,
      "text": "really nice aroma around here and"
    },
    {
      "id": 199,
      "start": 621.76,
      "end": 626.92,
      "text": "attract some bees. So, generally just a"
    },
    {
      "id": 200,
      "start": 625.68,
      "end": 633.68,
      "text": "good thing to put"
    },
    {
      "id": 201,
      "start": 626.92,
      "end": 633.68,
      "text": "in. Right, I'm going to loosen that up a"
    },
    {
      "id": 202,
      "start": 638.12,
      "end": 643.6,
      "text": "bit. We'll pop"
    },
    {
      "id": 203,
      "start": 640.36,
      "end": 644.44,
      "text": "some cinnamon basil in here. Again,"
    },
    {
      "id": 204,
      "start": 643.6,
      "end": 646.839,
      "text": "using"
    },
    {
      "id": 205,
      "start": 644.44,
      "end": 649.839,
      "text": "my little bottom"
    },
    {
      "id": 206,
      "start": 646.839,
      "end": 652.839,
      "text": "press. Isn't that cute? I really like"
    },
    {
      "id": 207,
      "start": 649.839,
      "end": 652.839,
      "text": "those."
    },
    {
      "id": 208,
      "start": 655.12,
      "end": 660.05,
      "text": "Pop a couple in"
    },
    {
      "id": 209,
      "start": 656.93,
      "end": 660.05,
      "text": "[Music]"
    },
    {
      "id": 210,
      "start": 661.399,
      "end": 666.72,
      "text": "here. Still hoping my strawberries will"
    },
    {
      "id": 211,
      "start": 663.92,
      "end": 668.959,
      "text": "come back in summer, but if they don't,"
    },
    {
      "id": 212,
      "start": 666.72,
      "end": 668.959,
      "text": "they"
    },
    {
      "id": 213,
      "start": 670.76,
      "end": 676.72,
      "text": "don't. One last thing I'll show"
    },
    {
      "id": 214,
      "start": 673.399,
      "end": 679.8,
      "text": "you. Bruce is no longer a growhouse at"
    },
    {
      "id": 215,
      "start": 676.72,
      "end": 679.8,
      "text": "the moment."
    },
    {
      "id": 216,
      "start": 683.64,
      "end": 690.079,
      "text": "Bruce is full of mushrooms. So, I've got"
    },
    {
      "id": 217,
      "start": 687.6,
      "end": 692.0,
      "text": "up the top here, there's blue syggies in"
    },
    {
      "id": 218,
      "start": 690.079,
      "end": 694.959,
      "text": "buckets. It's my humidifier that I"
    },
    {
      "id": 219,
      "start": 692.0,
      "end": 696.399,
      "text": "bought. Down here, we've got some king"
    },
    {
      "id": 220,
      "start": 694.959,
      "end": 697.839,
      "text": "oyster that I'm not sure is going to"
    },
    {
      "id": 221,
      "start": 696.399,
      "end": 699.839,
      "text": "grow cuz that's from very old grain"
    },
    {
      "id": 222,
      "start": 697.839,
      "end": 702.079,
      "text": "spawn I got before Christmas, but I'm"
    },
    {
      "id": 223,
      "start": 699.839,
      "end": 704.079,
      "text": "giving it a bit of time. See if it does."
    },
    {
      "id": 224,
      "start": 702.079,
      "end": 706.079,
      "text": "More blue veggies and leftovers just in"
    },
    {
      "id": 225,
      "start": 704.079,
      "end": 709.6,
      "text": "a small bag. So, this is the environment"
    },
    {
      "id": 226,
      "start": 706.079,
      "end": 712.079,
      "text": "I'm growing mushrooms in now. It has"
    },
    {
      "id": 227,
      "start": 709.6,
      "end": 715.519,
      "text": "heat mats there for when we need them,"
    },
    {
      "id": 228,
      "start": 712.079,
      "end": 717.36,
      "text": "but humidifier is the main thing. And"
    },
    {
      "id": 229,
      "start": 715.519,
      "end": 719.8,
      "text": "now that it's meant to be cooling down,"
    },
    {
      "id": 230,
      "start": 717.36,
      "end": 722.64,
      "text": "we might be able to grow mushrooms"
    },
    {
      "id": 231,
      "start": 719.8,
      "end": 726.64,
      "text": "again. Well, there we go. Just a little"
    },
    {
      "id": 232,
      "start": 722.64,
      "end": 726.64,
      "text": "bit of a cleanup, little bit of"
    },
    {
      "id": 233,
      "start": 726.839,
      "end": 731.44,
      "text": "planting, watering those beetroot seeds"
    },
    {
      "id": 234,
      "start": 732.2,
      "end": 738.6,
      "text": "in about ready for"
    },
    {
      "id": 235,
      "start": 735.48,
      "end": 741.04,
      "text": "carrots. water my pepper tree"
    },
    {
      "id": 236,
      "start": 738.6,
      "end": 742.639,
      "text": "in. So, what are you up to this autumn"
    },
    {
      "id": 237,
      "start": 741.04,
      "end": 745.079,
      "text": "if you're in the southern hemisphere?"
    },
    {
      "id": 238,
      "start": 742.639,
      "end": 748.56,
      "text": "What are you up to in spring if you're"
    },
    {
      "id": 239,
      "start": 745.079,
      "end": 750.639,
      "text": "not? Let me know in the comments. We got"
    },
    {
      "id": 240,
      "start": 748.56,
      "end": 753.44,
      "text": "lots more to do out here. Give you an"
    },
    {
      "id": 241,
      "start": 750.639,
      "end": 756.36,
      "text": "update later on. Enjoy life. I'll catch"
    },
    {
      "id": 242,
      "start": 753.44,
      "end": 760.04,
      "text": "you out here. Blue"
    },
    {
      "id": 243,
      "start": 756.36,
      "end": 764.16,
      "text": "skies. Nothing but blue"
    },
    {
      "id": 244,
      "start": 760.04,
      "end": 764.16,
      "text": "skies. Oh, I see."
    }
  ],
  "language": "en"
}