{
    "index": "0LdS3n3Fx1k",
    "title": "African Village Life | Morning Routine In The Farm",
    "url": "https://www.youtube.com/watch?v=0LdS3n3Fx1k",
    "category": "People & Blogs",
    "tasks": [
        {
            "task": "Interacting with family and household members during a scene that references Christmas and childlike behavior.",
            "subtasks": [
                "Responding to children's comments about a rock piece and expressing ownership.",
                "Explaining the concept of Santa Claus and his distribution of gifts.",
                "Expressing regret and apologizing to family members.",
                "Goodbye wishes and instructions to family members, indicating leaving or concluding an interaction."
            ]
        },
        {
            "task": "Engaging in a kindergarten-style tea party or playtime activity.",
            "subtasks": [
                "Taking part in a breakfast or snack time activity with children.",
                "Playing with shaving cream and a pencil case during the activity.",
                "Attempting to give or share items (pencil case) with other participants.",
                "Experiencing reluctance or refusal from another participant (Bluey) to accept an item."
            ]
        },
        {
            "task": "Participating in a give-and-take or exchange game with tokens or prizes.",
            "subtasks": [
                "Expressing dissatisfaction when a participant (Bluey) does not accept a given item.",
                "Attempting to change Bluey's mind about accepting the item.",
                "Net outcome of not being able to obtain a desired reward (pencil case) from Bluey."
            ]
        },
        {
            "task": "Dealing with pretend store or gift exchange scenario (Merry Christmas tag game).",
            "subtasks": [
                "Presenting items or tokens to other participants (E.g., Sheikah's request for acceptance).",
                "Experiencing a scenario where another participant (Sheikah) accepts a token due to perceived deservingness.",
                "Metaphorically pushing for exclusion or bonus (The Sheikah statement about being \"worthy\" for presents).",
                "Attempting to manipulate another's decision (Sheikah) by using flattery or appeal to inclusion.",
                "Resolving feeling of exclusion or disappointment when another participant (Sheikah) accepts a token."
            ]
        },
        {
            "task": "Engaging in play interactions where characters have differing attitudes or resolves.",
            "subtasks": [
                "Refusing a token (pencil case) despite the offer (Bluey's initial refusal).",
                "Expressing temporary frustration but maintaining a positive demeanor (You’re going to accept her? Only to apologize later).",
                "Displaying indifference or unawareness to the consequences of actions (Sorry, why should I? Because Santa won't bring presents, etc.).",
                "Mocking or dismissive responses to attempts at enforcement (Because Santa won't bring you any presents. Santa likes children who sell stories.)."
            ]
        },
        {
            "task": "Interacting with family and household members during a scene that references Christmas and childlike behavior.",
            "subtasks": []
        },
        {
            "task": "Engaging in a kindergarten-style tea party or playtime activity.",
            "subtasks": []
        },
        {
            "task": "Participating in a give-and-take or exchange game with tokens or prizes.",
            "subtasks": []
        },
        {
            "task": "Dealing with pretend store or gift exchange scenario (Merry Christmas tag game).",
            "subtasks": []
        },
        {
            "task": "Engaging in play interactions where characters have differing attitudes or resolves.",
            "subtasks": []
        }
    ]
}