{
    "index": "0UMM2almwRM",
    "title": "Unknown Title",
    "url": "https://www.youtube.com/watch?v=0UMM2almwRM",
    "category": "Unknown Category",
    "tasks": [
        {
            "task": "Landowner responsibilities in weed control and pesticide management.",
            "subtasks": [
                "Identify and control noxious weeds and other harmful vegetation on owned land.",
                "Store pesticides behind locked doors to prevent unauthorized access.",
                "Display warning signs on locked pesticide storage areas.",
                "Securely transport pesticides in vehicles (e.g., back of pickup truck, secured trailers) to prevent loss or theft.",
                "Avoid leaving pesticides unattended in spray tanks or vehicles to mitigate theft or malicious tampering risks.",
                "Properly store chemicals in original containers with labels visible for identification."
            ]
        },
        {
            "task": "Chemical spill prevention and containment.",
            "subtasks": [
                "Ensure proper safety equipment is available when handling or transporting chemicals.",
                "Use absorbent materials (e.g., cat litter) to manage chemical spills.",
                "Report significant chemical spills to poison control and assist in cleanup efforts."
            ]
        },
        {
            "task": "General safety awareness and best practices.",
            "subtasks": [
                "Maintain vigilance against chemical theft and malicious acts during pesticide usage.",
                "Seek assistance from local Extension offices for guidance on safe pesticide application."
            ]
        },
        {
            "task": "Storing pesticides and other chemicals safely.",
            "subtasks": [
                "Keep pesticides in securely locked containers.",
                "Post warning signs on locked chemical storage areas.",
                "Transport chemicals through vehicles with proper containment (e.g., trailers, trucks).",
                "Avoid leaving chemicals unattended in fields or spray trucks."
            ]
        },
        {
            "task": "Managing chemical spills.",
            "subtasks": [
                "Equip vehicles and work areas with absorbent materials.",
                "Report significant spills to authorities (e.g., poison control)."
            ]
        },
        {
            "task": "General safety measures.",
            "subtasks": [
                "Observe and follow all safety protocols when handling chemicals.",
                "Regularly check chemical storage for security.",
                "Keep original labeled containers for all chemicals."
            ]
        },
        {
            "task": "Weed control.",
            "subtasks": [
                "Identify and address noxious weeds on property."
            ]
        }
    ]
}