{
    "index": "1bqPPXFS00U",
    "title": "Grow your best Crops yet!  PRODUCT REVIEW: Soil test kit",
    "url": "https://www.youtube.com/watch?v=1bqPPXFS00U",
    "category": "Howto & Style",
    "tasks": [
        {
            "task": "Friends, welcome back to Bloomer Home and Garden and today we are talking once again about the garden.",
            "subtasks": []
        },
        {
            "task": "So you can see our garden is all tilled up. The soil is really soft and fluffy and it's ready to plant. Or is it?",
            "subtasks": []
        },
        {
            "task": "There are a couple important steps before we start thinking about actually putting our plants in the soil. Just by looking at the soil we can't tell what's in here and if it will be beneficial for the plants that we want to plant.",
            "subtasks": []
        },
        {
            "task": "That is why soil testing is so important.",
            "subtasks": []
        },
        {
            "task": "Just like we need nutrients and vitamins and carbohydrates to be strong and healthy, our plants need certain vitamins and minerals as well that are typically found in the soil.",
            "subtasks": []
        },
        {
            "task": "However, this garden has been planted several times and the plants that were here before took out certain nutrients and I need to know what is existing in this soil before I put new plants in. So soil testing measures those important minerals and substances that are nutrients for our plants that our plants need to grow and thrive and eventually produce the produce that we're looking for in our garden.",
            "subtasks": []
        },
        {
            "task": "Some plants do not like soil that is high in acid. Most vegetables do not. So if our pH is not correct, our plants are not going to thrive.",
            "subtasks": []
        },
        {
            "task": "So soil testing is kind of like a little money in the bank, a little assurance to tell us what is going to happen to our plants once they go in the soil. (approx. 0:00-0:10)",
            "subtasks": []
        },
        {
            "task": "Part two of that is amending the soil before the plants go in. Now once we test our soil and we get the results and we know what's in here and what is lacking, then we can add those things that are needed. That is called amending or fixing and making the soil proper for the plants that we want to put in here.",
            "subtasks": []
        },
        {
            "task": "Now there are several tests that you can do to test your soil. They can be as simple as a one test just to test the pH. You can go deeper with nitrogen and potash and several others. (approx.0:30-0:40)",
            "subtasks": []
        },
        {
            "task": "Another thing that you can do is take some soil samples and send them into your Cooperative Extension Office or other agricultural lab. That also has a fee but they give you a complex rundown of exactly what's in your soil. That also takes some time.",
            "subtasks": []
        },
        {
            "task": "So for me the best way to test my soil is by using an at-home test. Now the one that I have selected is easy to get from Amazon and I will link it down below.",
            "subtasks": []
        },
        {
            "task": "Let me show you what that test is like. I am using this Luster Leaf Rapid Soil Test Kit. It measures its pH, potash, phosphorus, and the nitrogen content. It's a very simple test.",
            "subtasks": []
        },
        {
            "task": "We're going to collect soil samples by scraping a few inches deep into the garden, making sure not to mix in any topsoil or weed growth. Proper sample collection is crucial for accurate results.",
            "subtasks": []
        },
        {
            "task": "For each test, we need a clean quart jar, soil (about half a cup), distilled water, and the test kit's capsules.",
            "subtasks": []
        },
        {
            "task": "To test pH (approx. 0:55), place soil up to the designated line in the jar, add water to the mark, and add the pH testing capsule, which reacts to give a color change.",
            "subtasks": []
        },
        {
            "task": "For nutrient content (nitrogen, potash, phosphorus), use a separate jar sample. Add soil, water, and shake, then let sit and compare to color chart cards. (approx.1:20-2:00)",
            "subtasks": []
        },
        {
            "task": "After collecting soil samples, mix the soil thoroughly with water, add a few drops of dish detergent, shake, wait overnight, and check results against color charts.",
            "subtasks": []
        },
        {
            "task": "Our garden had soil tested, showing slightly acidic pH (6.5), abundant phosphorus, sufficient potash, but needing more nitrogen. (approx. 3:00)",
            "subtasks": []
        },
        {
            "task": "The raised bed garden showed low nitrogen levels and moderate potash. Compost sample showed high nitrogen but insufficient phosphorus. (approx.3:30)",
            "subtasks": []
        },
        {
            "task": "The key nutrients for the garden are supplemented with compost and adjusted as needed. However, based on tests, compost might be blended with other amendments to balance nutrition.",
            "subtasks": []
        },
        {
            "task": "Need to add compost and nitrogen-rich amendments to both garden and raised beds to prepare for planting. (approx.3:00)",
            "subtasks": [
                "Use compost to improve soil structure and nutrient content. (approx.5:00)"
            ]
        },
        {
            "task": "Some final thoughts:",
            "subtasks": [
                "Share information on maintaining healthy soil and successful gardening. (approx.6:30)"
            ]
        },
        {
            "task": "Conclusion. (approx.7:00-7:15)",
            "subtasks": []
        }
    ]
}