{
    "index": "2mkVHjN63Hk",
    "title": "How to grow a TROPICAL JUNGLE in a small garden",
    "url": "https://www.youtube.com/watch?v=2mkVHjN63Hk",
    "category": "Howto & Style",
    "tasks": [
        {
            "task": "Preparing a tropical-style garden in a limited space.",
            "subtasks": [
                "Planting ground cover plants like hardy impatiens or Saxifraga stolonifera.",
                "Incorporating sub shrubs such as ferns and colocasias.",
                "Selecting shrubs for the garden, like Fatsea or Sambucus nigra.",
                "Choosing trees that can be pruned to size, such as loquat or mountain papaya.",
                "Using climbers to grow vertically, such as clematis or jasmine.",
                "Utilizing epiphytes, like bromeliads, for vertical interest."
            ]
        },
        {
            "task": "Maximizing growing space in a tropical-style garden.",
            "subtasks": [
                "Breaking down garden space into layers (ground cover, sub shrubs, shrubs, trees).",
                "Choosing appropriate plants for each layer based on conditions.",
                "Using climbers to add height and fragrance.",
                "Incorporating epiphytes for visual impact in limited space."
            ]
        },
        {
            "task": "Creating a tropical rainforest-inspired garden in a small space.",
            "subtasks": [
                "Layering plants to simulate rainforest growth.",
                "Combining different plant types to utilize vertical space efficiently.",
                "Selecting hardy, drought-resistant plants as ground cover and climbers.",
                "Using epiphytes for unexpected texture and color in the garden."
            ]
        },
        {
            "task": "The main task is **MAINTASK: Preparing a tropical-style garden in a limited space**. Here are the subtasks:",
            "subtasks": []
        },
        {
            "task": "Maximizing growing space in a tropical-style garden**:",
            "subtasks": []
        },
        {
            "task": "Creating a tropical rainforest-inspired garden in a small space**:",
            "subtasks": []
        }
    ]
}