{
    "index": "35p74c3f978",
    "title": "Land Access for Beginning Farmers Part II",
    "url": "https://www.youtube.com/watch?v=35p74c3f978",
    "category": "Education",
    "tasks": [
        {
            "task": "Demonstrate due diligence in seeking land access for farming through preparation, evaluation, and assessment.",
            "subtasks": [
                "Assess personal readiness for land acquisition or lease.",
                "Differentiate between land barriers and other common farm start-up challenges.",
                "Consider family values and needs in land tenure decisions.",
                "Understand land ownership costs, including depreciation, interest, repairs, taxes, and insurance.",
                "Calculate potential ownership and lease affordability using business and personal financial metrics.",
                "Evaluate natural and infrastructural characteristics of potential farm properties, considering climate, soils, topography, water, and buildings.",
                "Determine tax implications on farm properties and explore eligibility for tax benefits.",
                "Review regulatory and zoning considerations for agricultural use, including permits and right-to-farm laws.",
                "Network with local stakeholders and resources for information on potential farm properties."
            ]
        },
        {
            "task": "Explore resources for land access, including extension services, nonprofit organizations, and online tools.",
            "subtasks": [
                "Familiarize oneself with UVM Extension's New Farmer Project resources.",
                "Access Land for Good's resources and services for land access and farm succession.",
                "Utilize the Northeast Sustainable Agriculture Working Group for land tenure information.",
                "Engage with the Northeast Beginning Farmers Project at Cornell University for land access support."
            ]
        },
        {
            "task": "Prepare for farm tenure negotiations and agreements.",
            "subtasks": [
                "Develop a negotiation strategy based on financial realities and property requirements.",
                "Review and use leasing templates and tutorials provided by land access organizations.",
                "Consult with legal experts, accountants, and local agricultural professionals for advice on farm tenure agreements."
            ]
        }
    ]
}