{
    "index": "3fZU8MPC3p0",
    "title": "Training video #3 Poultry housing - #SWMProgramme",
    "url": "https://www.youtube.com/watch?v=3fZU8MPC3p0",
    "category": "Nonprofits & Activism",
    "tasks": [
        {
            "task": "Planning and constructing a poultry house for family poultry production.",
            "subtasks": [
                "Calculating the required size of the poultry house based on the number and type of birds.",
                "Ensuring the poultry house is rainproof and provides protection from rough weather, direct sunlight, strong winds, and floods.",
                "Designing appropriate ventilation for the poultry house, considering window orientation and ceiling height.",
                "Implementing wire mesh coverings for openings to prevent predator entry while maintaining airflow.",
                "Securing the house with a lock for safety.",
                "Ensuring easy access for daily management and cleaning.",
                "Considering the future flock size during planning.",
                "Constructing the poultry house using local materials such as bamboo, wood, reeds, thatch grass, or clay bricks.",
                "Elevating the poultry house to protect birds from predators and floods.",
                "Locating the house close to the homestead for easy monitoring and safe distance from other poultry houses.",
                "Providing an appropriate chicken run or open-air enclosure of sufficient size.",
                "Including elements such as perches, nesting boxes, and feeders.",
                "Understanding and complying with local legislation related to poultry farming."
            ]
        },
        {
            "task": "Managing the poultry house and birds for successful production.",
            "subtasks": [
                "Maintaining perches to minimize contact between birds and droppings.",
                "Providing nests for eggs and ensuring they are clean.",
                "Cleaning removable perches and nests regularly.",
                "Ensuring the poultry house is dry and airy to prevent disease.",
                "Checking birds for signs of illness or injury regularly.",
                "Collecting litter and waste efficiently.",
                "Providing a clean source of drinking water for the birds and for cleaning utensils.",
                "Keeping the surrounding area free from snakes and rats, e.g., by maintaining low grass around elevated houses."
            ]
        },
        {
            "task": "Understanding the benefits of a poultry house for family poultry production.",
            "subtasks": [
                "Protecting birds from weather and predators.",
                "Facilitating easier bird management and care.",
                "Simplifying egg collection and disease control."
            ]
        },
        {
            "task": "MAINTASK: Planning and constructing a poultry house for family poultry production.",
            "subtasks": [
                "Calculating the required size of the poultry house based on the number and type of birds.",
                "Ensuring the house is rainproof and provides protection from rough weather, direct sunlight, strong winds, and floods.",
                "Designing proper ventilation, considering window orientation and ceiling height.",
                "Implementing wire mesh coverings for openings to prevent predator entry while maintaining airflow.",
                "Securing the house with a lock for safety.",
                "Ensuring easy access for daily management and cleaning.",
                "Considering the future flock size during planning.",
                "Constructing the house using local, inexpensive materials such as bamboo, wood, reeds, thatch grass, or clay bricks.",
                "Elevating the house to protect birds from predators and floods.",
                "Locating the house close to the homestead and a clean water source."
            ]
        },
        {
            "task": "Managing the poultry house and birds for successful production.",
            "subtasks": [
                "Maintaining perches to minimize contact between birds and droppings.",
                "Providing nests for eggs and ensuring they are clean.",
                "Cleaning removable perches and nests regularly.",
                "Ensuring the house is dry and airy to prevent disease.",
                "Checking birds for signs of illness or injury regularly.",
                "Collecting litter and waste efficiently.",
                "Providing a clean source of drinking water for the birds and for cleaning utensils.",
                "Keeping the surrounding area free from snakes and rats, such as by maintaining low grass around elevated houses."
            ]
        }
    ]
}