{
    "index": "4eEU8saT-n8",
    "title": "Unknown Title",
    "url": "https://www.youtube.com/watch?v=4eEU8saT-n8",
    "category": "Unknown Category",
    "tasks": [
        {
            "task": "Learning how to operate a selkie plow on a two-acre plot with draft horses.",
            "subtasks": [
                "Preparing the team of draft horses for plowing.",
                "Hitching the draft horses to the selkie plow.",
                "Entering the driver's seat of the selkie plow.",
                "Guiding the plow through the 13-14 inch furrow on the two-acre plot.",
                "Ensuring proper alignment and depth of the furrow.",
                "Applying consistent pressure and direction while operating the plow.",
                "Demonstrating correct use of axle grease during operation.",
                "Handling horse leadership, particularly from the horse on the right."
            ]
        },
        {
            "task": "Understanding the historical background of the selkie plow.",
            "subtasks": [
                "Learning about the origins of the selkie plow from the John Deere Company in 1875.",
                "Exploring subsequent manufacturers of the selkie plow (e.g., Pioneer Equipment, White Horse Machine).",
                "Recognizing the plowing efficiency of the selkie plow (10-12 acres per day)."
            ]
        },
        {
            "task": "Discovering resources for learning and practicing historic farming skills.",
            "subtasks": [
                "Contacting Killers International for training sessions in historic farm skills.",
                "Visiting Tillers International in Kalamazoo, Michigan, for camping and accommodations.",
                "Engaging with the blacksmith at Tillers International for repair techniques.",
                "Considering available training programs for various types of farmers (e.g., small farms, subsistence farmers, organic farmers)."
            ]
        },
        {
            "task": "Familiarizing oneself with draft animal team dynamics.",
            "subtasks": [
                "Observing the interaction between the lead horse and the team.",
                "Adjusting to different team sizes (two, three, or four horses).",
                "Understanding the role of leaders and followers in the team."
            ]
        },
        {
            "task": "Grasping the significance of grooming and maintenance in farming.",
            "subtasks": [
                "Applying axle grease to reduce friction.",
                "Regularly inspecting and maintaining furrow depth."
            ]
        },
        {
            "task": "Experiencing the trial and error process in agricultural skills.",
            "subtasks": [
                "Dealing with the initial challenges of operating the selkie plow.",
                "Adapting to the small furrow width (13-14 inches).",
                "Managing the physical demands of tending to the horse-pulled plow."
            ]
        }
    ]
}