{
    "index": "6tKC_cDC2Vk",
    "title": "Unknown Title",
    "url": "https://www.youtube.com/watch?v=6tKC_cDC2Vk",
    "category": "Unknown Category",
    "tasks": [
        {
            "task": "Operate farming equipment.",
            "subtasks": [
                "Sit in a seat of a combine harvester.",
                "Engage the clutch.",
                "Operate the steering wheel.",
                "Manipulate levers to control the combine's harvesting functions.",
                "Watch the LCD screen to monitor combine operation.",
                "Press buttons to adjust settings on the Combine's console."
            ]
        },
        {
            "task": "Monitor the combine operation.",
            "subtasks": [
                "Maintain eye contact with the LCD screen and operational controls.",
                "Listen to the sounds of the combine’s operation.",
                "Feel the vibrations from the combine’s movement.",
                "Observe the field for any malfunctions or hazards.",
                "Check that the combine is moving straight without any zigzags."
            ]
        },
        {
            "task": "Check combine harvester belt tension.",
            "subtasks": [
                "Reach under the combine to inspect the belt.",
                "Adjust the belt tension using hand tools if necessary.",
                "Recheck the belt tension once adjusted."
            ]
        },
        {
            "task": "Position combine harvester.",
            "subtasks": [
                "Align combine with the desired field boundary.",
                "Use steering wheel or GPS guidance to maintain a straight path.",
                "Steer the combine around obstacles or irregularities in the field."
            ]
        },
        {
            "task": "Load grain into truck.",
            "subtasks": [
                "Guide truck into position next to the combine.",
                "Operate a lever or conveyor belt to transfer grain from combine to truck.",
                "Monitor grain flow to prevent overfilling or blockage."
            ]
        },
        {
            "task": "Communicate with helper.",
            "subtasks": [
                "Verbally direct helper on where to position the truck.",
                "Confirm that the grain being loaded is the correct type."
            ]
        },
        {
            "task": "Refuel combine harvester.",
            "subtasks": [
                "Locate the fuel tank access point.",
                "Operate the fuel cap release mechanism.",
                "Insert the fuel nozzle and fill the tank.",
                "Close the fuel cap securely after refueling."
            ]
        },
        {
            "task": "Record combine hours or data.",
            "subtasks": [
                "Use a digital screen or logbook to record the hours worked.",
                "Input specific data such as harvested acres or grain yield."
            ]
        },
        {
            "task": "Return combine to shed.",
            "subtasks": [
                "Navigate the combine back to the farm shed.",
                "Park combine in designated area, ensuring it is secure.",
                "Clean the combine according to end-of-day procedures."
            ]
        },
        {
            "task": "Assist in grain unloading.",
            "subtasks": [
                "Help unload grain from the truck or combine into storage bins.",
                "Use shovels or other tools to assist in loading."
            ]
        },
        {
            "task": "Monitor weather conditions.",
            "subtasks": [
                "Observe the sky for signs of rain or dust storms.",
                "Adjust planning based on current or forecasted weather."
            ]
        },
        {
            "task": "Cleanup the combine.",
            "subtasks": [
                "Remove detachable parts that were used during the day’s harvest.",
                "Clean the combine’s exterior to remove dirt and debris."
            ]
        },
        {
            "task": "Participate in seasonal planting.",
            "subtasks": [
                "Load seeds or planting materials into the combine.",
                "Adjust the combine’s planting mechanisms.",
                "Operate the combine in the reverse direction for planting."
            ]
        },
        {
            "task": "Apply pesticides or fertilizers.",
            "subtasks": [
                "Attach spraying equipment to the combine.",
                "Monitor the application rate and trajectory.",
                "Handle the controls to distribute the chemicals."
            ]
        },
        {
            "task": "Operate a hay baler.",
            "subtasks": [
                "Step onto the haystack while seated in the baler.",
                "Adjust the baling chamber feed mechanism.",
                "Operate the baler’s discharge function.",
                "Cut and bundle hay according to setup preferences."
            ]
        },
        {
            "task": "Load hay.",
            "subtasks": [
                "Step into the hay wagon or trailer.",
                "Manual stacking of hay bales or trimming excess.",
                "Driving the hay transport vehicle to the storage location.",
                "The task is to generate a list of physical tasks a person would need to perform based on the given transcript, which describes activities in a farming context. The answer consists of multiple MAINTASKs and their associated SUBTASKs that are relevant to operating farming equipment and performing agricultural tasks. Each main task is a general action, and the subtasks break down the steps needed to complete each main task."
            ]
        },
        {
            "task": "Tasks related to mechanical maintenance, such as checking belt tension, are included as separate MAINTASKs with corresponding subtasks. This reflects the importance of regular checks to ensure the equipment operates smoothly and safely.",
            "subtasks": [
                "The MAINTASKs and SUBTASKs are clearly separated, and each subtask is concise, describing a single action that contributes to the main task. The list covers the gamut of farming activities from initial setup to cleanup, providing a realistic and detailed overview of the physical labor involved."
            ]
        }
    ]
}