{
    "index": "6Y0Q4W2M7bg",
    "title": "Building a MASSIVE Bass Pond on a Goat Farm!",
    "url": "https://www.youtube.com/watch?v=6Y0Q4W2M7bg",
    "category": "Sports",
    "tasks": [
        {
            "task": "Coyote hunting in a rural area.",
            "subtasks": [
                "Waking up in the middle of the country.",
                "Receiving a request to hunt coyotes.",
                "Retrieving a high-powered rifle.",
                "Scanning the area for coyotes (glassing).",
                "Managing cattle and sheep (ensuring they don't chase each other).",
                "Feeding goats and other farm animals.",
                "Maintaining farm equipment (locking gates, checking for damage).",
                "Designing and planning the construction of a large lake and pond area.",
                "Treating goats to persimmon leaves for digestive health.",
                "Participating in a chicken farm (though not directly interacted with in the transcript).",
                "Preparing for fishing and testing fishing equipment.",
                "Discussing the impact of varmints (coyotes, raccoons) on farm animals.",
                "Inspecting the progress of ongoing construction projects (pond, lake, dam).",
                "Teaching others how to call llamas (e.g., \"woo-sook\").",
                "Handling llamas (e.g., herding them, checking their health).",
                "Maintaining farm infrastructure (like the septic tank and pool area)."
            ]
        },
        {
            "task": "Packing and leaving the farm.",
            "subtasks": [
                "Ending the fishing session for the day.",
                "Cleaning up the area and preparing to depart.",
                "Ensuring all farm animals are tended to before leaving."
            ]
        },
        {
            "task": "Eating breakfast at the farm.",
            "subtasks": [
                "Preparing free-range eggs and coffee.",
                "Enjoying the country scenery while waiting for breakfast."
            ]
        },
        {
            "task": "Visiting the farm's memorial room and office.",
            "subtasks": [
                "Viewing sports memorabilia and equipment.",
                "Exploring the warehouse area and historical items."
            ]
        },
        {
            "task": "Enjoying cookies and socializing.",
            "subtasks": [
                "Taking a break to enjoy Ocean Spoon Girl's cookies."
            ]
        }
    ]
}