{
    "index": "8gKlXtWRbQ8",
    "title": "Grazing Management  NDSU Extension Spring 2021 Horse Management Webinar Series",
    "url": "https://www.youtube.com/watch?v=8gKlXtWRbQ8",
    "category": "Education",
    "tasks": [
        {
            "task": "Identify and discuss common grasses suitable for horse pastures.",
            "subtasks": [
                "Describe smooth bromegrass and its palatability.",
                "Explain the benefits and management of Kentucky bluegrass in horse pastures.",
                "Discuss the characteristics and uses of Crested wheatgrass for horses.",
                "Evaluate quackgrass as a high-quality forage for horses.",
                "Highlight the benefits of native pastures for horses and their management."
            ]
        },
        {
            "task": "Address the importance of fertilizing pastures and management techniques.",
            "subtasks": [
                "Explain nitrogen fertilizer's role in increasing forage tonnage.",
                "Describe proper fertilization timing and methods (e.g., urea application).",
                "Differentiate between fertilizing native and improved pastures."
            ]
        },
        {
            "task": "Identify and manage toxic plants and weeds in horse pastures.",
            "subtasks": [
                "Recognize common toxic trees (maple, choke cherry) and their effects.",
                "Address nitrate accumulation in forages and its impacts on horses.",
                "Manage loco weed, horsetail, and other poisonous plants."
            ]
        },
        {
            "task": "Discuss grazing management strategies and mitigate overgrazing.",
            "subtasks": [
                "Explain optimal grazing timing (three to three and a half leaf stages).",
                "Implement rotational grazing and rest periods.",
                "Adapt horses to spring grasses gradually to prevent digestive issues.",
                "Consider transitioning horses with health conditions (insulin resistance, Cushing's) to pasture slowly."
            ]
        },
        {
            "task": "Provide guidelines for seeding and overseeding horse pastures.",
            "subtasks": [
                "Recommend grass mixes (meadow bromegrass, orchard grass, intermediate wheatgrass) for different regions.",
                "Discuss the importance of suitable soil testing and timing for seeding (spring vs. dormant seeding).",
                "Describe seed preparation and overseeding methods (drilling, broadcasting)."
            ]
        },
        {
            "task": "Emphasize the role of proper pasture management in weed control.",
            "subtasks": [
                "Implement cultural, chemical, and mechanical weed control methods.",
                "Highlight the importance of timely weed control to prevent competition with desirable forages."
            ]
        },
        {
            "task": "Consider the impact of drought and develop grazing strategies for moisture scarcity.",
            "subtasks": [
                "Plan grazing schedules based on leaf growth stages and soil moisture.",
                "Develop contingency plans for reduced forage productivity during drought conditions."
            ]
        },
        {
            "task": "MAINTASK: Identify and discuss common grasses suitable for horse pastures.",
            "subtasks": []
        },
        {
            "task": "Address the importance of fertilizing pastures and management techniques.",
            "subtasks": []
        },
        {
            "task": "Identify and manage toxic plants and weeds in horse pastures.",
            "subtasks": []
        },
        {
            "task": "Discuss grazing management strategies and mitigate overgrazing.",
            "subtasks": []
        },
        {
            "task": "Provide guidelines for seeding and overseeding horse pastures.",
            "subtasks": []
        },
        {
            "task": "Emphasize the role of proper pasture management in weed control.",
            "subtasks": []
        },
        {
            "task": "Consider the impact of drought and develop grazing strategies for moisture scarcity.",
            "subtasks": []
        },
        {
            "task": "** MAINTASK: **Identify and discuss common grasses suitable for horse pastures.**",
            "subtasks": [
                "**"
            ]
        },
        {
            "task": "** **Address the importance of fertilizing pastures and management techniques.**",
            "subtasks": [
                "**"
            ]
        },
        {
            "task": "** **Identify and manage toxic plants and weeds in horse pastures.**",
            "subtasks": [
                "**"
            ]
        },
        {
            "task": "** **Discuss grazing management strategies and mitigate overgrazing.**",
            "subtasks": [
                "**"
            ]
        },
        {
            "task": "** **Provide guidelines for seeding and overseeding horse pastures.**",
            "subtasks": [
                "**"
            ]
        },
        {
            "task": "** **Emphasize the role of proper pasture management in weed control.**",
            "subtasks": [
                "**"
            ]
        },
        {
            "task": "** **MAINTASK: Knife Switch Identification**",
            "subtasks": [
                "View and inspect the smooth bromegrass found commonly in horse pastures.**",
                "Determine the palatability and nutritional value of the Kentucky bluegrass.**",
                "Asses the benefits and management of crested wheatgrass in arid regions.**",
                "Evaluate the high yield and palatability of quackgrass during early growth stages.**"
            ]
        },
        {
            "task": "Chemical Fertilizer Application**",
            "subtasks": [
                "Apply nitrogen (40-80 lbs N/acre) using Urea in late April/early May for optimal grass growth.**",
                "Monitor soil moisture and adjust fertilization schedules as needed.**"
            ]
        },
        {
            "task": "Poisonous Plant Control**",
            "subtasks": [
                "Identify and remove toxic trees like maples and chokecherry.**",
                "Remove locoweed and horsetail through mechanical means (e.g., mowing).**"
            ]
        },
        {
            "task": "Grazing Management Strategy**",
            "subtasks": [
                "Start grazing at the three-four leaf stage (3-4 inches tall).**",
                "Rotate pastures every 14 days to prevent overgrazing.**",
                "Transition horses to new spring pastures gradually, monitoring for digestive issues.**"
            ]
        },
        {
            "task": "Seeding and Overseeding Techniques**",
            "subtasks": [
                "Choose appropriate grasses (e.g., Meadow Bromegrass) based on regional needs.**",
                "Drill or broadcast plant seeds, considering the time of year.**"
            ]
        },
        {
            "task": "Drought Preparedness Planning**",
            "subtasks": [
                "Use rotational grazing to manage moisture levels.**",
                "Prepare dry lots as a supplement during drought periods.**"
            ]
        }
    ]
}