{
    "index": "asscF9W9tqQ",
    "title": "How to Grow Maize for High Yields |Expert Free Guide  on Maize Farming in Kenya",
    "url": "https://www.youtube.com/watch?v=asscF9W9tqQ",
    "category": "Howto & Style",
    "tasks": [
        {
            "task": "Ask maize farmers about the number of bugs produced per acre and discuss the impact of knowledge on farming.",
            "subtasks": [
                "Raise the question of bug production in maize fields.",
                "Highlight the importance of knowledge in growing maize."
            ]
        },
        {
            "task": "Explain the best soil types and preparation for maize farming.",
            "subtasks": [
                "Mention maize preference for loam or sandy loam soils.",
                "Discuss enhancers for soil fertility (e.g., manure addition).",
                "Contrast clay soil issues (poor drainage, weed growth)."
            ]
        },
        {
            "task": "Detail maize variety selection based on region.",
            "subtasks": [
                "Recommend 5-month varieties for North Rift (single season areas).",
                "Specify yield expectations for 5-month varieties (over 50 bags/acre).",
                "List recommended 5-month varieties (e.g., Pioneer 253, G19).",
                "Advise on timing for planting long-season maize.",
                "Suggest 3-month varieties for regions with two maize seasons.",
                "Outline yields and maturity for fast-maturing varieties (25–35 bags/acre in 75–90 days).",
                "Mention specific examples (Haraka 101, DK 833)."
            ]
        },
        {
            "task": "Explain land preparation and planting techniques.",
            "subtasks": [
                "Emphasize clearing land of weeds (manual or herbicide use).",
                "Recommend a suitable planting spacing (60 cm × 30 cm).",
                "Provide seed rate guidelines (11–12 kg/acre).",
                "Calibrate maize planters for accurate spacing.",
                "Discuss early fertilizer application (DAP 1846.0) 10 days after sowing.",
                "Highlight the importance of nitrogen and phosphorus for root growth.",
                "Advise on timing for top-dressing NPK 2323.0.",
                "Suggest CAN application 55 days post-sowing for seed formation and weed control."
            ]
        },
        {
            "task": "Address pest and weed management.",
            "subtasks": [
                "Identify fall armyworm as a major pest (responsible for 50% crop loss).",
                "Recommend chemical treatments (e.g., Fipronil) applied 21–14 days post-sowing.",
                "Mention the use of stickers and boosters to enhance feeding.",
                "Optimize timing for pesticide application in the late evening.",
                "Stress the importance of continuous weed control.",
                "Recommend methods including manual weeding and selective herbicides.",
                "Discuss zero-tillage practices for moisture conservation."
            ]
        }
    ]
}