{
    "index": "B70ixxv_Pb8",
    "title": "Livestock and livelihoods webinar series: Crossroads of animal human and environment health",
    "url": "https://www.youtube.com/watch?v=B70ixxv_Pb8",
    "category": "Science & Technology",
    "tasks": [
        {
            "task": "Attending a webinar on One Health and learning about its applications in livestock and human health.",
            "subtasks": [
                "Welcoming participants and instructing on name sharing and using the chat.",
                "Showing a video to set the context on land use policies and their impacts on ecosystems and diseases.",
                "Presenting a slideshow and discussing the importance of livestock research in combating pandemics and emerging diseases.",
                "Introducing the concept of scaling One Health practices and policies in Sub-Saharan Africa.",
                "Describing specific tools and approaches for vertical and horizontal scaling, such as evaluating platforms, sharing research gaps, and building communities of practice.",
                "Showcase an example of a USDA-funded project (SKILL) in Georgia, focusing on market systems development and raising awareness of safety and quality in the livestock sector.",
                "Presenting the ILRI Hill Program's focus on Rangeland management and integrating environmental health into One Health approaches for pastoralist communities.",
                "Addressing challenges in reconciling differing interests among stakeholders, such as donors, local governments, and livestock owners.",
                "Discussing the role of genetic selection and breeding in disease resistance.",
                "Emphasizing the importance of consumer demand and market standards in promoting healthy food systems."
            ]
        },
        {
            "task": "MAINTASK: Attending a webinar on One Health and learning about its applications in livestock and human health.",
            "subtasks": [
                "Welcoming participants and instructing on name sharing and using the chat.",
                "Showing a video to set the context on land use policies and their impacts on ecosystems and diseases.",
                "Presenting a slideshow and discussing the importance of livestock research in combating pandemics and emerging diseases.",
                "Introducing the concept of scaling One Health practices and policies in Sub-Saharan Africa.",
                "Describing specific tools and approaches for vertical and horizontal scaling, such as evaluating platforms, sharing research gaps, and building communities of practice.",
                "Showcase an example of a USDA-funded project (SKILL) in Georgia, focusing on market systems development and raising awareness of safety and quality in the livestock sector.",
                "Presenting the ILRI Hill Program's focus on Rangeland management and integrating environmental health into One Health approaches for pastoralist communities.",
                "Addressing challenges in reconciling differing interests among stakeholders, such as donors, local governments, and livestock owners.",
                "Discussing the role of genetic selection and breeding in disease resistance.",
                "Emphasizing the importance of consumer demand and market standards in promoting healthier food systems."
            ]
        },
        {
            "task": "MAINTASK: Attending a webinar on the intersection of One Health, livestock, and human/pet health.",
            "subtasks": [
                "Watching an introductory video on land use policies and their impacts.",
                "Following instructions from the moderator to introduce oneself in the chat.",
                "Listening to and retaining information about livestock's role in addressing pandemics.",
                "Understanding the concept of scaling One Health initiatives through vertical (institutional improvement) and horizontal expansion (increased participation).",
                "Analyzing case studies like the SKILL project in Georgia and the ILRI Rangeland management program.",
                "Considering the challenges and strategies for stakeholder engagement across different sectors (e.g., government, farmers, private sector).",
                "Recognizing the importance of consumer demand and market standards in promoting healthier food systems."
            ]
        },
        {
            "task": "Attending a webinar on One Health and learning about interconnected livestock, human, and environmental health.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Participating in a webinar on One Health to learn about integrating animal, human, and environmental health.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Attending a webinar series on One Health with specific tasks related to learning about integrated livestock and human health, participating in discussions, and understanding policy and scaling initiatives.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Attending a webinar on One Health to understand the integration of animal, human, and environmental health.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Attending a webinar on the intersection of One Health, livestock, and agriculture.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Attending a webinar series on One Health and livestock integration.",
            "subtasks": []
        }
    ]
}