{
    "index": "c_iYv3eGLY4",
    "title": "The Essential Guide to Wheat Barley and Oats in Farming Simulator 25",
    "url": "https://www.youtube.com/watch?v=c_iYv3eGLY4",
    "category": "Gaming",
    "tasks": [
        {
            "task": "Operate farming equipment to harvest grain (wheat, barley, oats).",
            "subtasks": [
                "Align combine harvester with grain field.",
                "Engage grain header on combine harvester.",
                "Drive harvester through grain field, collecting grain and straw.",
                "Use forage wagon to collect straw windrows formed by swather.",
                "Transport grain to silo using tractor and grain trailer.",
                "Offload grain into silo using auger.",
                "Store grain in silo for later use."
            ]
        },
        {
            "task": "Process grain into flour using grain mill.",
            "subtasks": [
                "Transport wheat, barley, or oats from silo to grain mill.",
                "Load grain into grain mill hopper.",
                "Operate grain mill to grind grain into flour.",
                "Transfer flour from grain mill to storage bin or truck."
            ]
        },
        {
            "task": "Produce bread or cakes using flour.",
            "subtasks": [
                "Assemble ingredients for bread (flour, water, yeast) and mix them.",
                "Shape dough into loaves and place in oven.",
                "Bake bread until golden brown.",
                "Assemble ingredients for cakes (flour, sugar, eggs, butter) and mix them.",
                "Pour batter into muffin tins or cake pans.",
                "Bake cakes in oven until risen and golden."
            ]
        },
        {
            "task": "Manufacture cereal using oats.",
            "subtasks": [
                "Combine oats with corn, chocolate, and honey in cereal factory.",
                "Operate cereal factory to produce boxes of cereal.",
                "Transport cereal boxes to storage or market for sale."
            ]
        },
        {
            "task": "Store straw from harvested grain fields.",
            "subtasks": [
                "Use baler to form bales of straw.",
                "Transport bales of straw to storage or bedding area.",
                "Use forage wagon to collect loose straw and deposit into storage bin."
            ]
        },
        {
            "task": "Apply straw as bedding for animals.",
            "subtasks": [
                "Spread straw bedding in stalls or pens for livestock.",
                "Clean and remove manure-contaminated straw to maintain hygiene."
            ]
        },
        {
            "task": "Incorporate straw into Total Mixed Ration (TMR) for animals.",
            "subtasks": [
                "Mix chopped straw with other feed components in TMR wagon.",
                "Distribute TMR throughout animal pens for feeding.",
                "Monitor animals' consumption and adjust TMR formulation as needed."
            ]
        },
        {
            "task": "Consider straw sale for additional income.",
            "subtasks": [
                "Dry and bale straw for market.",
                "Weigh and price bales for sale to buyers.",
                "Transport straw bales to marketplace for sale and payment."
            ]
        },
        {
            "task": "Improve field yield through machinery upgrades.",
            "subtasks": [
                "Use Macdon swather and pickup header combination to increase grain yield.",
                "Adjust machinery settings for optimal grain collection and straw distribution.",
                "Determine economic viability of upgrades based on increased grain and straw output."
            ]
        }
    ]
}