{
    "index": "CAyRKq_C4eQ",
    "title": "Farm Machine Safety: Fueling and Daily Maintenance Safety",
    "url": "https://www.youtube.com/watch?v=CAyRKq_C4eQ",
    "category": "Education",
    "tasks": [
        {
            "task": "Fueling and daily maintenance on tractors and other farm equipment.",
            "subtasks": [
                "Refer to operator's manual for safety practices.",
                "Familiarize with symbols and colors indicating danger.",
                "Understand that red signifies potential death, orange serious injury, and yellow minor/moderate injury.",
                "Read all safety decals on the machine.",
                "Follow instructions before operating, fueling, or maintaining the machine.",
                "Keep a first aid kit in each tractor or self-propelled machine.",
                "Check daily required fluids as per operator's manual.",
                "Know the location and purpose of all gauges and controls.",
                "React quickly in emergencies by memorizing controls' locations.",
                "Follow safety procedures for refueling as outlined in the manual.",
                "Refuel only when engine is cool and shut off.",
                "Do not smoke during refueling.",
                "Be cautious when climbing ladders to fuel tanks, especially in slippery conditions.",
                "Minimize activities that could ignite fuel during refueling.",
                "Avoid overfilling fuel tanks and clean up any spills immediately."
            ]
        },
        {
            "task": "Check emission reduction fluid levels.",
            "subtasks": [
                "Ensure sufficient diesel exhaust fluid in tractors and equipment with SCR technology."
            ]
        },
        {
            "task": "Daily fluid checks.",
            "subtasks": [
                "Check engine crankcase fluid levels daily.",
                "Verify radiator fluid levels; exercise caution when hot.",
                "Monitor transmission fluid levels."
            ]
        },
        {
            "task": "Tire maintenance.",
            "subtasks": [
                "Inflate tires according to manufacturer's recommendations.",
                "Verify proper pressure, especially for power hop prevention.",
                "Inspect tires for cuts, cracks, or bruises."
            ]
        },
        {
            "task": "Lighting and visibility checks.",
            "subtasks": [
                "Ensure all headlights, flashers, and brake lights are working correctly.",
                "Clean lamps for maximum visibility.",
                "Properly mount the red tail light on the left rear side.",
                "Equip hazard warning lights or flashers for road operations.",
                "Maintain clear windows and clean mirrors for optimal visibility."
            ]
        },
        {
            "task": "Safety equipment checks.",
            "subtasks": [
                "Check engine shields for secure fastening and good condition."
            ]
        }
    ]
}