{
    "index": "CVqp0P8N900",
    "title": "Creating Products from Farm Produce",
    "url": "https://www.youtube.com/watch?v=CVqp0P8N900",
    "category": "Education",
    "tasks": [
        {
            "task": "Participate in a webinar on food safety and regulations for value-added food production in Vermont.",
            "subtasks": [
                "Check if participants are from Vermont.",
                "Explain food regulation differences between Vermont and other states.",
                "Discuss federal and state (Vermont) food safety regulations.",
                "Describe licensing requirements for different types of food products (e.g., jams, jellies, cheese, meat).",
                "Highlight the importance of HACCP plans and preventive controls for food safety.",
                "Mention proper facility and equipment maintenance, including hand washing facilities and cleanable surfaces.",
                "Emphasize the need for proper handling, storage, and tracking of raw materials.",
                "Address allergen control and the importance of accurate labeling.",
                "Discuss traceability and recall procedures for food products.",
                "Answer questions from participants about food safety practices and regulations.",
                "Provide resources for additional information and support."
            ]
        },
        {
            "task": "Attend a webinar on food safety and regulations for value-added food production in Vermont.",
            "subtasks": [
                "Identify participants from Vermont.",
                "Differentiate between Vermont and out-of-state regulations.",
                "Explain federal and state regulatory requirements (e.g., HACCP, acidified foods).",
                "Detail licensing needs for various products (e.g., jams, jellies, baked goods).",
                "Stress the importance of HACCP and preventive controls.",
                "Highlight facility and equipment hygiene (e.g., hand washing facilities, sanitized surfaces).",
                "Discuss proper raw material handling and storage.",
                "Address allergen management and labeling accuracy.",
                "Explain traceability and recall procedures.",
                "Answer questions on food safety practices and regulations.",
                "Provide resource information for further guidance."
            ]
        }
    ]
}