{
    "index": "D2hgFKbG0YE",
    "title": "IRRI Agronomy Challenge January-June 2012: The Documentary",
    "url": "https://www.youtube.com/watch?v=D2hgFKbG0YE",
    "category": "Howto & Style",
    "tasks": [
        {
            "task": "Conducting an agronomy challenge involving rice cultivation from leveling the field to harvest.",
            "subtasks": [
                "Level the field for consistent water and weed control.",
                "Choose and prepare the rice variety (NSIC RC 222 / ERIIRRI 154) for optimal yield.",
                "Monitor and manage water depth for the drum seeder, adjusting as necessary.",
                "Evaluate and adjust seedling distribution for desired plant density.",
                "Deal with uneven seedling establishment by reseeding affected areas.",
                "Assess plant health and growth stages (tillering, elongation) weekly.",
                "Monitor insect and pest activity (leaf folders, Whirl maggots, parasitoids).",
                "Track beneficial insect populations (lady beetles, dragonflies) and their impact on pests.",
                "Implement alternate wetting and drying techniques; monitor soil water tension.",
                "Use field water tubes and leaf color charts for accurate irrigation timing.",
                "Apply nitrogen fertilizer (25 kg urea) based on leaf color chart readings.",
                "Monitor and adjust nutrient levels throughout the crop cycle.",
                "Assess weeds relative to canopy height and adjust control measures accordingly.",
                "Use sweep nets, visual counts, and other tools for pest population monitoring.",
                "Avoid unnecessary pesticide applications when biotic factors compensate for minor damage.",
                "Evaluate crop readiness using moisture meters and visual inspections.",
                "Timing of harvest consideration, balancing moisture content and potential lodging.",
                "Dry harvested paddy rice to 14% moisture for milling.",
                "Mill rice through de-hulling, polishing, and size grading processes.",
                "Analyze profit from the crop, consider factors like irrigation costs."
            ]
        }
    ]
}