{
    "index": "E-juRjYSpZY",
    "title": "Machinery or Farmers: Who Really Controls the Agricultural Industry?",
    "url": "https://www.youtube.com/watch?v=E-juRjYSpZY",
    "category": "People & Blogs",
    "tasks": [
        {
            "task": "Operating and maintaining agricultural machinery and equipment.",
            "subtasks": [
                "Driving and maneuvering the parsley harvester through the crop rows.",
                "Setting the cutting height of the harvester blades for optimal regrowth.",
                "Monitoring the conveyance system to ensure effective collection of parsley onto the collection area.",
                "Adjusting the vacuum system parameters for efficient suction and avoidance of soil debris contamination."
            ]
        },
        {
            "task": "Operating a soil tiller.",
            "subtasks": [
                "Preparing the soil by breaking up compacted clumps using the tiller's deep processing capabilities.",
                "Forming rows and mounds suitable for planting root crops.",
                "Adjusting the working width and depth settings for different soil conditions and crop requirements.",
                "Ensuring the tiller's erosion-resistant features are effective."
            ]
        },
        {
            "task": "Operating a peanut digger.",
            "subtasks": [
                "Manipulating the machine to cut the peanuts from the roots using the rotating blades and digging mechanism.",
                "Shifting the machine to flip the plants onto the rows for peanut collection.",
                "Removing impurities using the vibrating sieve and ensuring clean harvesting."
            ]
        },
        {
            "task": "Operating a grape harvester.",
            "subtasks": [
                "Controlling the shaking mechanism to detach grapes without damaging the vines.",
                "Monitoring the conveyor belt and impurity removal process.",
                "Adjusting the brightness of the cabin's camera system for optimal visibility.",
                "Utilizing the ground tarp rolling system for efficient harvest."
            ]
        },
        {
            "task": "Transplanting crops using an automatic transplanting machine.",
            "subtasks": [
                "Loading seedling trays into the machine and ensuring proper spacing.",
                "Controlling the mechanical or hydraulic system for precise planting depth and distance.",
                "Observing the robotic arms' operation for correct seedling placement."
            ]
        },
        {
            "task": "Handpicking mangoes.",
            "subtasks": [
                "Using poles with nets to reach and pick ripe mangoes from high tree branches.",
                "Ensuring minimal bruising by being gentle and leaving stem stubs.",
                "Sorting and handling the harvested mangoes with care during transport.",
                "Harvesting grapes at night in hot climates to preserve temperature and aroma.",
                "Checking sugar content and ripeness before picking.",
                "Monitoring fermentation processes to prevent bitterness."
            ]
        },
        {
            "task": "Cultivating and harvesting eggplant.",
            "subtasks": [
                "Planting eggplants at proper spacing and soil conditions.",
                "Regularly checking for ripeness and harvesting at the right time.",
                "Gentle handling and careful sorting during transport."
            ]
        },
        {
            "task": "Harvesting watermelons mechanically.",
            "subtasks": [
                "Cutting watermelons from the vines without damage.",
                "Transporting the watermelons to a sorting area with the bottom side down.",
                "Storing watermelons at optimal temperature for extended shelf life."
            ]
        },
        {
            "task": "Harvesting sugarcane manually or mechanically.",
            "subtasks": [
                "Using hand knives or mechanical harvesters to cut sugarcane.",
                "Transporting the sugarcane to processing facilities.",
                "Supervising the crushing and sugar extraction processes."
            ]
        }
    ]
}