{
    "index": "E3LVDfV8sMg",
    "title": "Profiles In Soil Health: \"Increasing Diversity In Crop Rotation\" With Kurt Dagel",
    "url": "https://www.youtube.com/watch?v=E3LVDfV8sMg",
    "category": "Science & Technology",
    "tasks": [
        {
            "task": "Education and Research Background",
            "subtasks": [
                "Attending South Dakota State University",
                "Majoring in Botany",
                "Working for USDA for approximately 20 years",
                "Working with ARS on no-till practices and cover crop research",
                "Transitioning into cover crop research before its popularity"
            ]
        },
        {
            "task": "Current Role at Olson Custom Farms",
            "subtasks": [
                "Agronomist position",
                "Managing crop rotations and diversification",
                "Expanding from corn and soybeans to include small grains (oats, spring wheat, winter rye)",
                "Considering the benefits of diverse rotations including soil community and cover crops",
                "Aims to reduce applied inorganic fertilizer by 40-50% through cover crop use and soil management",
                "Integrating other crops like sunflowers, alfalfa hay, and forages for feedlot operations"
            ]
        },
        {
            "task": "Education and Research Background",
            "subtasks": [
                "Attending South Dakota State University"
            ]
        },
        {
            "task": "Education and Research in Agriculture",
            "subtasks": [
                "Obtaining a degree in Botany from South Dakota State University",
                "Conducting research on no-till practices and cover crops at USDA-ARS, particularly with Shannon Osborne in Brookings, South Dakota."
            ]
        },
        {
            "task": "Current Role as Agronomist at Olson Custom Farms",
            "subtasks": []
        },
        {
            "task": "Crop Rotation and Soil Management",
            "subtasks": []
        },
        {
            "task": "Educated in Botany and Conducted Agriculture Research",
            "subtasks": [
                "Received Botany degree from South Dakota State University",
                "Conducted studies on no-till agriculture",
                "Performed research on cover crops and their impacts",
                "Worked with Shannon Osborne on diverse crop rotations"
            ]
        },
        {
            "task": "Works as Agronomist at Olson Custom Farms",
            "subtasks": [
                "Extends crop rotations to include small grains (oats, wheat, rye)",
                "Focuses on integrated cover crop and soil management",
                "Aims to reduce inorganic fertilizer by 40-50%"
            ]
        },
        {
            "task": "Grow and manage diverse crop rotations",
            "subtasks": []
        },
        {
            "task": "Education and Research Background**",
            "subtasks": [
                "** Attended South Dakota State University and majored in Botany.",
                "** Worked at the USDA for 20 years with ARS, researching no-till practices and cover crops.",
                "** Conducted cover crop research as a technician under Shannon Osborne in Brookings, South Dakota."
            ]
        },
        {
            "task": "Current Role as Agronomist at Olson Custom Farms**",
            "subtasks": [
                "** Expanded crop rotations to include diverse small grains (oats, spring wheat, winter rye) beyond corn and soybeans.",
                "** Implemented cover crops and rotations to improve soil health.",
                "** Aims to reduce inorganic fertilizer usage by 40-50% through sustainable practices."
            ]
        }
    ]
}