{
    "index": "Fr85baH1ZII",
    "title": "Making the case for organic farming and for a low external input sustainable agriculture",
    "url": "https://www.youtube.com/watch?v=Fr85baH1ZII",
    "category": "Nonprofits & Activism",
    "tasks": [
        {
            "task": "Presenting informations on a case study of bio slurry and its benefits.",
            "subtasks": [
                "Presenting the design of the biodigester and basic functions.",
                "Describing the products (bio cas and bio slurry) from the biodigester.",
                "Discussing the benefits of bio slurry including farmer employment, cooking fuel, and lighting."
            ]
        },
        {
            "task": "Presenting a case study on the African Biocast Partnership Programme.",
            "subtasks": [
                "Explaning the program's locations and registered carbon projects.",
                "Discussing the methodology and results of slurry's carbon impact."
            ]
        },
        {
            "task": "Discussing the Soylent More methodology for measuring carbon impact of bioslurry.",
            "subtasks": [
                "Presenting bioslurry user surveys in Kenya and Indonesia.",
                "Discussing the feasibility study and results for Indonesia."
            ]
        },
        {
            "task": "Presenting a case study on the Sustainable Agriculture in Coffee Plantation in Nicaragua.",
            "subtasks": [
                "Introducing the PASCAFEN project and its objectives.",
                "Presenting the expected carbon sequestration and emissions from organic and conventional farming.",
                "Discussing the expected benefits of integrating composting in coffee plantations."
            ]
        },
        {
            "task": "Presenting a household survey on agroecology in the Peruvian Andes.",
            "subtasks": [
                "Introducing the sample of agroecological and conventional farmers.",
                "Comparing the demographic and economic profiles of agroecological and conventional farmers.",
                "Discussing the agroecological practices and their impact on natural and social capitals.",
                "Discussing the results on food security and financial capitals of agroecological farmers."
            ]
        }
    ]
}