{
    "index": "hAi3gTgy3qM",
    "title": "More Water for Farms More Food for Everyone",
    "url": "https://www.youtube.com/watch?v=hAi3gTgy3qM",
    "category": "Nonprofits & Activism",
    "tasks": [
        {
            "task": "Farmers receiving adequate water for crops.",
            "subtasks": [
                "Checking irrigation systems for functionality.",
                "Managing water resources with water user associations.",
                "Rehabilitating irrigation infrastructure.",
                "Increasing crop yields due to sufficient water."
            ]
        },
        {
            "task": "Government launches irrigation improvement program.",
            "subtasks": [
                "Ensuring farmer access to better water services.",
                "Providing agribusiness finance.",
                "Improving post-harvest handling and delivery."
            ]
        },
        {
            "task": "Infrastructure financing and co-financing.",
            "subtasks": [
                "ADB commits $500 million from 2017-2024.",
                "ASEAN Fund contributes $100 million.",
                "World Bank contributes $28 million."
            ]
        },
        {
            "task": "Project milestones.",
            "subtasks": [
                "4,500 water user associations established.",
                "88 irrigation commissions formed.",
                "Irrigation asset management system implemented.",
                "Rehabilitated 523,000 hectares as of 2023."
            ]
        },
        {
            "task": "Improvement in food security.",
            "subtasks": [
                "Farmers' income improved.",
                "Reduced food insecurity for country.",
                "Enhanced capacity for sustainable irrigated agriculture."
            ]
        },
        {
            "task": "Farmers receiving adequate water for crops. Then subtasks of checking irrigation systems, managing with water user associations, rehabilitating infrastructure, increasing yields. For the government's role, another MAINTASK: Launching irrigation improvement program. Subtasks there would be ensuring better water services, finance access, and post-harvest support.",
            "subtasks": []
        },
        {
            "task": "Project milestones achieved. Subtasks would be forming associations, commissions, asset management system, and hectares rehabilitated. Then the result of that is improvement in food security, so perhaps a separate MAINTASK: Enhancing food security. Subtasks would be improved yields, better income for farmers, and reduced food insecurity for the country.",
            "subtasks": []
        },
        {
            "task": "Improving post-harvest handling. Subtask: Moving harvested crops to storage facilities.",
            "subtasks": []
        },
        {
            "task": "Farmers check irrigation systems for functionality.",
            "subtasks": []
        },
        {
            "task": "Switching from manual watering to irrigation systems. With subtasks of installing irrigation equipment and learning to operate it.",
            "subtasks": []
        },
        {
            "task": "Expanding irrigation coverage.",
            "subtasks": []
        },
        {
            "task": "Managing water distribution through associations.",
            "subtasks": []
        },
        {
            "task": "Checking and maintaining irrigation systems to ensure adequate water supply. This would involve regular inspection, perhaps even making minor repairs, and perhaps operating the system.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Coordinating water allocation with water user associations. Subtasks: scheduling irrigation times, monitoring water usage, reporting issues to the association.",
            "subtasks": []
        },
        {
            "task": "Increasing crop yield through better water control), but that's a result. However, if management of the water system is required for yield increase, then the task would be optimizing water use for crops.",
            "subtasks": []
        },
        {
            "task": "Using irrigation asset management system for optimized irrigation). Subtasks: Reviewing water flow data, adjusting schedules as needed, ensuring even distribution across fields.",
            "subtasks": []
        },
        {
            "task": "Regularly inspecting irrigation systems for proper water delivery.",
            "subtasks": []
        },
        {
            "task": "Checking irrigation systems for proper water supply.",
            "subtasks": []
        },
        {
            "task": "Managing irrigation systems to ensure adequate water for crops.",
            "subtasks": []
        },
        {
            "task": "Joining and participating in water user associations.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Checking irrigation systems for proper water delivery.",
            "subtasks": []
        },
        {
            "task": "Improving post-harvest handling.",
            "subtasks": []
        },
        {
            "task": "Checking irrigation systems for proper water delivery.",
            "subtasks": []
        }
    ]
}