{
    "index": "IDmqBTKNNZw",
    "title": "FAO Animal Health Vaccination Campaign Against PPR in Syria",
    "url": "https://www.youtube.com/watch?v=IDmqBTKNNZw",
    "category": "Nonprofits & Activism",
    "tasks": [
        {
            "task": "Participate in a vaccination campaign for PPR, a viral disease affecting sheep and goats.",
            "subtasks": [
                "Travel to the outskirts of INAC in rural Damascus.",
                "Coordinate with international donors (FAO, Russian project, DFID project, ORCHER) involved in the campaign.",
                "Ensure the distribution of 8 million doses of temperature-sensitive vaccine within two to three weeks.",
                "Prevent the spread of the disease by vaccinating 180,000 herders and small-scale livestock keepers.",
                "Contribute to achieving zero hunger through protection of livestock assets."
            ]
        },
        {
            "task": "Maintain the cold chain for the vaccine during transportation and distribution.",
            "subtasks": [
                "Verify that the vaccine is stored at the required temperature range of 2 to 8 degrees Celsius.",
                "Assess the cold store facilities used for vaccine storage."
            ]
        },
        {
            "task": "Support the eradication of PPR as part of a global campaign.",
            "subtasks": [
                "Collaborate with international efforts to eliminate the disease.",
                "Recognize the disease's seriousness and the necessity of the vaccination campaign."
            ]
        },
        {
            "task": "Engage with local village-level efforts in the campaign.",
            "subtasks": [
                "Work closely with herders and small-scale livestock keepers in vaccination activities.",
                "Educate community members about the importance of disease prevention and vaccination."
            ]
        },
        {
            "task": "Participate in a vaccination campaign for PPR.} \\\\",
            "subtasks": [
                "Travel to the outskirts of INAC in rural Damascus.} \\\\",
                "Coordinate with international donors.} \\\\",
                "Ensure vaccine distribution within 2-3 weeks.} \\\\",
                "Vaccinate 180,000 herders and protect livestock.} \\\\",
                "Support zero hunger and disease eradication goals.} \\\\"
            ]
        },
        {
            "task": "Maintain the cold chain.} \\\\",
            "subtasks": [
                "Verify vaccine storage temperature.} \\\\",
                "Assess cold store facilities.} \\\\"
            ]
        },
        {
            "task": "Engage with community efforts.} \\\\",
            "subtasks": [
                "Work with local herders and livestock keepers.} \\\\",
                "Educate about disease prevention.}"
            ]
        },
        {
            "task": "Let me start by identifying the main activities. The campaign involves vaccinating large numbers of sheep and goats against a viral disease. So the primary task would be participating in the vaccination campaign. That’s the overarching MAINTASK.",
            "subtasks": []
        },
        {
            "task": "Alternatively, maybe the task is participating in a vaccination drive, which could include traveling, coordinating, and distributing the vaccine. Let's focus on the MAINTASK of participating in the vaccination campaign.",
            "subtasks": []
        },
        {
            "task": "Additionally, since the vaccine needs to be kept cold, maintaining the cold chain is essential. That would be another MAINTASK, with subtasks ensuring the temperature is maintained and the cold stores are functional. That's another physical task because checking temperatures and verifying storage conditions involve physical actions.",
            "subtasks": []
        },
        {
            "task": "Participate in the PPR vaccination campaign.**",
            "subtasks": [
                "Travel to aspects of the campaign in rural Damascus (the outskirts of INAC).**",
                "Coordinate with multiple donors involved in the project (FAO, Russian, DFID, ORCHER).**",
                "Organize and ensure the distribution of 8 million vaccine doses within the next 2-3 weeks.**",
                "Work with 180,000 herders and small-scale livestock keepers.**",
                "Contribute to the goal of zero hunger through livestock protection.**"
            ]
        },
        {
            "task": "Maintain the cold chain for the vaccine.**",
            "subtasks": [
                "Verify that the vaccine is stored between 2-8 degrees Celsius.**",
                "Evaluate the cold store facilities used for vaccine storage.**",
                "Working with herders and small-scale livestock, considered MAINTASK 1)."
            ]
        },
        {
            "task": "Participate in a vaccination campaign for PPR.} \\\\",
            "subtasks": [
                "Travel to the outskirts of INAC in rural Damascus.} \\\\",
                "Coordinate with international donors (FAO, Russian, DFID, ORCHER).} \\\\",
                "Ensure distribution of 8 million vaccine doses.} \\\\",
                "Engage with 180,000 herders.} \\\\",
                "Contribute to zero hunger through veterinary public health.} \\\\"
            ]
        },
        {
            "task": "Maintain the cold chain for the vaccine.} \\\\",
            "subtasks": [
                "Verify temperature of vaccine storage.} \\\\",
                "Evaluate cold store facilities.}"
            ]
        }
    ]
}