{
    "index": "jK4U5YVq6-k",
    "title": "Discover the BEST of Rural Life in Manikganj Char",
    "url": "https://www.youtube.com/watch?v=jK4U5YVq6-k",
    "category": "People & Blogs",
    "tasks": [
        {
            "task": "Drive a vehicle through water.",
            "subtasks": [
                "Sit in driver's seat.",
                "Operate steering wheel to navigate through water.",
                "Use foot pedals to control speed and acceleration.",
                "Monitor vehicle's progress through water.",
                "Adjust steering as needed to stay on course.",
                "Maintain low speed to prevent engine stalling.",
                "Possibly shift gears if necessary."
            ]
        },
        {
            "task": "Release wire or cable from a tool.",
            "subtasks": [
                "Identify the tool being used (e.g., winch, crane).",
                "Locate and grasp the wire or cable attached to the tool.",
                "Apply force to release the wire or cable, disconnecting it from the tool.",
                "Ensure the release is smooth and without snags.",
                "Safely store the wire or cable to prevent tangling."
            ]
        },
        {
            "task": "Transfer bale using a vehicle.",
            "subtasks": [
                "Approach the bale that needs to be transferred.",
                "Align the vehicle with the bale using steering, if necessary.",
                "Operate the tailgate or similar mechanism to lower the bale into the bed.",
                "Secure the bale in place to prevent movement during transport.",
                "Check mirrors and surroundings for other vehicles or obstacles."
            ]
        },
        {
            "task": "Drive a vehicle through water.",
            "subtasks": [
                "** Sit in the driver's seat.",
                "** Operate the steering wheel to navigate the vehicle through the water.",
                "** Use foot pedals to control speed and acceleration.",
                "** Monitor the vehicle's progress through the water.",
                "** Adjust the steering as needed to stay on course.",
                "** Maintain a low speed to prevent engine stalling.",
                "** Shift gears if necessary."
            ]
        },
        {
            "task": "Release wire or cable from a tool.",
            "subtasks": [
                "** Identify the tool being used (e.g., winch, crane).",
                "** Locate and grasp the wire or cable attached to the tool.",
                "** Apply force to release the wire or cable, disconnecting it from the tool.",
                "** Store the wire or cable safely to prevent tangling."
            ]
        },
        {
            "task": "Transfer bale using a vehicle.",
            "subtasks": [
                "** Approach the bale that needs to be transferred.",
                "** Align the vehicle with the bale using the steering.",
                "** Operate the tailgate or other mechanism to lower the bale into the vehicle bed.",
                "** Secure the bale to prevent movement during transport.",
                "** Check mirrors and surroundings for other vehicles or obstacles."
            ]
        }
    ]
}