{
    "index": "KgOgk6EvikA",
    "title": "Lec 10: Problems arising due to modern agricultural practices #CH24SP #swayamprabha",
    "url": "https://www.youtube.com/watch?v=KgOgk6EvikA",
    "category": "Education",
    "tasks": [
        {
            "task": "Listening to a lecture on modern farming problems and chemical pesticide impacts.",
            "subtasks": [
                "Understanding the importance of love for learning and traditional knowledge systems.",
                "Recognizing the problems associated with modern farming, such as overuse of fertilizers and pesticides.",
                "Analyzing the increase in insecticide use and the resulting increase in crop losses.",
                "Addressing the safety concerns related to pesticide poisoning and its fatal consequences.",
                "Examining the rising costs of farming and the subsequent increase in food prices.",
                "Discussing monoculture practices and their impact on biodiversity.",
                "Highlighting the environmental pollution caused by chemical fertilizers and pesticides.",
                "Explaining the long-term effects of chemical substances on the environment and human health.",
                "Discussing the resistance development in pests due to repeated chemical pesticide use.",
                "Presenting data on the decline in crop production despite increased fertilizer consumption.",
                "Analyzing the impact of groundwater pollution from excessive fertilizer and pesticide use.",
                "Examining the negative effects of chemical pesticides on beneficial organisms and the ecosystem.",
                "Explaining the concept of bioaccumulation and its risks to human health.",
                "Discussing the connection between excessive chemical use and cancer risk."
            ]
        },
        {
            "task": "Comprehending the drawbacks of modern agricultural practices and the need for alternative methods.",
            "subtasks": [
                "Reflecting on the limitations of monocultures and synthetic chemicals in agriculture.",
                "Considering the long-term viability of continuous chemical usage in farming.",
                "Evaluating the potential risks of genetically modified crops and the need for caution.",
                "Recognizing the importance of sustainable farming practices and ancient agricultural wisdom."
            ]
        }
    ]
}