{
    "index": "llAeSlANACw",
    "title": "A machine that removes weeds without damaging crops",
    "url": "https://www.youtube.com/watch?v=llAeSlANACw",
    "category": "People & Blogs",
    "tasks": [
        {
            "task": "Pilot an agricultural aircraft during pesticide application.",
            "subtasks": [
                "Control the agricultural aircraft's flight path.",
                "Monitor pesticide application equipment.",
                "Adjust application settings based on mission requirements.",
                "Ensure even distribution of pesticide over the target area.",
                "Navigate around obstacles and irregular terrain."
            ]
        },
        {
            "task": "Enter the agricultural aircraft cockpit.",
            "subtasks": [
                "Secure seat belt.",
                "Adjust seat for comfort and safety.",
                "Fasten helmet or headgear as necessary."
            ]
        },
        {
            "task": "Conduct pre-flight inspection of the agricultural aircraft.",
            "subtasks": [
                "Check fuel levels and system gauges.",
                "Inspect propeller and engine health.",
                "Verify that pesticide spraying equipment is properly installed.",
                "Check weather conditions before flight."
            ]
        },
        {
            "task": "Operate agricultural aircraft controls during application.",
            "subtasks": [
                "Monitor altitude and adjust to maintain optimal spray height.",
                "Control speed to ensure thorough coverage without drift.",
                "Use roll and pitch controls to maintain straight flight path.",
                "Adjust spray pattern width as needed."
            ]
        },
        {
            "task": "Manage pesticide distribution during spraying.",
            "subtasks": [
                "Monitor pressure and flow rates.",
                "Adjust nozzles or sprayer settings if necessary.",
                "Check for leaks or blockages in the distribution system.",
                "Verify that the correct pesticide mix is being used."
            ]
        },
        {
            "task": "Communicate with ground crew during pesticide spraying operations.",
            "subtasks": [
                "Relay flight path information to ground team.",
                "Inform ground crew of pesticide application status.",
                "Coordinate with crew for pesticide supply and refills."
            ]
        },
        {
            "task": "Oversee pesticide application on a large-scale field.",
            "subtasks": [
                "Plan application routes to cover the entire field efficiently.",
                "Evaluate field conditions for optimal application.",
                "Adjust flight parameters based on wind speed and direction.",
                "Address any application irregularities during flight."
            ]
        },
        {
            "task": "Take off and land the agricultural aircraft.",
            "subtasks": [
                "Perform pre-takeoff checks.",
                "Start the engine and check for proper operation.",
                "Conduct a taxi run to assess flight controls.",
                "Execute takeoff and reach cruising altitude safely.",
                "Initiate landing sequence upon completion of spraying.",
                "Perform post-flight checks and shutdown procedures."
            ]
        }
    ]
}