{
    "index": "mdetGOwNnJo",
    "title": "Awesome machines compilation   International harvester tractor commercial",
    "url": "https://www.youtube.com/watch?v=mdetGOwNnJo",
    "category": "People & Blogs",
    "tasks": [
        {
            "task": "Repetitive motion to walk or move forward.",
            "subtasks": [
                "Lift one foot and move it forward.",
                "Lower lifted foot and raise the other foot.",
                "Repeat movement pattern."
            ]
        },
        {
            "task": "Maintain posture while walking.",
            "subtasks": [
                "Align head, shoulders, torso, and legs in a straight line.",
                "Keep torso upright without leaning excessively.",
                "Adjust stride length and foot placement as needed to maintain balance."
            ]
        },
        {
            "task": "Produce repeated vocal commands.",
            "subtasks": [
                "Open mouth and expel air to make \"Let's go\" sound.",
                "Repeat vocalization multiple times without loss of pitch or volume."
            ]
        },
        {
            "task": "Coordinate verbal commands with physical movement.",
            "subtasks": [
                "Time vocalization with each step taken during walking.",
                "Ensure verbal commands coincide with corresponding movements for emphasis.",
                "Alternate between consecutive commands in consistent timing."
            ]
        },
        {
            "task": "Walk in a straight line.",
            "subtasks": [
                "Direct gaze forward while walking to maintain direction.",
                "Use peripheral vision to adjust course as necessary.",
                "Step confidently and evenly to stay on a straight path."
            ]
        },
        {
            "task": "Move through space facing forward.",
            "subtasks": [
                "Use arms to swing naturally while walking.",
                "Take larger steps when moving forward at a faster pace."
            ]
        },
        {
            "task": "Compete or challenge others to physical exertion.",
            "subtasks": [
                "Gauge others' speed and energy levels during walking.",
                "Encourage continued movement by maintaining vocal commands and physical momentum."
            ]
        }
    ]
}