{
    "index": "nM78EoMiBbM",
    "title": "Backyard Conservation",
    "url": "https://www.youtube.com/watch?v=nM78EoMiBbM",
    "category": "Education",
    "tasks": [
        {
            "task": "Planting trees and shrubs in the backyard to attract wildlife and improve the landscape",
            "subtasks": [
                "Choosing appropriate tree and shrub species for backyard habitat",
                "Involving children or community members in the planting process",
                "Ensuring trees and shrubs provide fruits, berries, nuts, or insects for wildlife",
                "Ensuring trees and shrubs are native to the area to support local wildlife"
            ]
        },
        {
            "task": "Installing water features in the backyard to benefit wildlife and enhance ambiance",
            "subtasks": [
                "Planning and maintaining a pond, water garden, or wetland area",
                "Installing or maintaining a bird bath as an alternative water source"
            ]
        },
        {
            "task": "Creating habitat and food sources for wildlife",
            "subtasks": [
                "Using bird feeders, nest boxes, or other structures to attract birds",
                "Providing supplemental food and cover for small mammals or insects as needed"
            ]
        },
        {
            "task": "Implementing sustainable water management practices in the backyard",
            "subtasks": [
                "Reducing grassy areas and increasing native grass plantings",
                "Installing a drip irrigation system to conserve water and fertilizers"
            ]
        },
        {
            "task": "Adopting soil conservation and management practices",
            "subtasks": [
                "Testing and testing backyard soil, and using fertilizers or nutrients appropriately",
                "Composting lawn debris and organic kitchen waste to enrich soil",
                "Using mulch to protect soil, reduce weed growth, and conserve moisture"
            ]
        },
        {
            "task": "Considering long-term conservation techniques",
            "subtasks": [
                "Planting pest-resistant species and encouraging beneficial insects",
                "Carefully applying pesticides when necessary, following label instructions",
                "Potentially installing terracing to increase gardening areas and prevent erosion"
            ]
        },
        {
            "task": "Planting trees and shrubs in the backyard",
            "subtasks": [
                "Research and select tree and shrub species that provide fruits, berries, nuts, or insects for wildlife",
                "Include native plant species to support local wildlife",
                "Organize planting days with family or neighborhood to involve children or community",
                "Involve kids in activities like building bird houses or swings to make it a fun experience for them"
            ]
        },
        {
            "task": "Installing and managing water features in the backyard",
            "subtasks": [
                "Plan the layout of a pond, water garden, or wetland area",
                "Build and maintain a pond, including cleaning and checking water levels",
                "Install and maintain a bird bath or other small water containers"
            ]
        },
        {
            "task": "Installation of Water Features",
            "subtasks": [
                "Choose between creating a pond or water garden versus installing a bird bath or fountain",
                "For ponds, plan, dig the area, line it, fill with water, and stock with plants and wildlife",
                "For bird baths, place them in a suitable location, keep them clean, and monitor for bird activity"
            ]
        },
        {
            "task": "Installing water features to attract wildlife",
            "subtasks": []
        },
        {
            "task": "",
            "subtasks": []
        },
        {
            "task": "Creating a water feature for wildlife",
            "subtasks": [
                "Research and plan the water feature (pond, garden, or bird bath)",
                "For a pond, construct the physical structure and introduce plants and animals. For a bird bath, use a commercially available setup."
            ]
        },
        {
            "task": "Providing supplemental habitats and food sources",
            "subtasks": [
                "Install bird feeders, nesting boxes, or similar"
            ]
        },
        {
            "task": "Implementing efficient water management practices",
            "subtasks": [
                "Reduce the amount of grass in the yard and replace with native grasses",
                "Convert existing grass areas into meadows or prairies if possible (but that's maybe an option)",
                "Install a drip irrigation system instead of watering the entire lawn"
            ]
        },
        {
            "task": "Composting",
            "subtasks": [
                "Set up a compost pile in the backyard",
                "Collect organic waste from the yard and kitchen, such as leaves, fruit peels, and grass clippings",
                "Turn the compost regularly and use it to enrich garden soil"
            ]
        },
        {
            "task": "Soil management",
            "subtasks": [
                "Test the soil to determine nutrient needs",
                "Apply appropriate fertilizers or natural amendments in the correct amounts"
            ]
        },
        {
            "task": "Mulching",
            "subtasks": [
                "Gather organic material from yard waste, such as leaves and grass clippings",
                "Apply mulch around plants to retain moisture, suppress weeds, and add organic matter when decomposed"
            ]
        },
        {
            "task": "Soil management to reduce erosion and protect soil",
            "subtasks": [
                "Test soil health",
                "Use mulch and cover crops to prevent erosion"
            ]
        },
        {
            "task": "Planting trees and shrubs in the backyard",
            "subtasks": [
                "Choosing tree and shrub species that provide food and habitat for wildlife",
                "Involving children or community members in the planting process",
                "Ensuring a mix of native plants to support local wildlife"
            ]
        },
        {
            "task": "Installing bird feeding stations and nesting structures",
            "subtasks": [
                "Researching and setting up bird feeders, bird houses, and nesting boxes",
                "Maintaining bird feeders with fresh seed and clean water"
            ]
        },
        {
            "task": "Creating water features for wildlife",
            "subtasks": [
                "Designing and maintaining a pond or water garden",
                "Alternately, installing a bird bath"
            ]
        },
        {
            "task": "Adopting water conservation practices",
            "subtasks": [
                "Reducing lawn area and incorporating native plants",
                "Installing a drip irrigation system"
            ]
        },
        {
            "task": "Composting yard and kitchen waste",
            "subtasks": [
                "Setting up a compost bin or pile",
                "Adding organic materials and turning the compost regularly"
            ]
        },
        {
            "task": "Protecting soil health",
            "subtasks": [
                "Testing soil and applying appropriate amendments",
                "Using mulch to retain moisture and reduce weed growth"
            ]
        },
        {
            "task": "**MAINTASK: Planting trees and shrubs in the backyard**",
            "subtasks": [
                "** Choose tree and shrub species that provide food and habitat for local wildlife.",
                "** Involve children or community members in the planting process to create family memories.",
                "** Ensure a mix of native plant species to support local wildlife."
            ]
        },
        {
            "task": "Installing bird feeding stations and nesting structures**",
            "subtasks": [
                "** Set up bird feeders, nesting boxes, or other structures to attract various bird species.",
                "** Maintain bird feeders with fresh seed and clean water to ensure consistent wildlife attraction."
            ]
        },
        {
            "task": "Creating water features for wildlife**",
            "subtasks": [
                "** Plan and maintain a pond, water garden, or wetland area to provide a water source for wildlife.",
                "** As an alternative, install a bird bath for smaller spaces and easier maintenance."
            ]
        },
        {
            "task": "Adopting water conservation practices**",
            "subtasks": [
                "** Reduce grassy areas and replace them with native grasses that require less water.",
                "** Install a drip irrigation system to conserve water and reduce fertilization needs."
            ]
        },
        {
            "task": "Composting yard and kitchen waste**",
            "subtasks": [
                "** Set up a compost bin or pile using organic materials from the yard and kitchen.",
                "** Regularly turn the compost to hasten decomposition and enrich garden soil."
            ]
        },
        {
            "task": "Protecting soil health**",
            "subtasks": [
                "** Test soil to determine nutrient needs and apply appropriate amendments.",
                "** Use mulch to retain moisture, suppress weeds, and improve soil structure over time."
            ]
        }
    ]
}