{
    "index": "nNi-mWj1rpE",
    "title": "Free Guide To Profitable Tomato Farming in Kenya From Seeds to Harvesting 2025",
    "url": "https://www.youtube.com/watch?v=nNi-mWj1rpE",
    "category": "Science & Technology",
    "tasks": [
        {
            "task": "Understanding Kenyan Tomato Industry and Its Challenges",
            "subtasks": [
                "Learn about Kenyan tomato market dynamics, including supply, demand, and brokers' roles.",
                "Recognize the impact of weather on tomato farming and the advantages of warm weather cultivation."
            ]
        },
        {
            "task": "Identifying the Best Tomato Varieties for Profit",
            "subtasks": [
                "Select high-yielding and disease-resistant tomato varieties suitable for outdoor or greenhouse farming.",
                "Compare and choose from popular varieties like Terminator F1, F1 from Seminis, and Susanna F1."
            ]
        },
        {
            "task": "Preparing for Tomato Planting",
            "subtasks": [
                "Determine the ideal planting time for maximum profit and minimal competition.",
                "Choose the best location with fertile, well-drained soil and warm climate.",
                "Prepare planting holes with proper spacing and apply decomposed manure."
            ]
        },
        {
            "task": "Planting and Transplanting Seedlings",
            "subtasks": [
                "Grow seedlings using quality nursery stock or raise them independently for variety assurance.",
                "Transplant seedlings at the appropriate spacing (60cm x60cm or 50cm x50cm) and apply Thunder Insecticide to prevent transplant stress."
            ]
        },
        {
            "task": "Fertilizer Application Schedule",
            "subtasks": [
                "Apply fertilizers top-dressing DAP, NPK, and calcium fertilizers at specific intervals (14th, 45th, and 60th days) post-transplant.",
                "Supplement with foliar feedings of nitrogen, potassium, and calcium to boost growth and fruit development."
            ]
        },
        {
            "task": "Pest and Disease Management",
            "subtasks": [
                "Control Tuta absoluta using Neemix 10SC or Emerald at early stages, focusing on leaves and soil application.",
                "Manage whiteflies with Profound at midday or evening, ensuring thorough coverage.",
                "Treat tomato diseases like early blight and yellow leaf spot using Mystere 72 WP, Redomil Gold, Trinity Gold, or Score XY."
            ]
        },
        {
            "task": "Cost and Profit Analysis",
            "subtasks": [
                "Estimate the production cost and projected income for tomato farming.",
                "Achieve profitability by maintaining high yields and market pricing above 1,000 KES per crate."
            ]
        },
        {
            "task": "Bonus Tips for Enhanced Yield and Growth",
            "subtasks": [
                "Apply high-quality manure and balanced fertilizers for optimal nutrition.",
                "Ensure consistent watering and timely feeding to support rapid growth and flowering.",
                "Use foliar calcium and potassium supplements to prevent fruit and flower abortion."
            ]
        }
    ]
}