{
    "index": "qRu_OgYGMUw",
    "title": "Grow More Give More: Raised Bed Soil Test",
    "url": "https://www.youtube.com/watch?v=qRu_OgYGMUw",
    "category": "Education",
    "tasks": [
        {
            "task": "Taking a soil sample for a raised bed garden using a saturated paste test.",
            "subtasks": [
                "Gathering necessary materials (container, trowel, ziplock bag, soil sample form).",
                "Excavating soil samples from different parts of the bed at a depth of four inches.",
                "Mixing the collected soil samples in a bag to create a representative sample.",
                "Storing the mixed soil in a box with a ziplock bag to prevent damage during mailing.",
                "Properly filling out the soil sample form with sender's information, field name, crop type, and area."
            ]
        },
        {
            "task": "Verifying whether to sample multiple beds separately based on their performance.",
            "subtasks": []
        },
        {
            "task": "Take a soil sample for a raised bed garden using a saturated paste test.",
            "subtasks": []
        },
        {
            "task": "Determine if separate soil samples are needed for multiple raised beds based on their performance.",
            "subtasks": []
        },
        {
            "task": "Taking a soil sample for a raised bed garden.",
            "subtasks": []
        },
        {
            "task": "Deciding whether to sample multiple raised beds separately.",
            "subtasks": []
        },
        {
            "task": "Prepare and collect a soil sample for a raised bed garden.",
            "subtasks": []
        },
        {
            "task": "Determine soil testing requirements for multiple raised beds.",
            "subtasks": []
        },
        {
            "task": "Take a soil sample for a raised bed garden.",
            "subtasks": []
        },
        {
            "task": "Consider whether to take separate samples for different raised beds based on their performance.",
            "subtasks": []
        },
        {
            "task": "Take a soil sample for a raised bed garden.",
            "subtasks": []
        },
        {
            "task": "Determine if separate soil samples are needed for different raised beds based on their performance.",
            "subtasks": []
        },
        {
            "task": "Package a soil sample for a raised bed garden for laboratory analysis.",
            "subtasks": []
        },
        {
            "task": "Take a soil sample for a raised bed garden.",
            "subtasks": []
        },
        {
            "task": "Determine the necessity for separate soil samples for other raised beds.",
            "subtasks": []
        },
        {
            "task": "Take a soil sample for a raised bed garden using a saturated paste test.**",
            "subtasks": []
        },
        {
            "task": "Determine the need for separate samples for multiple raised beds based on performance.**",
            "subtasks": []
        },
        {
            "task": "Take a soil sample for a raised bed garden using a saturated paste test.",
            "subtasks": []
        },
        {
            "task": "Determine whether to take separate soil samples for different raised beds based on their performance.",
            "subtasks": []
        }
    ]
}