{
    "index": "R68dEmNWDiQ",
    "title": "    | Steps taken to alleviate water scarcity in open areas",
    "url": "https://www.youtube.com/watch?v=R68dEmNWDiQ",
    "category": "News & Politics",
    "tasks": [
        {
            "task": "Ride a tractor and drive it between rows of sunflowers.",
            "subtasks": [
                "Sit on the tractor seat.",
                "Steer the tractor using the steering wheel or lever.",
                "Adjust the speed of the tractor to move between sunflower rows.",
                "Use hydraulic controls to lift or lower any attachments, such as cutters or seed planters.",
                "Navigate around obstacles or uneven terrain within the sunflower field."
            ]
        },
        {
            "task": "Assist in harvesting sunflowers.",
            "subtasks": [
                "Climb onto the sunflower stalks using a ladder or step ladder.",
                "Stand on the sunflower head to reach the topmost blossoms.",
                "Using shears or a harvesting tool, cut the sunflower heads from the stalks.",
                "Collect the cut sunflower heads into baskets, burlap sacks, or a pile.",
                "Step carefully to avoid damaging the sunflower stalks below."
            ]
        },
        {
            "task": "Prepare the land for sunflower cultivation.",
            "subtasks": [
                "Walk the field to assess the soil condition and layout.",
                "Mark rows or boundaries using stakes or rope landmarks.",
                "Using a plow or tiller, turn over the soil to prepare seedbeds.",
                "Push the plow or tiller handle to dig and aerate the soil."
            ]
        },
        {
            "task": "Plant sunflower seeds.",
            "subtasks": [
                "Hold a seed planter or drill tool.",
                "Align the device along the prepared rows.",
                "Manually drop or press seeds into the soil at the required depth and spacing.",
                "Walk along the rows, repeating the planting process consistently."
            ]
        },
        {
            "task": "Water the sunflower field.",
            "subtasks": [
                "Move between rows to access watering equipment.",
                "Operate a sprinkler or irrigation system’s control panel.",
                "Walk through the rows, ensuring the water coverage is even.",
                "Check for any equipment malfunctions during operation."
            ]
        },
        {
            "task": "Maintain equipment during the sunflower season.",
            "subtasks": [
                "Service the tractor and harvesting tools regularly.",
                "Check fluid levels, fuel, and lubrication points.",
                "Tighten bolts, check tire pressure, and replace any worn parts.",
                "Clean debris from equipment after use to prevent rust and maintain functionality."
            ]
        },
        {
            "task": "Apply pesticides or herbicides.",
            "subtasks": [
                "Load a sprayer device with the chemical solution.",
                "Ensure even distribution of the chemical throughout the tank.",
                "Safely handle and apply the pesticide while avoiding drift onto adjacent crops.",
                "Walk through the sunflower rows, applying the chemical in a sweeping or back-and-forth pattern."
            ]
        },
        {
            "task": "Conduct disease or pest monitoring.",
            "subtasks": [
                "Walk the field to visually inspect plants for signs of damage or stress.",
                "Note areas with affected plants and plan treatment.",
                "Collect samples if necessary for laboratory analysis."
            ]
        }
    ]
}