{
    "index": "RG28p7CXx7E",
    "title": "Autumn Awakening (and Garden Graveyard!): Preparing for Cool-Season Planting",
    "url": "https://www.youtube.com/watch?v=RG28p7CXx7E",
    "category": "Howto & Style",
    "tasks": [
        {
            "task": "Agricultural maintenance tasks on a chilly autumn day.",
            "subtasks": [
                "Cutting dead parts off mint plants.",
                "Verifying the type of mint (apple mint) by smell.",
                "Trimming back strawberry plants for cold weather.",
                "Removing eggplant as it's past its harvest date.",
                "Collecting carrot seeds to plant in the vacated eggplant bed.",
                "Preparing a pot for a black pepper tree, accounting for soil and space considerations.",
                "Cleaning out a bed dedicated to garlic chives, collecting seeds.",
                "Planting beetroot seeds in the prepared pot with soil amendments.",
                "Adding mulch and support stakes for the new black pepper tree.",
                "Introducing basil plants into a nearby area for aesthetic and bee-attracting purposes.",
                "Setting up a mushroom growing environment with a humidifier and heat mats."
            ]
        },
        {
            "task": "Agricultural maintenance tasks on a chilly autumn day.",
            "subtasks": []
        },
        {
            "task": "Agricultural maintenance tasks on a chilly autumn day.",
            "subtasks": []
        },
        {
            "task": "Agricultural maintenance tasks on a chilly autumn day.",
            "subtasks": [
                "Cutting dead parts off the mint plants.",
                "Verifying the type of mint (apple mint) by smell.",
                "Trimming back strawberry plants for cold weather.",
                "Removing past-due eggplant.",
                "Collecting and preparing to plant carrot seeds.",
                "Planting carrot seeds in the vacated eggplant bed.",
                "Preparing a pot with piggy post and mulch for pepper tree.",
                "Planting the pepper tree seedling in the prepared pot.",
                "Adding mulch around the new pepper tree.",
                "Mixing soil and organic matter for beetroot bed.",
                "Planting beetroot seeds.",
                "Adding garlic chive seeds.",
                "Planting basil.",
                "Setting up a mushroom growing area with a humidifier and heat mats."
            ]
        }
    ]
}