{
    "index": "RLUSj3eBAoM",
    "title": "Furrow Irrigation System - I",
    "url": "https://www.youtube.com/watch?v=RLUSj3eBAoM",
    "category": "Education",
    "tasks": [
        {
            "task": "Farmer discusses furrow irrigation system design and advance time infiltration relationship.",
            "subtasks": [
                "Understand the relationship between advance time infiltration and deposition collection.",
                "Explain the Caustico relationship and how it applies to soil infiltration depth.",
                "Define infiltration opportunity time (T) and how it relates to actual irrigation time.",
                "Consider soil uniformity and initial moisture content assumptions in design.",
                "Derive the proportionality between Z (depth from soil surface) and Y (infiltration depth) using the Causticov equation.",
                "Divide total irrigation time (Tn) into intervals (delta T1) based on assumed fractional advance ratio (e.g., Tt = Tn/4).",
                "Calculate depth of water infiltrated in each time interval (delta Yi) using the Causticov equation.",
                "Determine the depth of wetting (delta Z) and its variation along the field.",
                "Analyze the effects of different α values (soil parameters) on deep percolation (delta Z5) and wetted soil depth.",
                "Introduce the fractional advance ratio (FAR) and its influence on deep percolation and irrigation design."
            ]
        },
        {
            "task": "Overview of surface irrigation method design considerations.",
            "subtasks": [
                "Recognize the importance of limiting design parameters for stream size, erosion, and efficiency.",
                "Discuss the balance between controlling irrigation rates and managing slope-induced erosion.",
                "Explain the inclusion of farmer experience and scientific principles in irrigation design guidelines.",
                "Draw conclusions about the necessity of testing and empirical data for informed irrigation design."
            ]
        }
    ]
}