{
    "index": "tfKWKfagfFs",
    "title": "Alternate wetting and drying (AWD)--using less water to grow rice",
    "url": "https://www.youtube.com/watch?v=tfKWKfagfFs",
    "category": "Education",
    "tasks": [
        {
            "task": "Applying Alternate Wetting and Drying (AWD) technique for water-saving rice farming.",
            "subtasks": [
                "Observing water level in the field using a field water tube.",
                "Refilling the rice field with 5 cm of water when the water level drops 15 cm below the soil surface.",
                "Starting Safe AWD irrigation a few days after transplanting or when direct-seeded rice is 10 cm tall.",
                "Postponing Safe AWD when weeds are present until they are suppressed.",
                "Applying nitrogen fertilizer on dry soil before irrigation.",
                "Keeping water depth at 5 cm during grain filling to avoid yield loss.",
                "Experimenting with deeper water thresholds (20-30 cm) after gaining confidence."
            ]
        },
        {
            "task": "Constructing a field water tube for AWD monitoring.",
            "subtasks": [
                "Cutting materials (e.g., plastic pipe or bamboo) to 40 cm length with a 15 cm diameter.",
                "Drilling holes (0.5 cm diameter, spaced 2 cm apart) into the lower 20 cm of the tube.",
                "Placing the tube vertically in the soil, 20 cm protruding above the surface, away from the bund.",
                "Verifying water level alignment inside and outside the tube."
            ]
        },
        {
            "task": "Applying Alternate Wetting and Drying (AWD) technique for water-saving rice farming. Then the subtasks include observing water levels, refilling at specific times, when to start, dealing with weeds, fertilizing practices, keeping water during grain filling, and experimenting with deeper intervals.",
            "subtasks": []
        },
        {
            "task": "Constructing a field water tube for AWD monitoring. Subtasks there would be cutting material, drilling holes, inserting it correctly, verifying alignment.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Applying Alternate Wetting and Drying (AWD) technique for water-saving rice farming.",
            "subtasks": [
                "Observing water level in the field using a field water tube.",
                "Refilling the rice field with 5 cm of water when the water level drops 15 cm below the soil surface.",
                "Starting Safe AWD irrigation a few days after transplanting or when the direct-seeded rice is 10 cm tall.",
                "Postponing Safe AWD when weeds are present until they are suppressed.",
                "Applying nitrogen fertilizer on dry soil before irrigation.",
                "Keeping water depth at 5 cm during grain filling to avoid yield loss.",
                "Experimenting with deeper water thresholds (20-30 cm) after gaining confidence."
            ]
        },
        {
            "task": "Constructing a field water tube for AWD monitoring.",
            "subtasks": [
                "Cutting materials (e.g., plastic pipe or bamboo) to 40 cm length with a 15 cm diameter.",
                "Drilling holes (0.5 cm diameter, spaced 2 cm apart) into the lower 20 cm of the tube.",
                "Placing the tube vertically in the soil, 20 cm protruding above the surface, away from the bund.",
                "Verifying water level alignment inside and outside the tube."
            ]
        }
    ]
}