{
    "index": "tktmAxnLbyA",
    "title": "How I Grew the Sweetest Peas: My Top Cultivation Tips",
    "url": "https://www.youtube.com/watch?v=tktmAxnLbyA",
    "category": "Howto & Style",
    "tasks": [
        {
            "task": "Planting and Preparing Pea Garden**",
            "subtasks": [
                "Determining appropriate planting times based on local frost dates.",
                "Preparing soil by amending with compost or manure for fertility and drainage.",
                "Choosing the right pea variety suitable for local climate.",
                "Properly planting seeds at the correct depth and spacing.",
                "Installing support structures (trellises, stakes) for climbing varieties.",
                "Applying mulch around plants for moisture retention and weed control."
            ]
        },
        {
            "task": "Irrigation and Watering**",
            "subtasks": [
                "Consistently watering plants with 1 inch of water per week.",
                "Avoiding overhead watering to prevent fungal diseases.",
                "Watering deeply to encourage strong root development."
            ]
        },
        {
            "task": "Soil and Nutrient Management**",
            "subtasks": [
                "Amending soil with organic matter at planting.",
                "Applying a light fertilizer if needed based on soil test results.",
                "Observing for nutrient deficiencies (e.g., yellowing leaves)."
            ]
        },
        {
            "task": "Pest and Disease Control**",
            "subtasks": [
                "Monitoring for pests like aphids and spunning mites.",
                "Using beneficial insects (e.g., ladybugs) for natural pest control.",
                "Applying insecticidal soap if necessary.",
                "Managing diseases like powdery mildew through proper spacing and removal of infected plants."
            ]
        },
        {
            "task": "Companion Planting**",
            "subtasks": [
                "Planting compatible companion plants (e.g., carrots, radishes) to deter pests and improve garden health.",
                "Avoiding proximity of known incompatible plants."
            ]
        },
        {
            "task": "Harvesting and Storage**",
            "subtasks": [
                "Harvesting peas at the optimal stage (tender pods for snap/snow, full pods for garden peas).",
                "Using proper harvesting techniques (pinching stems or cutting pods).",
                "Storing fresh peas in a cool, breathable container or freezing them for longer storage."
            ]
        },
        {
            "task": "Maintenance and Monitoring**",
            "subtasks": [
                "Regularly checking for signs of stress or nutrient deficiencies.",
                "Thinning plants if necessary to reduce competition.",
                "Adjusting supports as plants grow.",
                "Removing yellowing or damaged leaves to improve air circulation."
            ]
        },
        {
            "task": "Future Planning**",
            "subtasks": [
                "Noting observations and adjusting practices for future plantings.",
                "Engaging with gardening communities for feedback and new tips."
            ]
        },
        {
            "task": "Planting and Preparing Pea Garden**",
            "subtasks": []
        }
    ]
}