{
    "index": "tUw9uX6RsIw",
    "title": "The neighbour's bull: learning from animal breeding practices in Nicaragua",
    "url": "https://www.youtube.com/watch?v=tUw9uX6RsIw",
    "category": "Science & Technology",
    "tasks": [
        {
            "task": "Conducting a livestock breeding workshop in Nicaragua with farmers.",
            "subtasks": [
                "Introduction of the International Livestock Research Institute (ILRI) and their goals in livestock genetics.",
                "Understanding the livestock systems in Nicaragua, including dual-purpose cattle for milk and meat production.",
                "Identifying local breeds and crossbreeds observed in the early baseline surveys.",
                "Organizing group discussions with male farmers to discuss preferred traits and current breeding practices.",
                "Observing farmer selection of animals based on physical characteristics rather than breeding records.",
                "Addressing the infrequent use of artificial insemination (AI) by male farmers and the reasons behind it.",
                "Recognizing the curiosity and interest of female livestock keepers in learning about AI and breeding techniques.",
                "Planning a separate workshop for female farmers to train them in reproduction management and AI usage."
            ]
        },
        {
            "task": "1. Introducing ILRI and their goals (MAINTASK)",
            "subtasks": []
        },
        {
            "task": "Conducting a livestock breeding workshop in Nicaragua with farmers.",
            "subtasks": [
                "Introduction of the International Livestock Research Institute (ILRI) and their goals.",
                "Understanding the livestock systems in Nicaragua, including dual-purpose cattle.",
                "Observing the variety of breed crosses in local farms.",
                "Organizing group discussions with male farmers to learn about their breeding practices.",
                "Noticing the selection of animals based on physical appearance rather than breeding records.",
                "Addressing the low adoption of artificial insemination (AI) by male farmers.",
                "Recognizing the interest of female farmers (like the extension worker) in breeding and AI.",
                "Planning a separate workshop for women on AI and cattle reproduction."
            ]
        },
        {
            "task": "Wait, the transcript starts with Julia's introduction, so maybe the first MAINTASK could be \"Introduction of ILRI and project in Nicaragua,\" followed by MAINTASKs for the subsequent activities. But maybe it's better to structure it as a single main task for the entire workshop process, breaking down its components as subtasks. Alternatively, split it into different tasks.",
            "subtasks": []
        },
        {
            "task": "Assessing the local livestock situation in Nicaragua for a breeding program.",
            "subtasks": [
                "Baseline survey of local breeds and crosses.",
                "Engagement with male farmers through group discussions.",
                "Observing animal selection practices."
            ]
        },
        {
            "task": "Organizing a training workshop for male farmers.",
            "subtasks": [
                "Conducting group discussions on traits and breeding practices.",
                "Demonstrating the use of artificial insemination (AI).",
                "Overcoming barriers to AI adoption (e.g., timing, availability)."
            ]
        },
        {
            "task": "Addressing the involvement of women in livestock management.",
            "subtasks": [
                "Identifying their interest and knowledge gaps.",
                "Planning a separate workshop for women on reproduction and AI."
            ]
        },
        {
            "task": "Planning and conducting a livestock breeding workshop in Nicaragua.",
            "subtasks": [
                "Understanding the local livestock system and breed diversity.",
                "Organizing group discussions with male farmers on their practices.",
                "Observing animal selection methods.",
                "Recognizing the need for AI technology adoption.",
                "Addressing women's interest in breeding and planning a separate workshop for them."
            ]
        },
        {
            "task": "Conduct a baseline survey on livestock practices in Nicaragua.",
            "subtasks": [
                "Identify local breeds and crosses observed in farms.",
                "Engage with farmers to understand their breeding practices.",
                "Note the disparity between discussed and actual AI usage."
            ]
        },
        {
            "task": "Organize a training workshop for Nicaraguan farmers on livestock breeding.",
            "subtasks": [
                "Conduct group discussions with farmers on preferred traits and practices.",
                "Plan and execute a separate workshop for women on reproduction and AI.",
                "Address the challenges and reasons for low AI adoption."
            ]
        },
        {
            "task": "Conducting a livestock breeding workshop in Nicaragua with farmers.",
            "subtasks": [
                "Introduction of the International Livestock Research Institute (ILRI) and their goals.",
                "Understanding the livestock systems in Nicaragua, including dual-purpose cattle.",
                "Observing the variety of breed crosses in local farms.",
                "Organizing group discussions with male farmers to learn about their breeding practices.",
                "Noticing the selection of animals based on physical appearance rather than breeding records.",
                "Addressing the low adoption of artificial insemination (AI) by male farmers.",
                "Recognizing the interest of female farmers (like the extension worker) in breeding and AI.",
                "Planning a separate workshop for women on AI and cattle reproduction."
            ]
        },
        {
            "task": "Conducting a livestock breeding workshop in Nicaragua with farmers.",
            "subtasks": [
                "Introduction of the International Livestock Research Institute (ILRI) and their goals.",
                "Understanding the livestock systems in Nicaragua, including dual-purpose cattle.",
                "Observing the variety of breed crosses in local farms.",
                "Organizing group discussions with male farmers to learn about their breeding practices.",
                "Noticing the selection of animals based on physical appearance rather than breeding records.",
                "Addressing the low adoption of artificial insemination (AI) by male farmers.",
                "Recognizing the interest of female farmers (like the extension worker) in breeding and AI.",
                "Planning a separate workshop for women on AI and cattle reproduction."
            ]
        }
    ]
}