{
    "index": "uDKpRSWoICw",
    "title": "Ears treatment wheat with application maps / agrirouter Data Exchange",
    "url": "https://www.youtube.com/watch?v=uDKpRSWoICw",
    "category": "Science & Technology",
    "tasks": [
        {
            "task": "Operating and managing an arable farm with agricultural technology.",
            "subtasks": [
                "Introducing the family business, the Sintsttterhof, located in the Rheinland region of Germany.",
                "Describing the farm's focus on industrial potato cultivation for French fries and chips, along with other crops like wheat, sugar beet, etc.",
                "Using Zavio software for plant protection and fertilization tasks, including creating application maps.",
                "Applying targeted plant protection products based on crop density data from satellite images.",
                "Transferring application maps from Zavio to the Agrarouter via MyAmaRouter app and wireless LAN.",
                "Ensuring data transfers are smooth (mentioning possible duplicates from company in the field for backup)."
            ]
        },
        {
            "task": "Agricultural farming operations and precision agriculture.",
            "subtasks": [
                "Applying fertilizers and plant protection products using modern agricultural technology (e.g., Amatron 4 terminal).",
                "Monitoring and adjusting field operations based on application maps while in the field.",
                "Sending as-applied map data back to the Agrarouter after completion of tasks.",
                "Integrating field data into farm management software for record-keeping and analysis."
            ]
        },
        {
            "task": "Managing a farming workforce, including students and assistance.",
            "subtasks": [
                "Involving students in office work related to farm management software.",
                "Collaborating with a company in the field for support in data transfers and troubleshooting."
            ]
        }
    ]
}