{
    "index": "uiObMNm_ruA",
    "title": "I Tested 10 Agricultural Technologies and Found the BEST for Taiwan Guavas!",
    "url": "https://www.youtube.com/watch?v=uiObMNm_ruA",
    "category": "People & Blogs",
    "tasks": [
        {
            "task": "Participating in the cultivation of guava trees in Taiwan's nurseries and farms.",
            "subtasks": [
                "Selecting healthy guava sprouts.",
                "Planting sprouts by hand in fields with proper spacing (5-6.5 feet apart).",
                "Equipping the fields with a drip irrigation system using clean water from nearby pumps.",
                "Maintaining and pruning trees at 4 months old to encourage better growth and fruit production.",
                "Wrapping guavas to protect them from external factors, enhance fruit quality, and facilitate selective fruiting.",
                "Harvesting guavas by carefully cutting and handling them to avoid damage."
            ]
        },
        {
            "task": "Engaging in the harvesting of seedless raisins in the San Joaquin Valley, California.",
            "subtasks": [
                "Planting grape vines using mechanical hole diggers and ensuring correct planting techniques.",
                "Applying drip irrigation and organic/chemical fertilizers to support grapevine growth.",
                "Using stakes and wire systems to support grapevine growth and improve harvesting access.",
                "Handpicking grapes under hot temperatures for quality control.",
                "Harvesting and sun-drying grapes, or using mechanical harvesters for large-scale production."
            ]
        },
        {
            "task": "Observing advances in Brussels sprout harvesting using automated machines for efficient, minimal damage, and high-quality yield.",
            "subtasks": []
        },
        {
            "task": "Witnessing the use of modern machinery in carrot harvesting, including lifting, transporting, and processing with FENT 516 Vario and ESA Lift Carharver.",
            "subtasks": [
                "Lifting two rows of carrots at a time using the FENT 516 Vario Harvester.",
                "Transporting carrots in the FENT 820 and 724 Vario with salmon box trolleys.",
                "Loading boxes of carrots onto trailers with FENT 415 forklifts."
            ]
        },
        {
            "task": "Learning about efficient alfalfa harvesting using the Klaas Jaguar Forage Harvester in the Netherlands.",
            "subtasks": [
                "Observing the Kronbig M420 cutter harvesting alfalfa and oats.",
                "Using a FEND 412 Vario and ROCRT 1000 conveyor to harvest three rows of crops simultaneously.",
                "Shredding and loading the harvested crop with the Klaas Jaguar 960 for transport to the drying plant."
            ]
        }
    ]
}