{
    "index": "uiWBgpVFl-I",
    "title": "Unknown Title",
    "url": "https://www.youtube.com/watch?v=uiWBgpVFl-I",
    "category": "Unknown Category",
    "tasks": [
        {
            "task": "Placing spikes in the soil along row.",
            "subtasks": [
                "Identify the row where spikes need to be planted.",
                "Gather spikes or dormant plants from storage or field.",
                "Walk through the row, carefully spacing out the spikes.",
                "Bend down or squat to insert each spike into the soil at the correct depth.",
                "Compact the soil around the spikes to secure them."
            ]
        },
        {
            "task": "Attaching markers or flags to the spikes.",
            "subtasks": [
                "Collect markers or flags of appropriate color or height.",
                "Approach each spike, align the marker with the spike.",
                "Tie or clip the marker to the spike at an easily visible spot.",
                "Ensure markers are securely fastened and not likely to fall off."
            ]
        },
        {
            "task": "Driving the spikes into the ground.",
            "subtasks": [
                "Position each spike at the appropriate interval along the row.",
                "Use a mallet, hammer, or spike driver to strike the base of the spike, pushing it firmly into the soil.",
                "Check if the spike is vertical or standing straight.",
                "Apply any necessary pressure to ensure the spike is stable and not wobbling."
            ]
        },
        {
            "task": "Watering the planted area.",
            "subtasks": [
                "Select appropriate watering equipment, such as a sprinkler, hose, or watering can.",
                "Determine the amount and duration of water needed based on soil conditions and weather.",
                "Move the watering equipment across the row, ensuring even coverage.",
                "Check for any dry spots or uneven watering and adjust accordingly."
            ]
        },
        {
            "task": "Planting new dormant canna lily plants in rows.",
            "subtasks": [
                "Loosen soil along the row with a hoe or tiller.",
                "Remove dormant canna lily plants from the nursery or storage.",
                "Dig holes at the correct spacing along the row.",
                "Place each plant in the hole, ensuring the bud is facing upwards.",
                "Cover the plant with soil and press down slightly to remove air pockets.",
                "Water the newly planted area to settle the soil and hydrate the plants."
            ]
        },
        {
            "task": "Driving irrigation pipes into the ground.",
            "subtasks": [
                "Identify the planting rows where irrigation is needed.",
                "Unroll irrigation pipe sections along the rows.",
                "Use a spading fork or shovel to dig shallow trenches along the desired route.",
                "Place the irrigation pipes in the trenches, securing them with soil to prevent movement.",
                "Connect any necessary drip emitter systems or sprinklers.",
                "Cover the exposed parts of the pipe to protect from UV damage and ensure it stays below the soil surface."
            ]
        },
        {
            "task": "Planting spikes in rows; attaching markers; watering; planting dormant canna lilies; installing irrigation pipes.",
            "subtasks": [
                "Identify rows needing spikes; gather spikes; space and insert spikes; compact soil around spikes.",
                "Collect markers; tie markers to spikes; ensure secure attachment.",
                "Position spikes, use tools to drive into ground; check stability.",
                "Select watering equipment; ensure even coverage; check for dry spots.",
                "Loosen soil for planting; handle dormant canna lilies; plant with proper depth and direction; water new plants.",
                "Unroll irrigation pipes; dig shallow trenches; place pipes; secure and connect components."
            ]
        },
        {
            "task": "Planting Spikes with Flags in Rows",
            "subtasks": []
        },
        {
            "task": "Driving Spikes into the Ground",
            "subtasks": []
        },
        {
            "task": "Watering the Planted Area",
            "subtasks": []
        },
        {
            "task": "Planting Dormant Canna Lily Plants",
            "subtasks": []
        },
        {
            "task": "Installing Irrigation Systems",
            "subtasks": []
        },
        {
            "task": "",
            "subtasks": []
        }
    ]
}