{
    "index": "v_u-8kJDkWQ",
    "title": "Eradicating Peste des Petits Ruminants Globally",
    "url": "https://www.youtube.com/watch?v=v_u-8kJDkWQ",
    "category": "Nonprofits & Activism",
    "tasks": [
        {
            "task": "Farmer's efforts in disease surveillance and eradication for small ruminants globally.",
            "subtasks": [
                "Identify the geographical locations of infected countries.",
                "Implement vaccination programs in identified disease-affected areas.",
                "Conduct surveillance in neighboring non-infected countries.",
                "Protect at-risk countries through buffer zones and vaccination.",
                "Assist free countries in obtaining disease-free certification.",
                "Monitor the progress of global eradication efforts using cost-benefit analysis.",
                "Assess the socio-economic impact of the disease on small ruminant owners, particularly women in developing countries.",
                "Mobilize resources and partnerships for disease eradication.",
                "Oversee the implementation of a $3 billion eradication campaign targeting 76 countries."
            ]
        },
        {
            "task": "Economic evaluation of the eradication program.",
            "subtasks": [
                "Calculate the cost of vaccinating one animal and compare it to the economic gain.",
                "Perform cost-benefit analysis of the disease eradication program.",
                "Evaluate the annual losses attributable to the disease.",
                "Estimate the return on investment for the proposed eradication campaign."
            ]
        },
        {
            "task": "Understanding the impact of diseases on farming communities.",
            "subtasks": [
                "Recognize the adverse effects of disease outbreaks on small ruminant populations.",
                "Identify the nutritional and livelihood impacts on affected households.",
                "Analyze the specific vulnerability of women and their dependence on small ruminants."
            ]
        },
        {
            "task": "Perspective on disease eradication challenges and timelines.",
            "subtasks": [
                "Acknowledge the challenges and uncertainties in achieving the global eradication goal by 2030.",
                "Reflect on the potential timeline and resource requirements for the eradication campaign.",
                "Consider the lessons learned from past disease control efforts."
            ]
        }
    ]
}