{
    "index": "WH8MLYBsKx8",
    "title": "How did the green revolution impact south asian agriculture? #shorts",
    "url": "https://www.youtube.com/watch?v=WH8MLYBsKx8",
    "category": "People & Blogs",
    "tasks": [
        {
            "task": "Drive a tractor to roll and smooth a field.",
            "subtasks": [
                "Sit on the tractor seat.",
                "Engage the steering wheel to guide the tractor.",
                "Operate the power take-off (PTO) to engage the rolling attachment.",
                "Adjust the tractor's speed to match the rolling equipment.",
                "Monitor the field's condition while moving."
            ]
        },
        {
            "task": "Attach a disc harrow to a tractor to prepare the soil.",
            "subtasks": [
                "Approach the disc harrow equipment.",
                "Use a hitch pin to secure the harrow to the tractor.",
                "Connect the hydraulic lines for operation.",
                "Lower the disc harrow onto the ground.",
                "Start the tractor and engage the hydraulic lift to lift the harrow.",
                "Operate the hydraulic controls to lower and raise the harrow as needed."
            ]
        },
        {
            "task": "Ride a three-wheeled tractor and operate a baler.",
            "subtasks": [
                "Sit on the three-wheeled tractor and align it with hay wagons.",
                "Engage the baler attachments to gather hay.",
                "Manipulate steering to direct the baler around the field.",
                "Use the豁然开朗_buttons to wind hay into the bale.",
                "Discharge bales when the baler is full.",
                "Move the baler to the next section using the tractor."
            ]
        },
        {
            "task": "Operate a combine harvester to harvest crops.",
            "subtasks": [
                "Climb into the combine and secure the seatbelt.",
                "Check the combine's fuel and oil levels.",
                "Attach the combine to the trailer for transport.",
                "Drive the combine into the crop field.",
                "Start the combine engine and adjust the cutterbar height.",
                "Operate the combine's controls to gather and thresh the crop.",
                "Monitor grain flow and make adjustments as necessary.",
                "Attach augers to transport grain to the grain wagon."
            ]
        },
        {
            "task": "Train a dog to herd cattle.",
            "subtasks": [
                "Assess the dog's initial behaviors and instincts.",
                "Use commands and techniques to direct the dog to gather cattle.",
                "Reward the dog with treats when successful.",
                "Introduce the dog to different terrains and environments.",
                "Gradually increase difficulty by adding more cattle."
            ]
        },
        {
            "task": "Operate a fly swatter on a horse to control flies.",
            "subtasks": [
                "Secure a fly swatter (likely a stick with a brush or other tool) to a horse's head.",
                "Patrol the horse as it works in the fields.",
                "Use the swatter to shoo away flies as needed.",
                "Ensure the swatter does not injure the horse."
            ]
        },
        {
            "task": "Check cattle for proper ear tags and leg irons.",
            "subtasks": [
                "Approach the cattle in a controlled manner.",
                "Capture a calf or steer (e.g., using wranglers or chutes).",
                "Inspect ear tags for identification.",
                "Apply or check leg irons if necessary.",
                "Release the animal after inspection."
            ]
        },
        {
            "task": "Ride a horse while mowing using a push mower.",
            "subtasks": [
                "Sit on the horse with a push mower attached.",
                "Guide the horse in a straight path across the field.",
                "Operate the push mower, maintaining a steady speed.",
                "Direct the horse to turn and proceed to the next row."
            ]
        },
        {
            "task": "Walk through a field with a lead to assess plant health.",
            "subtasks": [
                "Hold a lead rope attached to a plant.",
                "Tug on the lead to check for root strength.",
                "Examine plant stems, leaves, and overall condition.",
                "Note any signs of disease or pest infestation."
            ]
        },
        {
            "task": "Load hay into a truck using a forklift.",
            "subtasks": [
                "Ride the forklift and approach the hay stack.",
                "Choose the correct forks for the hay's size.",
                "Insert forks under the hay and lift it.",
                "Transport the hay to the truck and stack it.",
                "Repeat until the truck is loaded."
            ]
        },
        {
            "task": "Operate a straw baling machine to collect chaff.",
            "subtasks": [
                "Position the machine under the hay instead of the baler.",
                "Direct the airflow to blow chaff into the collection bag.",
                "Continuously collect the chaff and discard it as needed."
            ]
        },
        {
            "task": "Plant cotton plants in rows.",
            "subtasks": [
                "Carry cotton plants from the nursery to the field.",
                "Dig planting holes along the rows.",
                "Insert cotton plants into the holes and cover them with soil.",
                "Press down the soil around the plants to secure them."
            ]
        },
        {
            "task": "Operate a gasoline-powered post hole digger.",
            "subtasks": [
                "Fill the post hole digger with gasoline and oil.",
                "Position the digger over the desired post hole location.",
                "Start the engine and dig the hole to the required depth.",
                "Use the digger to create multiple holes as needed."
            ]
        },
        {
            "task": "Attach a water sprinkler system to a tractor.",
            "subtasks": [
                "Position the sprinkler system equipment beside the tractor.",
                "Connect the water lines to the sprinkler system.",
                "Adjust the water flow and pressure.",
                "Attach the hoses and nozzles as needed.",
                "Test the sprinklers to ensure proper coverage."
            ]
        },
        {
            "task": "Adjust the oil level in a tractor engine.",
            "subtasks": [
                "Refer to the tractor's manual to find the oil dipstick.",
                "Stop the tractor and place it on a flat surface.",
                "Remove the oil dipstick, retracts into the body, plug and add oil if necessary, plug back into the body after checking.",
                "Check the oil level against the stick's marks to ensure it's within the acceptable range."
            ]
        }
    ]
}