{
    "index": "WKQENMqDdT0",
    "title": "Farming Simulator 2015:  Westbridge Planting Season",
    "url": "https://www.youtube.com/watch?v=WKQENMqDdT0",
    "category": "Gaming",
    "tasks": [
        {
            "task": "Performing agricultural operations using farming equipment.",
            "subtasks": [
                "Operating a seabed prep rig.",
                "Applying fertilizer using a seabed finisher.",
                "Guiding the John Deere 8370R vehicle along the field.",
                "Attaching Demco saddle tanks to the John Deere 8370R.",
                "Pulling a DB planter with the John Deere 8370R to plant corn.",
                "Operating an air seeder attached to a 9RT vehicle.",
                "Drilling barley into the soil with the air seeder."
            ]
        },
        {
            "task": "Conducting equipment maintenance and adjustments.",
            "subtasks": [
                "Checking and adjusting the front wheel assist on the DB planter.",
                "Ensuring proper operation of the front wheel assist without slippage.",
                "Verifying the use of four-wheel drive for the front wheel assist."
            ]
        },
        {
            "task": "Addressing equipment setup issues.",
            "subtasks": [
                "Deciding to use a single row marker for a small planting machine.",
                "Confirming the lack of folding wings on a small planter."
            ]
        },
        {
            "task": "Preparing for future equipment installation.",
            "subtasks": [
                "Planning to install a new seeder in the coming days.",
                "Completing row markers for a DB60 24-row planter.",
                "Addressing the current planter's issues (struggle bus) for better efficiency."
            ]
        },
        {
            "task": "Learning and discussing upcoming projects.",
            "subtasks": [
                "Anticipating the arrival of a crew (Adamnovie).",
                "Considering a potential additional video recording opportunity."
            ]
        },
        {
            "task": "Operating farm equipment for various agricultural activities.",
            "subtasks": [
                "Preparing the seabed using a seabed prep rig.",
                "Applying fertilizer across a field with a seabed finisher.",
                "Driving a John Deere 8370R with attached Demco saddle tanks.",
                "Pulling a DB planter to plant corn.",
                "Using an air seeder on a 9RT vehicle to drill barley.",
                "Adjusting the front wheel assist on the planter for better performance.",
                "Securing four-wheel drive on the front wheel assist.",
                "Planning to install a new seeder and finish row markers."
            ]
        },
        {
            "task": "Coordinating crew and equipment for continuity.",
            "subtasks": [
                "Anticipating a crew's arrival for ongoing work.",
                "Considering additional filming opportunities with a crew member."
            ]
        }
    ]
}