{
    "index": "wmbeZjwD77w",
    "title": "A day in the life of a \"YouTube Farmer\" it's not as easy as it looks!",
    "url": "https://www.youtube.com/watch?v=wmbeZjwD77w",
    "category": "Autos & Vehicles",
    "tasks": [
        {
            "task": "",
            "subtasks": [
                ""
            ]
        },
        {
            "task": "Starting tractors and ATVs",
            "subtasks": []
        },
        {
            "task": "Feeding cows",
            "subtasks": []
        },
        {
            "task": "Unloading and storing hay",
            "subtasks": []
        },
        {
            "task": "Operating a chainsaw",
            "subtasks": []
        },
        {
            "task": "Checking and maintaining vehicle batteries",
            "subtasks": []
        },
        {
            "task": "Cleaning and organizing a farm shop",
            "subtasks": []
        },
        {
            "task": "Working with electric fences",
            "subtasks": []
        },
        {
            "task": "Feeding chickens and other animals",
            "subtasks": []
        },
        {
            "task": "Transporting fuel and supplies",
            "subtasks": []
        },
        {
            "task": "Transcribe the key activities from the video transcript and break them down into primary tasks (MAINTASKs) and supporting subtasks. The initial outline includes starting tractors, feeding livestock (specifically cows with hay and minerals, and operating a chainsaw on the farm), maintaining battery power for vehicles (jump-starting trucks and checking charger levels), cleaning and organizing the farm shop, and ensuring the electric fence functions. Subtasks under each MAINTASK detail specific actions like unloading hay bales with ATVs, replacing chainsaw tools, jump-starting methods, cleaning storage areas, and testing fence chargers. These tasks represent the physical efforts a farmer must undertake to maintain daily operations.",
            "subtasks": []
        },
        {
            "task": "MAINTASKS for the video transcript are titled as starting tractors, unloading hay, operating a chainsaw, checking vehicle batteries, cleaning the farm shop, maintaining electric fences, and feeding animals. Each MAINTASK is broken down into specific subtasks such as operating the chainsaw (cleaning, replacing parts), jump-starting vehicles, and feeding cows (kneading, moving bales, distributing feed). The tasks cover a range of farm activities typical of a dairy or livestock operation. Additionally, minor subtasks like refueling vehicles and handling wood debris are mentioned. The list ensures all key actions from the video are captured without extraneous details.",
            "subtasks": []
        },
        {
            "task": "The video transcript outlines a day on a farm, highlighting various tasks a farmer performs. MAINTASKs include operating tractors, ATVs, and feeding livestock. Specific subtasks cover starting and maintaining equipment, unloading hay, managing cattle care, troubleshooting vehicle issues, and farm maintenance. Tasks are relevant to agricultural operations, capturing the daily labor involved in farming.",
            "subtasks": []
        }
    ]
}