{
    "index": "xrOdem1ENvM",
    "title": "Best Pig Breeds For Commercial Pig Farming",
    "url": "https://www.youtube.com/watch?v=xrOdem1ENvM",
    "category": "Pets & Animals",
    "tasks": [
        {
            "task": "Identify and discuss best pig breeds for commercial farming.",
            "subtasks": [
                "Explain importance of choosing the right breed for a commercial farm.",
                "Mention the large white breed as the top choice globally and in Africa.",
                "Highlight the landrace breed as another excellent option for commercial farming.",
                "Discuss the Hampshire breed as a viable choice, noting its prolificacy.",
                "Introduce the TN70 breed as a cross of large white and landrace, suitable for commercial farming.",
                "Mention the Camboro breed as a massive, fast-growing option for crossbreeding.",
                "Recommend the Duroc breed for commercial farmers who want to sell finished products, despite its high cost.",
                "Mention the Pië traits breed as a new entrant in the market with growing popularity."
            ]
        },
        {
            "task": "identify and discuss the best pig breeds for commercial farming. That's MAINTASK: Identify and discuss best pig breeds for commercial farming. Then I need to break this down into subtasks. Let me think. The subtasks would involve explaining why choosing the right breed is important. That's a subtask: Explain importance of choosing the right breed for a commercial farm. Then they mentioned the large white breed as the top choice. So, a subtask could be: Mention the large white breed as the top choice globally and in Africa. They also talked about the landrace breed as another excellent option. So, another subtask: Highlight the landrace breed as another excellent option for commercial farming. They mentioned Hampshire as well. Subtask: Discuss the Hampshire breed as a viable choice. Then they introduced TN70 as a cross of large white and landrace. Maybe: Introduce the TN70 breed as a cross of large white and landrace, suitable for commercial farming. Next, the Camboro was mentioned. So: Mention the Camboro breed as a massive, fast-growing option for crossbreeding. Then Duroc was discussed for those who want to sell finished products. Subtask: Recommend the Duroc breed for commercial farmers who want to sell, despite cost. Finally, the Piëtraits breed was mentioned as new and up-and-coming. So: Mention the Piëtraits breed as a new option gaining popularity. That covers the main tasks I think. But let's make sure.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Identify and discuss best pig breeds for commercial farming.",
            "subtasks": [
                "Explain importance of choosing the right breed for a commercial farm.",
                "Mention the large white breed as the top choice globally and in Africa.",
                "Highlight the landrace breed as another excellent option for commercial farming.",
                "Discuss the Hampshire breed as a viable choice.",
                "Introduce the TN70 breed as a cross of large white and landrace, suitable for commercial farming.",
                "Mention the Camboro breed as a massive, fast-growing option for crossbreeding.",
                "Recommend the Duroc breed for commercial farmers who want to sell finished products, despite its high cost.",
                "Mention the Piëtraits breed as a new entrant in the market with growing popularity."
            ]
        }
    ]
}