{
    "index": "yNuQshqrD_I",
    "title": "Great Plains 2SNT30 Solid Stand no-till grain drill at auction | bidding closes May 9 2018",
    "url": "https://www.youtube.com/watch?v=yNuQshqrD_I",
    "category": "Autos & Vehicles",
    "tasks": [
        {
            "task": "Planting seeds in a cornfield",
            "subtasks": [
                "Walking through a cornfield",
                "Filling a seed planter with corn seeds",
                "Adjusting the seed planter to correct depth",
                "Inserting the seed planter into the soil",
                "Pressing the seed into the ground"
            ]
        },
        {
            "task": "Driving a combine through cornfields",
            "subtasks": [
                "Operating the combine steering wheel",
                "Engaging the combine's harvesting mechanism",
                "Ensuring the combine's baskets are properly positioned",
                "Monitoring grain flow and adjust settings as needed",
                "Driving the combine through different parts of the field"
            ]
        },
        {
            "task": "Loading corn into a truck using a combine",
            "subtasks": [
                "Positioning the combine feeder gate",
                "Connecting the combine's auger to the truck's hopper",
                "Initiating grain discharge from the combine",
                "Monitoring the flow of corn into the truck",
                "Ensuring the truck is not overfilled"
            ]
        },
        {
            "task": "Driving a truck to transport corn",
            "subtasks": [
                "Loading the truck with corn",
                "Reviewing the truck's condition before driving",
                "Securing the load to prevent spillage",
                "Safely driving the truck to the destination",
                "Unloading the corn from the truck at the desired location"
            ]
        },
        {
            "task": "Checking combine hydraulic systems",
            "subtasks": [
                "Inspecting hydraulic hoses for leaks",
                "Checking the hydraulic pump's operation",
                "Cleaning any clogged filters or passages",
                "Testing the combine's hydraulic arms for proper function"
            ]
        },
        {
            "task": "Repairing combine hydraulic arms",
            "subtasks": [
                "Identifying a malfunctioning hydraulic arm",
                "Disconnecting the faulty arm from the hydraulic system",
                "Locating the source of the issue (e.g., broken linkage, damaged cylinder)",
                "Replacing any necessary components",
                "Reconnecting the hydraulic arm and testing its operation"
            ]
        },
        {
            "task": "Attaching machinery to a combine",
            "subtasks": [
                "Identifying the attachment needed for the task (e.g., wagon, gps sensor)",
                "Lifting the attachment into position",
                "Securing the attachment to the combine",
                "Connecting electrical and hydraulic lines"
            ]
        },
        {
            "task": "Performing daily maintenance on a corn combine",
            "subtasks": [
                "Cleaning the combine's chassis and exterior",
                "Checking tightenings and adjusting wheels as needed",
                "Lubricating moving parts",
                "Inspecting all safety features and components for functionality"
            ]
        },
        {
            "task": "Cleaning combine baskets",
            "subtasks": [
                "Accumulating harvested corn in the baskets",
                "Detaching the basket from the combine",
                "Removing any debris or chaff from the basket",
                "Reattaching the cleaned basket to the combine"
            ]
        },
        {
            "task": "Applying fertilizer or pesticide to a cornfield",
            "subtasks": [
                "Mixing the desired chemical in a spreader tank",
                "Driving the spreader to the cornfield",
                "Ensuring an even spread pattern from the spreader",
                "Adjusting spreader speed and rate as necessary"
            ]
        },
        {
            "task": "Walking a cornfield to check for pests or diseases",
            "subtasks": [
                "Surveying the corn rows for signs of distress",
                "Identifying areas with unhealthy plants or insect activity",
                "Collecting samples for further analysis if needed",
                "Reporting observations to a supervisor or manager"
            ]
        },
        {
            "task": "Operating a tractor to pull a corn planter",
            "subtasks": [
                "Attaching the corn planter to the tractor",
                "Checking the implement's attachment points for security",
                "Setting the planter depth according to soil conditions",
                "Beginning to pull the planter through the field"
            ]
        },
        {
            "task": "Repairing a broken stalk in a cornfield",
            "subtasks": [
                "Identifying a plant with a broken stalk",
                "Assessing the damage severity",
                "Cutting the damaged stalk at ground level",
                "Removing any debris or loose leaves to prevent disease spread"
            ]
        },
        {
            "task": "Pruning dead leaves from corn stalks",
            "subtasks": [
                "Walking through the cornfield",
                "Locating dead or withered leaves on stalks",
                "Using pruners or a similar tool to remove the dead leaves",
                "Ensuring no damage is done to live tissue"
            ]
        },
        {
            "task": "Aligning rows for efficient combine operation",
            "subtasks": [
                "Walking the cornfield to identify uneven rows",
                "Marking or noting the rows needing adjustment",
                "Using a cultivator or similar tool to straighten the rows",
                "Replanting if necessary"
            ]
        },
        {
            "task": "Operating a sprayer to apply herbicides",
            "subtasks": [
                "Mixing the herbicide in the sprayer tank",
                "Guiding the sprayer through the cornfield",
                "Maintaining proper herbicide application settings",
                "Checking for even distribution of the chemical"
            ]
        },
        {
            "task": "Cleaning residue from combine baskets",
            "subtasks": [
                "Collecting residue from the baskets after harvesting",
                "Removing or breaking down any clumps or debris",
                "Ensuring the baskets drain properly"
            ]
        },
        {
            "task": "Filtering grain into containers",
            "subtasks": [
                "Harvesting corn and directing it into a container",
                "Using a sifter or other tool to sort grain",
                "Separating unwanted material from the grain",
                "Weighing or measuring the amount of grain collected"
            ]
        },
        {
            "task": "Eradicating a broken stalk from a cornfield",
            "subtasks": [
                "Locating a broken stalk",
                "Cutting or pulling it out by hand",
                "Disposing of the broken stalk properly",
                "moving through rows, which might not be physical, but parts of it. But maybe as a subtask: walking through a cornfield (SUBTASK).",
                "Then filling a seed planter with corn seeds (SUBTASK). Adjusting the planter depth to ensure correct planting depth (SUBTASK). Inserting the planter into the soil (SUBTASK), then pressing the seed into the ground (another SUBTASK). But perhaps the main task here is Planting seeds in a cornfield (MAINTASK), with subtasks for each step.",
                "Similarly, when operating a combine, there's a main task Driving a combine through cornfields. That's the general action. Underneath, that could involve operating the steering (SUBTASK), engaging the harvesting mechanism (SUBTASK), ensuring baskets are positioned correctly (SUBTASK), monitoring grain flow (SUBTASK), and driving through the field (maybe driving through different parts of it). So break down each component."
            ]
        },
        {
            "task": "For combine maintenance, check hydraulic systems. Subtasks would include inspecting hoses, checking the pump, cleaning filters, testing hydraulic arms. Then if there's a specific task like repairing combine hydraulic arms, that's a separate MAINTASK. Underneath, identifying the problem, disconnecting the arm, locating the issue (like a broken linkage), replacing components, retesting.",
            "subtasks": []
        },
        {
            "task": "Attaching machinery to a combine. The MAINTASK could be Attaching machinery to a combine. Subtasks include identifying the needed attachment, lifting into position, securing the attachment, and connecting lines.",
            "subtasks": []
        },
        {
            "task": "accumulating grain, detaching basket, cleaning debris, and reattaching.",
            "subtasks": []
        },
        {
            "task": "mixing the chemical in the spreader, driving through the field, ensuring even spread, adjusting rate. Pest control would have similar steps.",
            "subtasks": []
        },
        {
            "task": "Operating a tractor with a corn planter would be a MAINTASK. Subtasks might include attaching the planter, checking attachment security, setting depth, and pulling through the field. While doing that, keep an eye on row spacing and depth.",
            "subtasks": []
        },
        {
            "task": "Pruning dead leaves. Subtasks: walking through the field, finding dead leaves, using pruners to remove them, being careful not to damage live tissue.",
            "subtasks": []
        },
        {
            "task": "Operating a sprayer. Subtasks: mixing the herbicide, driving through the field, maintaining the application rate, checking distribution.",
            "subtasks": []
        },
        {
            "task": "identification, cutting at ground level, debris removal.",
            "subtasks": []
        },
        {
            "task": "** Planting seeds in a cornfield",
            "subtasks": []
        },
        {
            "task": "** Driving a combine through cornfields",
            "subtasks": []
        },
        {
            "task": "** Loading corn into a truck using a combine",
            "subtasks": []
        },
        {
            "task": "** Driving a truck to transport corn",
            "subtasks": []
        },
        {
            "task": "** Checking combine hydraulic systems",
            "subtasks": []
        },
        {
            "task": "** Repairing combine hydraulic arms",
            "subtasks": []
        },
        {
            "task": "** Attaching machinery to a combine",
            "subtasks": []
        },
        {
            "task": "** Performing daily maintenance on a corn combine",
            "subtasks": []
        },
        {
            "task": "** Cleaning combine baskets",
            "subtasks": []
        },
        {
            "task": "** Applying fertilizer or pesticide to a cornfield",
            "subtasks": []
        },
        {
            "task": "** Walking a cornfield to check for pests or diseases",
            "subtasks": []
        },
        {
            "task": "** Operating a tractor to pull a corn planter",
            "subtasks": []
        },
        {
            "task": "** Repairing a broken stalk in a cornfield",
            "subtasks": []
        },
        {
            "task": "** Pruning dead leaves from corn stalks",
            "subtasks": []
        },
        {
            "task": "** Aligning rows for efficient combine operation",
            "subtasks": []
        },
        {
            "task": "** Operating a sprayer to apply herbicides",
            "subtasks": []
        },
        {
            "task": "** Cleaning residue from combine baskets",
            "subtasks": []
        },
        {
            "task": "** Filtering grain into containers",
            "subtasks": []
        },
        {
            "task": "** Eradicating a broken stalk from a cornfield",
            "subtasks": []
        },
        {
            "task": "** Applying row markers to cornfield",
            "subtasks": []
        }
    ]
}