{
    "index": "zVohOKrtGYQ",
    "title": "Feed a key issue to manage livestock systems in transition",
    "url": "https://www.youtube.com/watch?v=zVohOKrtGYQ",
    "category": "Science & Technology",
    "tasks": [
        {
            "task": "Engage in a project on intensifying livestock systems focusing on feed resources.",
            "subtasks": [
                "Understand the role of feed in livestock productivity.",
                "Analyze the environmental impact of feed usage.",
                "Reflect on past feed resource management with innovation systems and value chains.",
                "Identify key messages from recent workshops on feed resources.",
                "Discuss future approaches to address feed gaps.",
                "Explore market demands for increased meat and milk production in developing countries.",
                "Address technical limitations and focus on scalability.",
                "Determine strategies for balancing feed resource demand and mitigation.",
                "Consider potential trade-offs between feed production and resource scarcity."
            ]
        },
        {
            "task": "** Engage in a project on intensifying livestock systems focusing on feed resources.",
            "subtasks": [
                "** Understand the role of feed in livestock productivity.",
                "** Analyze the environmental impact of feed usage.",
                "** Reflect on past feed resource management practices, including the application of innovation systems and value chains.",
                "** Identify key messages from recent workshops on the importance of integrating feed resources into system sustainability.",
                "** Discuss future strategies for addressing feed gaps and scaling up production to meet market demands in developing countries.",
                "** Explore methods for balancing the positive economic benefits of improved feed resources with potential environmental trade-offs.",
                "** Consider the long-term implications of increased productivity on traditional small-scale holdings and potential shifts in production systems."
            ]
        }
    ]
}