{
  "text": "When gardening and caring for onions and garlic,\nthere is sometimes confusion on what exactly to do. For garlic, we always want to top the plants\nto help build the bulbs. For onions, however, we do not want to cut\nor top them. If we find onions in our garden that look\nsimilar to these, with flowers, we want to pull them immediately. If we have onions that have not flowered,\nwe want them to continue growing naturally until the stalks have fallen over by themselves. We’ll want to make sure to pull them out\non a hot, dry sunny day like we have today. Once we have pulled the onions, we’ll want\nto leave the stalks on and let them cure naturally in a cool, dry place for two to three weeks. After that time, we’ll then want to cut\nthe stalks about one to two inches above the bulb, and then we can use them for storage. We’ll want to store the healthy onions by\nthemselves, avoiding any damaged or diseased onions with the healthy ones. Some varieties may last two to three months,\nwhile others many only last one to two weeks. From the University of Wyoming Extension,\nI’m Brian Sebade, and you’re watching From the Ground Up.",
  "segments": [
    {
      "id": 0,
      "start": 8.149,
      "end": 13.69,
      "text": "When gardening and caring for onions and garlic,\nthere is sometimes confusion on what exactly"
    },
    {
      "id": 1,
      "start": 13.69,
      "end": 14.69,
      "text": "to do."
    },
    {
      "id": 2,
      "start": 14.69,
      "end": 19.11,
      "text": "For garlic, we always want to top the plants\nto help build the bulbs."
    },
    {
      "id": 3,
      "start": 19.11,
      "end": 22.46,
      "text": "For onions, however, we do not want to cut\nor top them."
    },
    {
      "id": 4,
      "start": 22.46,
      "end": 26.759,
      "text": "If we find onions in our garden that look\nsimilar to these, with flowers, we want to"
    },
    {
      "id": 5,
      "start": 26.759,
      "end": 28.49,
      "text": "pull them immediately."
    },
    {
      "id": 6,
      "start": 28.49,
      "end": 33.36,
      "text": "If we have onions that have not flowered,\nwe want them to continue growing naturally"
    },
    {
      "id": 7,
      "start": 33.36,
      "end": 36.45,
      "text": "until the stalks have fallen over by themselves."
    },
    {
      "id": 8,
      "start": 36.45,
      "end": 42.23,
      "text": "We’ll want to make sure to pull them out\non a hot, dry sunny day like we have today."
    },
    {
      "id": 9,
      "start": 42.23,
      "end": 46.97,
      "text": "Once we have pulled the onions, we’ll want\nto leave the stalks on and let them cure naturally"
    },
    {
      "id": 10,
      "start": 46.97,
      "end": 49.68,
      "text": "in a cool, dry place for two to three weeks."
    },
    {
      "id": 11,
      "start": 49.68,
      "end": 54.449,
      "text": "After that time, we’ll then want to cut\nthe stalks about one to two inches above the"
    },
    {
      "id": 12,
      "start": 54.449,
      "end": 56.58,
      "text": "bulb, and then we can use them for storage."
    },
    {
      "id": 13,
      "start": 56.58,
      "end": 61.799,
      "text": "We’ll want to store the healthy onions by\nthemselves, avoiding any damaged or diseased"
    },
    {
      "id": 14,
      "start": 61.799,
      "end": 64.28,
      "text": "onions with the healthy ones."
    },
    {
      "id": 15,
      "start": 64.28,
      "end": 68.88,
      "text": "Some varieties may last two to three months,\nwhile others many only last one to two weeks."
    },
    {
      "id": 16,
      "start": 68.88,
      "end": 72.33,
      "text": "From the University of Wyoming Extension,\nI’m Brian Sebade, and you’re watching"
    },
    {
      "id": 17,
      "start": 72.33,
      "end": 74.0,
      "text": "From the Ground Up."
    }
  ],
  "language": "en"
}