{
  "text": "My name is Patrick Zimmerer from Table Mountain Vineyards and Winery near Huntley, Wyoming and our part of our operation is a vineyard and winery obviously, but we also are a diversified farm and ranch as well. We kind of run two different enterprises on the same land but our entire acreage consists of a farm and ranch as well as vineyards of cattle, beef cattle, corn, alfalfa, and grass hay, wheat, and silage corn as well. We're a pretty diversified operation, so throughout the different years we've done anything from custom cattle feeding, running other cattle on our pastures dry edible beans, it just depends on kind of our crop rotation and where we're at in our enterprise, so. We host weddings, private events, meals, we've done everything from birthday parties to anniversaries to even a memorial service, so we're very diversified in that aspect and it helps us generate interest in the winery, obviously, create demand in our products as well as just kind of be a community center for the locals to gather because unfortunately as towns get smaller and smaller theres less places that you can do things so that's where we're at with that. Well that the vineyard and winery aspect of our operation is probably I think we run on just a little over 10 acres compared to the over thousand acres that we manage and, and having commercial agricultural production, but within that 10 acres is probably ninety percent of our labor force it seems. Vineyard, growing vineyards in Wyoming or anywhere across the U.S. is a very labor-intensive... A lot of work goes into it, a lot of hand pruning. There's not a lot of mechanical equipment that you can purchase it and so there's a lot of hand pruning, hand picking pretty much everything we do we have about 10,000 vines every time we do something to one vine, we have to 10,000 times. So very labor-intensive. And then our focus is to make solely and purely 100% Wyoming grown wines and products. So we make grape wine, honey wine, raspberry wine but everything we do is 100% Wyoming grown. In terms of where we planted grapes, it kind of goes along with how we built the winery. We planted in areas we couldn't productively farm. We have vineyards in the corners of pivots. When the pivot swing, there's always that, that triangle that you can't really irrigate efficiently and get to. At least we couldn't because of the way our irrigation systems work. So a lot of our grapes are in kind of minimalized places that were just basically either weed patches or corners that we couldn't irrigate. Most of the factors, at least for the crop land, I guess our factor is just obviously diversification, crop rotation, yields, especially for varieties of corn which, which grow in a very short season We're making leaps and bounds with new varieties of corn and so every year we're trying to I guess focus on the new better variety or varieties that are more suited to our soil conditions, and so I would say probably crop yield, the feasibility of it, how much inputs were putting to get x amount of outputs out. I mean we do have areas across our farm that we have found that just weren't meant for, for growing crops and they have a little higher pH or a little less drainage and so we've just really changed our thinking I guess over the years and so much of pushing to get every single acre into cropland, but really focusing on the acres at work well. So non-crop habitats on our property would include I guess grassland. Just areas that we've turned into grass either for pasture or it's not a true crop. We've actually taken some cropland and turned it back into wetland and a lot of those places were places again that we found that we couldn't farm productively, or we were putting more inputs than we were getting out of it. So we have turned a lot of wetlands areas over just kind of in that natural habitat. We have three duck ponds here nearby the winery, and then we have one large pond on our farm as well where we've basically turned that back into kind of what it used to be. I think the non cropland is very important to part of our operation because there are areas that just need to kind of stay in that natural habitat. We will turn some of those non-croplands maybe eventually into cropland, depends on the year and the moisture, but just as part of I guess keeping the soils keeping the nutrients and kind of being able to rotate and transfer through that. And the non-cropland areas also are great. I guess habitat for wildlife. Wild turkey we have been able to get on the property. A few years ago we had one and now I think we have about 30 so all of those areas have helped kind of expand that wildlife aspect of it. The deer are doing very well here which were unfortunately they like to attack our corn and our grapes but we do get a lot of different wildlife here. And since we've expanded the wetlands we also get a pretty stable and pretty hardy amount of Sandhills cranes that come through at the end of March and April and so it's kind of a fun thing to kind of watch them as they migrate through but we'll get thousands of them at any given time just kind of hanging out in the cornfield and near the waterways. The public perception of the habitats, whenever you try and enhance a landscape I think that's, that's a win both for a producer and for public perception one of our, I guess, desires when we built a few of our wetlands over here by the the winery in kind of the event center was to take an area that was probably not as slightly as it could be and to at least enhance that a little bit. It just kind of helps with the overall perception, not only from the agricultural perspective, but where we are in kind of an agro-tourism industry through the winery. It also helps tell that story a little bit and get people to realize that agriculture is a lot more about, you know, just farming as much as you can but also being a steward to the land. I would say probably in the next few years we will obviously look at more water saving features. Probably adding some different irrigation systems, pivots. We're actually looking at subsurface irrigation. Some just kind of new techniques, especially in areas that are prone to being waterlogged or don't drain as well and again just kind of focusing on, on the area that we have and and just trying to improve the area as a whole as well as, I guess continue in the agricultural industry like we have for generations.",
  "segments": [
    {
      "id": 0,
      "start": 18.3,
      "end": 23.32,
      "text": "My name is Patrick Zimmerer from Table Mountain Vineyards and Winery near Huntley, Wyoming and"
    },
    {
      "id": 1,
      "start": 24.54,
      "end": 31.92,
      "text": "our part of our operation is a vineyard and winery obviously, but we also are a diversified farm and ranch as well."
    },
    {
      "id": 2,
      "start": 31.92,
      "end": 34.619,
      "text": "We kind of run two different enterprises on the same land"
    },
    {
      "id": 3,
      "start": 35.14,
      "end": 36.73,
      "text": "but our entire"
    },
    {
      "id": 4,
      "start": 36.73,
      "end": 42.179,
      "text": "acreage consists of a farm and ranch as well as vineyards of cattle, beef cattle,"
    },
    {
      "id": 5,
      "start": 42.699,
      "end": 47.279,
      "text": "corn, alfalfa, and grass hay, wheat, and silage corn as well."
    },
    {
      "id": 6,
      "start": 48.429,
      "end": 50.728,
      "text": "We're a pretty diversified operation, so"
    },
    {
      "id": 7,
      "start": 51.699,
      "end": 55.408,
      "text": "throughout the different years we've done anything from custom cattle feeding,"
    },
    {
      "id": 8,
      "start": 57.19,
      "end": 59.249,
      "text": "running other cattle on our pastures"
    },
    {
      "id": 9,
      "start": 59.769,
      "end": 66.899,
      "text": "dry edible beans, it just depends on kind of our crop rotation and where we're at in our enterprise, so. We host weddings,"
    },
    {
      "id": 10,
      "start": 67.479,
      "end": 69.28,
      "text": "private events,"
    },
    {
      "id": 11,
      "start": 69.28,
      "end": 70.509,
      "text": "meals,"
    },
    {
      "id": 12,
      "start": 70.509,
      "end": 73.559,
      "text": "we've done everything from birthday parties to anniversaries to"
    },
    {
      "id": 13,
      "start": 74.259,
      "end": 79.109,
      "text": "even a memorial service, so we're very diversified in that aspect and it helps us"
    },
    {
      "id": 14,
      "start": 80.14,
      "end": 82.14,
      "text": "generate interest in the winery,"
    },
    {
      "id": 15,
      "start": 82.149,
      "end": 89.339,
      "text": "obviously, create demand in our products as well as just kind of be a community center for the locals to gather because unfortunately as"
    },
    {
      "id": 16,
      "start": 89.649,
      "end": 95.009,
      "text": "towns get smaller and smaller theres less places that you can do things so that's where we're at with that."
    },
    {
      "id": 17,
      "start": 98.02,
      "end": 102.929,
      "text": "Well that the vineyard and winery aspect of our operation is probably"
    },
    {
      "id": 18,
      "start": 103.42,
      "end": 106.229,
      "text": "I think we run on just a little over 10 acres"
    },
    {
      "id": 19,
      "start": 106.899,
      "end": 112.799,
      "text": "compared to the over thousand acres that we manage and, and having commercial agricultural production,"
    },
    {
      "id": 20,
      "start": 112.99,
      "end": 117.78,
      "text": "but within that 10 acres is probably ninety percent of our labor force it seems."
    },
    {
      "id": 21,
      "start": 118.42,
      "end": 124.619,
      "text": "Vineyard, growing vineyards in Wyoming or anywhere across the U.S. is a very labor-intensive..."
    },
    {
      "id": 22,
      "start": 125.259,
      "end": 131.068,
      "text": "A lot of work goes into it, a lot of hand pruning. There's not a lot of mechanical equipment that you can purchase it and so"
    },
    {
      "id": 23,
      "start": 132.04,
      "end": 135.36,
      "text": "there's a lot of hand pruning, hand picking pretty much everything we do"
    },
    {
      "id": 24,
      "start": 135.38,
      "end": 140.42,
      "text": "we have about 10,000 vines every time we do something to one vine, we have to 10,000 times."
    },
    {
      "id": 25,
      "start": 140.46,
      "end": 148.42,
      "text": "So very labor-intensive. And then our focus is to make solely and purely 100% Wyoming grown wines and products."
    },
    {
      "id": 26,
      "start": 148.42,
      "end": 151.98,
      "text": "So we make grape wine, honey wine, raspberry wine but everything"
    },
    {
      "id": 27,
      "start": 152.0,
      "end": 154.04,
      "text": "we do is 100% Wyoming grown."
    },
    {
      "id": 28,
      "start": 154.88,
      "end": 161.24,
      "text": "In terms of where we planted grapes, it kind of goes along with how we built the winery. We planted in areas we couldn't productively farm."
    },
    {
      "id": 29,
      "start": 161.54,
      "end": 164.84,
      "text": "We have vineyards in the corners of pivots."
    },
    {
      "id": 30,
      "start": 164.9,
      "end": 170.14,
      "text": "When the pivot swing, there's always that, that triangle that you can't really irrigate efficiently and get to."
    },
    {
      "id": 31,
      "start": 170.85,
      "end": 174.32,
      "text": "At least we couldn't because of the way our irrigation systems work."
    },
    {
      "id": 32,
      "start": 174.32,
      "end": 178.699,
      "text": "So a lot of our grapes are in kind of minimalized places that were just basically"
    },
    {
      "id": 33,
      "start": 179.7,
      "end": 183.56,
      "text": "either weed patches or corners that we couldn't irrigate."
    },
    {
      "id": 34,
      "start": 186.57,
      "end": 194.269,
      "text": "Most of the factors, at least for the crop land, I guess our factor is just obviously diversification,"
    },
    {
      "id": 35,
      "start": 195.63,
      "end": 197.61,
      "text": "crop rotation,"
    },
    {
      "id": 36,
      "start": 197.61,
      "end": 202.399,
      "text": "yields, especially for varieties of corn which, which grow in a very short season"
    },
    {
      "id": 37,
      "start": 202.44,
      "end": 209.239,
      "text": "We're making leaps and bounds with new varieties of corn and so every year we're trying to I guess focus on the new better"
    },
    {
      "id": 38,
      "start": 209.85,
      "end": 211.85,
      "text": "variety or varieties that are more suited to our"
    },
    {
      "id": 39,
      "start": 212.4,
      "end": 215.6,
      "text": "soil conditions, and so I would say probably crop yield,"
    },
    {
      "id": 40,
      "start": 217.04,
      "end": 221.78,
      "text": "the feasibility of it, how much inputs were putting to get x amount of outputs out."
    },
    {
      "id": 41,
      "start": 221.94,
      "end": 226.66,
      "text": "I mean we do have areas across our farm that we have found that just weren't meant for,"
    },
    {
      "id": 42,
      "start": 227.1,
      "end": 231.529,
      "text": "for growing crops and they have a little higher pH or a little less drainage"
    },
    {
      "id": 43,
      "start": 231.529,
      "end": 238.82,
      "text": "and so we've just really changed our thinking I guess over the years and so much of pushing to get every single acre into"
    },
    {
      "id": 44,
      "start": 238.86,
      "end": 241.48,
      "text": "cropland, but really focusing on the acres at work well."
    },
    {
      "id": 45,
      "start": 244.52,
      "end": 252.2,
      "text": "So non-crop habitats on our property would include I guess grassland."
    },
    {
      "id": 46,
      "start": 252.48,
      "end": 254.76,
      "text": "Just areas that we've turned into grass either for pasture or"
    },
    {
      "id": 47,
      "start": 256.41,
      "end": 260.299,
      "text": "it's not a true crop. We've actually taken some cropland and"
    },
    {
      "id": 48,
      "start": 261.12,
      "end": 266.359,
      "text": "turned it back into wetland and a lot of those places were places again that we found that we couldn't farm"
    },
    {
      "id": 49,
      "start": 266.52,
      "end": 273.04,
      "text": "productively, or we were putting more inputs than we were getting out of it. So we have turned a lot of wetlands areas over"
    },
    {
      "id": 50,
      "start": 274.01,
      "end": 280.269,
      "text": "just kind of in that natural habitat. We have three duck ponds here nearby the winery, and then we have one large"
    },
    {
      "id": 51,
      "start": 281.15,
      "end": 288.4,
      "text": "pond on our farm as well where we've basically turned that back into kind of what it used to be. I think the non cropland"
    },
    {
      "id": 52,
      "start": 288.83,
      "end": 291.4,
      "text": "is very important to part of our operation because"
    },
    {
      "id": 53,
      "start": 292.19,
      "end": 295.929,
      "text": "there are areas that just need to kind of stay in that natural habitat."
    },
    {
      "id": 54,
      "start": 296.63,
      "end": 303.04,
      "text": "We will turn some of those non-croplands maybe eventually into cropland, depends on the year and the moisture, but just as part of"
    },
    {
      "id": 55,
      "start": 303.98,
      "end": 306.069,
      "text": "I guess keeping the soils"
    },
    {
      "id": 56,
      "start": 306.88,
      "end": 314.48,
      "text": "keeping the nutrients and kind of being able to rotate and transfer through that. And the non-cropland areas also are great."
    },
    {
      "id": 57,
      "start": 315.3,
      "end": 317.3,
      "text": "I guess habitat for wildlife."
    },
    {
      "id": 58,
      "start": 317.3,
      "end": 320.89,
      "text": "Wild turkey we have been able to get on the property. A few years ago"
    },
    {
      "id": 59,
      "start": 320.89,
      "end": 326.439,
      "text": "we had one and now I think we have about 30 so all of those areas have helped kind of expand that"
    },
    {
      "id": 60,
      "start": 327.98,
      "end": 331.749,
      "text": "wildlife aspect of it. The deer are doing very well here which were"
    },
    {
      "id": 61,
      "start": 332.72,
      "end": 336.279,
      "text": "unfortunately they like to attack our corn and our grapes"
    },
    {
      "id": 62,
      "start": 336.28,
      "end": 341.169,
      "text": "but we do get a lot of different wildlife here. And since we've expanded the"
    },
    {
      "id": 63,
      "start": 341.3,
      "end": 344.83,
      "text": "wetlands we also get a pretty stable and pretty"
    },
    {
      "id": 64,
      "start": 345.83,
      "end": 349.689,
      "text": "hardy amount of Sandhills cranes that come through at the end of March and April and"
    },
    {
      "id": 65,
      "start": 349.85,
      "end": 352.33,
      "text": "so it's kind of a fun thing to kind of watch"
    },
    {
      "id": 66,
      "start": 352.729,
      "end": 357.099,
      "text": "them as they migrate through but we'll get thousands of them at any given time just"
    },
    {
      "id": 67,
      "start": 357.2,
      "end": 360.279,
      "text": "kind of hanging out in the cornfield and near the waterways."
    },
    {
      "id": 68,
      "start": 363.979,
      "end": 368.289,
      "text": "The public perception of the habitats, whenever you try and enhance a landscape"
    },
    {
      "id": 69,
      "start": 368.29,
      "end": 373.299,
      "text": "I think that's, that's a win both for a producer and for public perception"
    },
    {
      "id": 70,
      "start": 374.54,
      "end": 376.54,
      "text": "one of our, I guess,"
    },
    {
      "id": 71,
      "start": 377.15,
      "end": 379.419,
      "text": "desires when we built a few of our wetlands"
    },
    {
      "id": 72,
      "start": 379.55,
      "end": 385.329,
      "text": "over here by the the winery in kind of the event center was to take an area that was probably not as"
    },
    {
      "id": 73,
      "start": 385.61,
      "end": 390.52,
      "text": "slightly as it could be and to at least enhance that a little bit. It just kind of helps with the overall"
    },
    {
      "id": 74,
      "start": 390.8,
      "end": 393.16,
      "text": "perception, not only from the agricultural"
    },
    {
      "id": 75,
      "start": 394.22,
      "end": 400.839,
      "text": "perspective, but where we are in kind of an agro-tourism industry through the winery. It also helps tell that story a little bit and"
    },
    {
      "id": 76,
      "start": 400.84,
      "end": 403.09,
      "text": "get people to realize that agriculture is a lot more about,"
    },
    {
      "id": 77,
      "start": 404.24,
      "end": 408.429,
      "text": "you know, just farming as much as you can but also being a steward to the land."
    },
    {
      "id": 78,
      "start": 411.83,
      "end": 415.3,
      "text": "I would say probably in the next few years we will obviously look at"
    },
    {
      "id": 79,
      "start": 416.27,
      "end": 417.5,
      "text": "more"
    },
    {
      "id": 80,
      "start": 417.5,
      "end": 419.5,
      "text": "water saving features."
    },
    {
      "id": 81,
      "start": 420.5,
      "end": 424.4,
      "text": "Probably adding some different irrigation systems, pivots."
    },
    {
      "id": 82,
      "start": 424.62,
      "end": 426.62,
      "text": "We're actually looking at subsurface irrigation."
    },
    {
      "id": 83,
      "start": 427.64,
      "end": 433.86,
      "text": "Some just kind of new techniques, especially in areas that are prone to being waterlogged or don't drain as well"
    },
    {
      "id": 84,
      "start": 434.51,
      "end": 435.89,
      "text": "and again"
    },
    {
      "id": 85,
      "start": 435.89,
      "end": 439.809,
      "text": "just kind of focusing on, on the area that we have and and just trying to"
    },
    {
      "id": 86,
      "start": 439.94,
      "end": 446.14,
      "text": "improve the area as a whole as well as, I guess continue in the agricultural industry like we have for generations."
    }
  ],
  "language": "en"
}