{
  "text": "Hi! I’m Lendert. I am a scientist and I work at Wageningen University in the Netherlands. On the website www.best4soil.eu go to the page \"Database\". Read the explanation on this page and then scroll down to choose one of the two databases. If the database is not in your language you change this by choosing the language in the top left corner. But for the moment we continue in English. The demonstration of the database uses the example in the Best4Soil factsheet on crop rotation. First, you choose the country. Then you choose the soil type. Then you add the name of your request. Now you select the crops. You do this if possible already in the right order. There are three groups of crops: Field crops including black fallow Green manure and cover crops, and vegetables (including strawberry). In \"Crop selection\" you can change the order of the crop sequence. Now you select the nematode species you would like to add to your request. Then you click on the \"Create scheme\" button. A pdf-file will now show up. Depending on your device and your brower, this happens directly or you have to check your downloaded files. On the scheme you can see the crops in the selected order The nematode species  are displayed in the header, and just below you will see the soil types. The colour of a cell describes the damage caused by a nematode species to a host plant The symbol in a cell describes the host status of a plant for a nematode species The letters of a column describe for which soil type the information is valid You can change the order of the crops by clicking on the arrows left of the crops. You can remove a crop from your request. You can also add a crop (or fallow) a second time to your request. Background information is available by clicking on a cell. For example onion & Dytylenchus dipsaci or onion & Paratrichodorus teres or potato & Globodera spp. or potato & Paratrichodorus teres.",
  "segments": [
    {
      "id": 0,
      "start": 4.4,
      "end": 8.26,
      "text": "Hi! I’m Lendert. I am a scientist and I work at Wageningen University in the Netherlands."
    },
    {
      "id": 1,
      "start": 22.46,
      "end": 24.48,
      "text": "On the website www.best4soil.eu go to the page \"Database\"."
    },
    {
      "id": 2,
      "start": 25.14,
      "end": 28.06,
      "text": "Read the explanation on this page and then scroll down"
    },
    {
      "id": 3,
      "start": 28.06,
      "end": 31.5,
      "text": "to choose one of the two databases."
    },
    {
      "id": 4,
      "start": 34.86,
      "end": 38.66,
      "text": "If the database is not in your language you change this"
    },
    {
      "id": 5,
      "start": 38.66,
      "end": 42.32,
      "text": "by choosing the language in the top left corner."
    },
    {
      "id": 6,
      "start": 42.54,
      "end": 47.02,
      "text": "But for the moment we continue in English."
    },
    {
      "id": 7,
      "start": 50.48,
      "end": 54.02,
      "text": "The demonstration of the database uses the example in"
    },
    {
      "id": 8,
      "start": 54.02,
      "end": 55.88,
      "text": "the Best4Soil factsheet on crop rotation."
    },
    {
      "id": 9,
      "start": 63.68,
      "end": 69.24,
      "text": "First, you choose the country."
    },
    {
      "id": 10,
      "start": 70.02,
      "end": 72.58,
      "text": "Then you choose the soil type."
    },
    {
      "id": 11,
      "start": 73.22,
      "end": 79.16,
      "text": "Then you add the name of your request."
    },
    {
      "id": 12,
      "start": 79.72,
      "end": 85.06,
      "text": "Now you select the crops."
    },
    {
      "id": 13,
      "start": 86.06,
      "end": 89.72,
      "text": "You do this if possible already in the right order."
    },
    {
      "id": 14,
      "start": 90.56,
      "end": 95.68,
      "text": "There are three groups of crops: Field crops including black fallow"
    },
    {
      "id": 15,
      "start": 96.18,
      "end": 98.4,
      "text": "Green manure and cover crops,"
    },
    {
      "id": 16,
      "start": 107.58,
      "end": 114.36,
      "text": "and vegetables (including strawberry)."
    },
    {
      "id": 17,
      "start": 117.34,
      "end": 123.2,
      "text": "In \"Crop selection\" you can change the order of the crop sequence."
    },
    {
      "id": 18,
      "start": 123.2,
      "end": 125.98,
      "text": "Now you select the nematode species you would like to add to your request."
    },
    {
      "id": 19,
      "start": 141.32,
      "end": 144.5,
      "text": "Then you click on the \"Create scheme\" button."
    },
    {
      "id": 20,
      "start": 144.64,
      "end": 145.94,
      "text": "A pdf-file will now show up."
    },
    {
      "id": 21,
      "start": 146.22,
      "end": 147.5,
      "text": "Depending on your device and your brower, this happens directly"
    },
    {
      "id": 22,
      "start": 147.74,
      "end": 148.62,
      "text": "or you have to check your downloaded files."
    },
    {
      "id": 23,
      "start": 151.96,
      "end": 154.5,
      "text": "On the scheme you can see the crops in the selected order"
    },
    {
      "id": 24,
      "start": 155.02,
      "end": 156.82,
      "text": "The nematode species  are displayed in the header,"
    },
    {
      "id": 25,
      "start": 157.66,
      "end": 159.36,
      "text": "and just below you will see the soil types."
    },
    {
      "id": 26,
      "start": 161.06,
      "end": 163.02,
      "text": "The colour of a cell describes the damage caused by"
    },
    {
      "id": 27,
      "start": 163.2,
      "end": 165.06,
      "text": "a nematode species to a host plant"
    },
    {
      "id": 28,
      "start": 165.86,
      "end": 167.52,
      "text": "The symbol in a cell describes the host status of a"
    },
    {
      "id": 29,
      "start": 167.52,
      "end": 169.12,
      "text": "plant for a nematode species"
    },
    {
      "id": 30,
      "start": 170.1,
      "end": 171.5,
      "text": "The letters of a column describe for which soil type"
    },
    {
      "id": 31,
      "start": 171.62,
      "end": 172.98,
      "text": "the information is valid"
    },
    {
      "id": 32,
      "start": 174.64,
      "end": 182.54,
      "text": "You can change the order of the crops by clicking on the arrows left of the crops."
    },
    {
      "id": 33,
      "start": 189.8,
      "end": 192.22,
      "text": "You can remove a crop from your request."
    },
    {
      "id": 34,
      "start": 193.3,
      "end": 197.22,
      "text": "You can also add a crop (or fallow) a second time to your request."
    },
    {
      "id": 35,
      "start": 199.48,
      "end": 202.88,
      "text": "Background information is available by clicking on a cell."
    },
    {
      "id": 36,
      "start": 202.88,
      "end": 204.9,
      "text": "For example onion & Dytylenchus dipsaci"
    },
    {
      "id": 37,
      "start": 217.64,
      "end": 220.42,
      "text": "or onion & Paratrichodorus teres"
    },
    {
      "id": 38,
      "start": 229.88,
      "end": 232.16,
      "text": "or potato & Globodera spp."
    },
    {
      "id": 39,
      "start": 251.02,
      "end": 253.42,
      "text": "or potato & Paratrichodorus teres."
    }
  ],
  "language": "en"
}