{
  "index": "itPKpXpIaL4",
  "title": "Unknown Title",
  "url": "https://www.youtube.com/watch?v=itPKpXpIaL4",
  "category": "Unknown Category",
  "video_id": "itPKpXpIaL4",
  "tasks": [
    {
      "task": "Hosts a conversation with Spongele (Uu Sbongilekele) about her agribusiness online platform, African Women in Agriculture (AWIA), and farming incubation programs.",
      "task_start": 243.28,
      "task_end": 245.76,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": [
        {
          "text": "Introduces Spongele (Uu Sbongilekele) and the podcast.",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        },
        {
          "text": "Discusses the expansion of farming space in Akinow, partnership with TLC Children's Home, and hydroponic setup.",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        },
        {
          "text": "Describes the AWIA incubation program, involving five women (Janice, Agnes, Veronica, Bianca, Spongele) and its four benefits (land, finance, training, practical experience).",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        },
        {
          "text": "Explains the online platform \"I Am Citizen\" for community engagement, question-answering, and showcasing farms and stakeholders.",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        },
        {
          "text": "Discusses past incubation successes, international interest in replicating the model, and plans for expansion in Gauteng and India.",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        },
        {
          "text": "Provides advice for aspiring farmers (tenacity, being a solution, starting small, dreaming big, collaboration).",
          "segment_id": 552,
          "match_score": 56.0,
          "start": 1314.0,
          "end": 1317.76
        },
        {
          "text": "Summarizes the importance of starting local with backyard farming and utilizing available spaces.",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        }
      ]
    },
    {
      "task": "Describes the agribusiness online platform, AWIA, and its farming incubation programs.",
      "task_start": 243.28,
      "task_end": 245.76,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": [
        {
          "text": "Explains the AWIA incubation program's goals and structure (five women, six-month training, groups of up to 24).",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        },
        {
          "text": "Highlights AWIA's focus on hydroponic and organic farming, expanded to include poultry and potential future ventures (piggery, sheep, goat, rabbit farming).",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        },
        {
          "text": "Details AWIA's partnership with Eben Fresh for crop sale and revenue reinvestment.",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        },
        {
          "text": "Discusses the \"I Am Citizen\" platform's functions, community engagement, and profiles of stakeholders, farmers, and inputs suppliers.",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        },
        {
          "text": "Outlines Spongele's advice for aspiring farmers (start with tenacity, be a solution, utilize available spaces, dream big).",
          "segment_id": 179,
          "match_score": 100.0,
          "start": 438.88,
          "end": 442.0
        },
        {
          "text": "Recommends reaching out to AWIA for farm incubation and support.",
          "segment_id": 99,
          "match_score": 100.0,
          "start": 243.28,
          "end": 245.76
        }
      ]
    }
  ]
}