{
  "index": "pS1eipMOpNk",
  "title": "Morning routine farm edition  #Learnfarming",
  "url": "https://www.youtube.com/watch?v=pS1eipMOpNk",
  "category": "Music",
  "video_id": "pS1eipMOpNk",
  "tasks": [
    {
      "task": "Identify valuable rare find",
      "task_start": 6.5,
      "task_end": 13.09,
      "task_match_score": 41.666666666666664,
      "task_time_method": "subtasks_span",
      "subtasks": [
        {
          "text": "Walk to the location of the find",
          "segment_id": 1,
          "match_score": 56.0,
          "start": 6.5,
          "end": 13.09
        },
        {
          "text": "Bend down or kneel to inspect the ground closely",
          "segment_id": null,
          "match_score": 42.857142857142854,
          "start": null,
          "end": null
        },
        {
          "text": "Examine the object found to determine its rarity and value",
          "segment_id": null,
          "match_score": 48.35164835164835,
          "start": null,
          "end": null
        }
      ]
    },
    {
      "task": "\"This time, so I lay it on the line I know that what I found Is once in a lifetime.\" Hmm. So, the speaker is referring to a discovery they made, something they consider extremely rare or valuable. I need to generate tasks related to physical actions a person would perform in relation to this. The main task seems to be identifying the valuable find. So that's the MAINTASK. To break it down, someone would first need to walk to the location where the find was made. Then, they would have to get closer, maybe bend down or kneel to inspect the ground properly. Then, they would need to examine the object to determine its rarity and value. That makes sense. Each of those steps is a subtask under the main task of identifying the valuable find. I think that covers it. There might not be any other physical actions related to agriculture or farming here, since the context is more of a personal discovery rather than farming-related work. Therefore, the accepted answer should include these three subtasks. I'll just confirm quickly. Walk to location, then get close to inspect, then examine the object. Yes. So the MAINTASK is identifying the valuable find, with three subtasks. Then the final answer should list those three subtasks with MAINTASK first. Yep.",
      "task_start": 6.5,
      "task_end": 13.09,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": []
    },
    {
      "task": "Identify valuable rare find",
      "task_start": 6.5,
      "task_end": 13.09,
      "task_match_score": 41.666666666666664,
      "task_time_method": "subtasks_span",
      "subtasks": [
        {
          "text": "Walk to the location of the find",
          "segment_id": 1,
          "match_score": 56.0,
          "start": 6.5,
          "end": 13.09
        },
        {
          "text": "Bend down or kneel to inspect the ground closely",
          "segment_id": null,
          "match_score": 42.857142857142854,
          "start": null,
          "end": null
        },
        {
          "text": "Examine the object found to determine its rarity and value",
          "segment_id": null,
          "match_score": 48.35164835164835,
          "start": null,
          "end": null
        }
      ]
    }
  ]
}