{
    "index": "1a_qKXruRHY",
    "title": "Winter Wheat Webinar - March 26 2013",
    "url": "https://www.youtube.com/watch?v=1a_qKXruRHY",
    "category": "Education",
    "tasks": [
        {
            "task": "Evaluating Plant Stands",
            "subtasks": [
                "Assessing winter wheat plant stands in fields.",
                "Determining survival rates based on environmental factors like temperature and variety.",
                "Evaluating plant vigor and uniformity.",
                "Considering tiller development for yield potential."
            ]
        },
        {
            "task": "Weed Identification and Control",
            "subtasks": [
                "Identifying winter annual weeds such as downy brome, Japanese brome, and church sheet.",
                "Distinguishing between weed species based on leaf pubescence, seed head characteristics, and coloration.",
                "Applying appropriate herbicides for pre- and post-emergence control of winter annual weeds.",
                "Managing glyphosate-resistant weeds like Kosha using alternative herbicides such as Clarity, Starion Ultra, Buctril, and VERGE."
            ]
        },
        {
            "task": "Nitrogen Management",
            "subtasks": [
                "Assessing optimal nitrogen application rates considering yield potential and economics.",
                "Evaluating the impact of nitrogen timing (fall vs. spring) on yield and protein content.",
                "Adjusting nitrogen application strategies based on rainfall patterns and soil moisture.",
                "Considering the role of split nitrogen applications during the growing season."
            ]
        },
        {
            "task": "Disease Management",
            "subtasks": [
                "Evaluating the need for fungicide applications based on disease presence (e.g., tan spot, scab, stripe rust).",
                "Timing fungicide applications (early flower vs. flag leaf) for effectiveness.",
                "Considering the economic threshold for fungicide applications.",
                "Rotating fungicide products to manage resistance."
            ]
        },
        {
            "task": "Field Management and Response to Weather",
            "subtasks": [
                "Monitoring emerging winter wheat crops for signs of cold damage or successful germination.",
                "Evaluating the impact of ice encasement on young wheat plants.",
                "Assessing the potential for volunteer grasses (e.g., Timothy) in newly planted fields and applying appropriate control measures.",
                "Considering delayed planting and weather conditions on crop development and management practices."
            ]
        }
    ]
}