{
    "index": "2NAZkKoZLpo",
    "title": "Unknown Title",
    "url": "https://www.youtube.com/watch?v=2NAZkKoZLpo",
    "category": "Unknown Category",
    "tasks": [
        {
            "task": "Growing medicinal plants in the backyard",
            "subtasks": [
                "Understanding medicinal plants and their uses",
                "Adapting space for a garden (e.g., sunny vs. shady areas)",
                "Collecting and tending medicinal plants (e.g., Spanish needle)",
                "Ensuring proper plant variety (e.g., correct species like calendula vs. common basil)",
                "Timing for harvesting different parts (leaves, flowers, roots)",
                "Preparing and storing herbs (fresh, frozen, dried, oils, tinctures)",
                "Making medicinal oils (e.g., using bundles in a container)",
                "Creating tinctures with alcohol for long-term storage"
            ]
        },
        {
            "task": "MAINTASK is obvious—growing medicinal plants. Now, breaking it down.",
            "subtasks": [
                "SUBTASK—Understanding medicinal plants and their applications. Then, she mentions that you don't need a lot of space, even if you moved in recently. That's a tip, but maybe a subtask under MAINTASK: Starting with limited space. Then she talks about variety—making sure you get the right species. For example, basil has different types. So, SUBTASK: Ensuring proper plant variety.",
                "Harvesting at appropriate times.",
                "SUBTASK—Preparing fresh herbs, SUBTASK—Freezing herbs, SUBTASK—Creating herbal oils, SUBTASK—Making tinctures."
            ]
        },
        {
            "task": "But going back to the main task. \"Growing medicinal plants in your own backyard\"—that's the MAINTASK. Then the subtasks lead up to that. Maybe there's a subtask on making an apothecary? No, maybe not. The storage might be part of the preparation.",
            "subtasks": []
        },
        {
            "task": "Wait, the transcript says, \"even if you aren't growing anything in your garden yet, you might already be growing medicine if your yard is full of weeds.\" So, that's a key point. And she references another video about edibles in the yard. So, looking at your existing yard for natural herbs. That's a step that can be part of the MAINTASK.",
            "subtasks": []
        },
        {
            "task": "Growing medicinal plants in your own backyard",
            "subtasks": []
        },
        {
            "task": "Let me look again. The transcript doesn't go into planting details. She just says moving to the garden, showing existing plants. So, maybe the MAINTASK is more about maintenance and harvesting. Hmm. But \"Growing\" implies cultivation from the start. If someone is starting their own garden, they have to grow the plants. Perhaps the key is how to tend and harvest existing medicine. But maybe even tending is part of ongoing care.",
            "subtasks": []
        },
        {
            "task": "Alternatively, the MAINTASK could be \"Maintaining a home garden of medicinal plants,\" implying existing plants. But the video is about growing them in your backyard. The title is \"Growing\" medicinal plants.",
            "subtasks": []
        },
        {
            "task": "",
            "subtasks": []
        },
        {
            "task": "Establishing and maintaining a home garden of medicinal plants",
            "subtasks": []
        },
        {
            "task": "Growing medicinal plants in the backyard",
            "subtasks": []
        },
        {
            "task": "Growing your own medicinal plants for personal and family use",
            "subtasks": []
        },
        {
            "task": "\"Tending and harvesting a home garden of medicinal plants.\" Then including subtasks of identifying plants, harvesting timing, preparation. All good.",
            "subtasks": []
        },
        {
            "task": "Growing medicinal plants in your own backyard",
            "subtasks": []
        },
        {
            "task": "Growing medicinal plants in your own backyard",
            "subtasks": []
        },
        {
            "task": "Growing medicinal plants in your own backyard",
            "subtasks": []
        },
        {
            "task": "\"a great way to be more self-sufficient and to take control of your health options.\" So maybe self-sufficiency is part of the overarching MAINTASK.",
            "subtasks": []
        },
        {
            "task": "Growing medicinal plants in your own backyard",
            "subtasks": []
        },
        {
            "task": "Alternatively, maybe revist this. The overall MAINTASK is \"Growing and harvesting medicinal plants at home.\"",
            "subtasks": []
        },
        {
            "task": "Growing medicinal plants in your own backyard",
            "subtasks": []
        },
        {
            "task": "Growing medicinal plants in your own backyard",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Growing medicinal plants in your own backyard",
            "subtasks": []
        }
    ]
}