{
    "index": "5aNq8BQ06TU",
    "title": "How To Make Powerful Mixer Grinder At Home",
    "url": "https://www.youtube.com/watch?v=5aNq8BQ06TU",
    "category": "Science & Technology",
    "tasks": [
        {
            "task": "Attach a chain to the front tractor and prepare to tow the mower.",
            "subtasks": [
                "Approach the front tractor.",
                "Identify the correct tool (chain) for attaching to the tractor.",
                "Retrieve the chain from storage or the vicinity.",
                "Position oneself between the tractor and the mower to attach the chain.",
                "Loosen any existing attachment points to disconnect the mower from the tractor.",
                "Insert the chain through the designated attachment points of the mower.",
                "Secure the chain to the tractor, ensuring a stable connection.",
                "Check the tension and safety of the chain connection."
            ]
        },
        {
            "task": "Drive the tractor and mower onto the transport trailer.",
            "subtasks": [
                "Approach the transport trailer.",
                "Position the tractor and mower combination near the trailer ramps.",
                "Drive the tractor forward onto the first ramp.",
                "Continue driving onto the trailer, ensuring the mower is positioned properly.",
                "Align the tractor and mower with the designated transport area.",
                "Check for stability and adjust position if necessary."
            ]
        },
        {
            "task": "Drive the tractor and mower chassis off the transport trailer.",
            "subtasks": [
                "Approach the transport trailer from the designated exit point.",
                "Back the tractor and mower down the ramps onto the ground.",
                "Ensure proper alignment and positioning on the ground.",
                "Verify all connections and attachments are secure."
            ]
        },
        {
            "task": "Operate the chain block to lift the mower deck for transport.",
            "subtasks": [
                "Identify the chain block located on the mower or associated with the mower deck.",
                "Check the chain block for any damage or issues.",
                "Position oneself near the chain block with access to it.",
                "Attach the lifting chain or sling to the chain block.",
                "Secure the other end of the lifting chain to a hitch on the transport vehicle (if different from the tractor).",
                "Operate the chain block to lift the mower deck incrementally.",
                "Monitor the lift for any obstructions or hazards.",
                "Slowly raise the mower deck to the desired height, ensuring it is balanced and secure.",
                "Release the lift if necessary to make final adjustments."
            ]
        },
        {
            "task": "Align the mower deck on the transport vehicle.",
            "subtasks": [
                "Position the transported mower deck onto the transport vehicle bed or carrier.",
                "Adjust the height and angle of the deck to fit securely.",
                "Check the stability of the deck on the transport vehicle, ensuring it won't shift during transit.",
                "Secure the mower deck to the transport vehicle with appropriate tie-downs or clips."
            ]
        },
        {
            "task": "Drive the transport vehicle to the destination.",
            "subtasks": [
                "Enter the transport vehicle and start the engine.",
                "Check mirrors and blind spots for any obstructions.",
                "Drive safely to the destination, considering all traffic laws and transport safety guidelines.",
                "Plan the route to avoid steep inclines or narrow roads that may not be suitable for transporting heavy loads."
            ]
        },
        {
            "task": "Unload the transport vehicle at the new location.",
            "subtasks": [
                "Approach the transport vehicle at the unloading area.",
                "Apply the parking brake and set the transmission to park or neutral.",
                "Use wheel chocks if necessary for stability.",
                "Open the vehicle bed or carrier doors slowly and safely.",
                "Inspect the laying down area (the new location) for any obstructions or uneven surfaces.",
                "Slide out the mower deck from the transport vehicle, ensuring it is supported throughout the process.",
                "Once clear, remove the securing devices (rope, chains, etc.).",
                "Position the mower deck smoothly onto the ground, checking for any secure bungee chords or straps if required.",
                "Verify that all connections are safe and stable."
            ]
        },
        {
            "task": "Prepare the mower for use after transportation.",
            "subtasks": [
                "Transfer the mower deck from its transport position to where it will be used.",
                "Align the deck with the rest of the mower components if necessary.",
                "Reattach any removed battery, starter, or hydraulic hoses.",
                "Test the mower’s mobility and functionality to ensure it's operational.",
                "Clean any dirt or debris from the lift system or deck."
            ]
        }
    ]
}