{
    "index": "I2kMJBxqfT4",
    "title": "Unknown Title",
    "url": "https://www.youtube.com/watch?v=I2kMJBxqfT4",
    "category": "Unknown Category",
    "tasks": [
        {
            "task": "Prepare lentil paddocks for harvesting.",
            "subtasks": [
                "Use a chaser harrow or similar equipment to clean up stumps.",
                "Seed lentils in a staggered pattern to prevent overcrowding."
            ]
        },
        {
            "task": "Operate a modern harvester equipped with auto ground pressure monitoring.",
            "subtasks": [
                "Adjust the header pressure to a desired setting using a potentiometer.",
                "Monitor ground pressure in real-time using the computer on the harvester."
            ]
        },
        {
            "task": "Minimize lentil cracking during harvest.",
            "subtasks": [
                "Open the concave setting on the combine.",
                "Slow down the rotor speed compared to wheat harvesting.",
                "Maintain sieve settings similar to those used for wheat."
            ]
        },
        {
            "task": "Implement fire precautions for lentil residue.",
            "subtasks": [
                "Install thermal blankets around the exhaust and turbo areas.",
                "Utilize on-farm storage solutions for lentil grains."
            ]
        },
        {
            "task": "Consider initial investment and storage options for lentils.",
            "subtasks": [
                "Construct a shed with adequate storage capacity (e.g., 2,000 tonnes).",
                "Cover storage areas with tarps for extended protection (e.g., 6-7 months)."
            ]
        },
        {
            "task": "Prepare lentil paddocks for harvesting",
            "subtasks": [
                "Use a chaser harrow to clean up stumps (paddock preparation).",
                "Seed lentils early (e.g., mid-April) to ensure vigour and yield.",
                "Properly roll the paddock after seeding with a seeder."
            ]
        },
        {
            "task": "Operate a modern harvester equipped with auto ground pressure monitoring",
            "subtasks": [
                "Adjust header pressure using a potentiometer.",
                "Monitor ground pressure in real-time via the harvester’s computer.",
                "Navigate around stumps using auto detection systems."
            ]
        },
        {
            "task": "Minimize lentil cracking during harvest",
            "subtasks": [
                "Open the concave setting to allow proper grain flow.",
                "Slow down the rotor speed compared to wheat.",
                "Keep sieve settings similar to wheat to prevent damage."
            ]
        },
        {
            "task": "Implement fire precautions for lentil residue",
            "subtasks": [
                "Install thermal blankets around exhaust and turbo sections.",
                "Ensure proper ventilation in the header for safer operations."
            ]
        },
        {
            "task": "Consider initial investment and storage options for lentils",
            "subtasks": [
                "Construct a large shed (e.g., 2,000 tonnes capacity) with a tarp cover.",
                "Plan on tarped storage for 6–7 months."
            ]
        }
    ]
}