{
    "index": "KP-XhPoFbY4",
    "title": "Unknown Title",
    "url": "https://www.youtube.com/watch?v=KP-XhPoFbY4",
    "category": "Unknown Category",
    "tasks": [
        {
            "task": "Hatching chicks through incubation.",
            "subtasks": [
                "Collecting eggs for incubation.",
                "Choosing appropriate eggs (within 7 days, no cracks, medium size, correct shape).",
                "Arranging eggs in the incubator to face one direction.",
                "Setting and maintaining incubator temperature and humidity (38°C, 60% humidity on day 1; 37.8°C, 55% on day 7-12; 37.6°C, 60% on day 13-18; 37.2°C, 65% on day 19; adjust as needed).",
                "Turning eggs after day 18.",
                "Removing eggs from rollers on day 19 and placing on hatching trays.",
                "Preparing chicks for hatching on day 21.",
                "Transferring hatched chicks to a brooder with warmth and care.",
                "Feeding and caring for chicks for at least a month after hatching."
            ]
        },
        {
            "task": "Feeding hens to produce eggs for incubation.",
            "subtasks": [
                "Caring for hens (collecting eggs, managing coop).",
                "Selecting and breeding chickens (described as \"craters\" in the video).",
                "Collecting eggs from hens regularly."
            ]
        },
        {
            "task": "Managing a small-scale chicken farm.",
            "subtasks": [
                "Overseeing the entire hatching and chick-rearing process.",
                "Adapting practices to consistently produce over 200 chicks per month.",
                "\" followed by a new line, and each subtask is prefixed with \"SUBTASK:\" as per the guidelines."
            ]
        },
        {
            "task": "Hatching chicks through incubation",
            "subtasks": [
                "** Collecting eggs for incubation",
                "** Choosing appropriate eggs (checking for age, cracks, size, and shape)",
                "** Arranging eggs in the incubator correctly",
                "** Setting and maintaining the correct temperature and humidity levels at specific stages (e.g., 38°C and 60% humidity on day 1, adjustments as eggs develop until day 21)",
                "** Turning eggs after day 18 to ensure proper development",
                "** Removing eggs from the incubator on day 19 and placing them on hatching trays",
                "** Caring for the hatched chicks (transferring them to a brooder, ensuring warmth, and feeding them for at least a month)"
            ]
        },
        {
            "task": "Feeding hens to produce eggs for incubation",
            "subtasks": [
                "** Caring for the hens (likely collecting eggs and managing the coop)",
                "** Breeding the appropriate chicken breeds (e.g., craters as mentioned in the video)"
            ]
        },
        {
            "task": "Managing a small-scale chicken farm",
            "subtasks": [
                "** Overseeing the entire hatching and chick-rearing process",
                "** Consistently producing over 200 chicks per month, adapting methods as necessary"
            ]
        }
    ]
}