{
    "index": "tbfw7cqHng0",
    "title": "Metrics to Watch: Kennedy Implement 2012 Dealership of the Year",
    "url": "https://www.youtube.com/watch?v=tbfw7cqHng0",
    "category": "Autos & Vehicles",
    "tasks": [
        {
            "task": "Face Time with the Company Manager discussing business growth and principles.",
            "subtasks": [
                "Listen to the manager explain the company's 30-year history.",
                "Understand the company's principles of being the best and honest with customers.",
                "Learn how the team concept and profitability affect different departments.",
                "Recognize the importance of parts and service in driving sales.",
                "Acknowledge the practice of double-tasking among employees, such as the mechanic handling warranty work.",
                "Understand the strategy of reinvesting revenue to build a sound foundation for expansion."
            ]
        },
        {
            "task": "Discuss business management strategies.",
            "subtasks": [
                "Recognize the holistic approach to measuring success beyond individual department performance.",
                "Understand the on-site leadership, such as running the shop and handling sales tasks."
            ]
        },
        {
            "task": "Navigate a community business's expansion goals.",
            "subtasks": [
                "Understand the company's current state and future plans.",
                "Learn about adapting to growth and managing resources efficiently (double-tasking)."
            ]
        },
        {
            "task": "Understand the challenges and strategies of a regional equipment dealership.",
            "subtasks": [
                "Learn how the dealership serves the local market while competing with larger entities.",
                "Note the emphasis on technology and customer service.",
                "Acknowledge the need for flexibility and adaptation in managing a small dealership."
            ]
        }
    ]
}