{
    "index": "tGavl99_rAM",
    "title": "COOL FARM TOOLS EXPLAINED...NO-TILL SEED DRILL...SEE HOW IT WORKS!!",
    "url": "https://www.youtube.com/watch?v=tGavl99_rAM",
    "category": "People & Blogs",
    "tasks": [
        {
            "task": "Loading and operating a seed drill tractor attachment.",
            "subtasks": [
                "Attaching the seed drill to the tractor.",
                "Checking and adjusting hydraulic lines for proper function.",
                "Setting seed drill settings (depth, rate) for different seeds (fescue, rye grain, wheat, clover).",
                "Loading seed into the appropriate hoppers."
            ]
        },
        {
            "task": "Operating the seed drill.",
            "subtasks": [
                "Ensuring the drill is properly positioned over the field.",
                "Manually adjusting the drill's height when turning.",
                "Monitoring seed distribution and hopper levels during operation."
            ]
        },
        {
            "task": "Distributing clover seed with the seed drill.",
            "subtasks": [
                "Loading clover seed into its designated hopper.",
                "Setting appropriate seed distribution settings for clover."
            ]
        },
        {
            "task": "Ensuring the tractor's weight is correctly transferred to the seed drill.",
            "subtasks": [
                "Pinning hydraulic settings to connect the seed drill to the tractor.",
                "Adjusting hydraulic lines for safety and functionality."
            ]
        },
        {
            "task": "Managing seed drill startup and shutdown procedures.",
            "subtasks": [
                "Correctly inserting and securing pins for seed drill attachment.",
                "Using appropriate tractor controls to lower and raise the seed drill."
            ]
        },
        {
            "task": "Cleaning up and zip tying hydraulic lines for storage.",
            "subtasks": [
                "Inspecting hydraulic lines for potential pinch points.",
                "Using zip ties to secure hydraulic lines in a safe position."
            ]
        },
        {
            "task": "Attaching and connecting the seed drill to the tractor.",
            "subtasks": []
        },
        {
            "task": "Operating the seed drill.",
            "subtasks": []
        },
        {
            "task": "Loading the seed drill with appropriate seeds for different areas.",
            "subtasks": []
        },
        {
            "task": "Performing general tasks related to seed drill starting and shutdown.",
            "subtasks": []
        },
        {
            "task": "Preparing the seed drill for operation.",
            "subtasks": []
        },
        {
            "task": "Loading the seed drill hoppers with the correct seed types.",
            "subtasks": []
        },
        {
            "task": "Operating the seed drill during field work.",
            "subtasks": []
        },
        {
            "task": "Shutting down and securing the seed drill.",
            "subtasks": []
        },
        {
            "task": "Attaching and connecting the seed drill to the tractor.",
            "subtasks": []
        },
        {
            "task": "Loading the seed drill with appropriate seeds.",
            "subtasks": []
        },
        {
            "task": "Operating the seed drill.",
            "subtasks": []
        },
        {
            "task": "Properly shutting down and securing the seed drill.",
            "subtasks": []
        },
        {
            "task": "MAINTASK: Operating a seed drill on a tractor for planting seeds.",
            "subtasks": []
        }
    ]
}