{
    "index": "TXHAmmjNj5s",
    "title": "Great Plains Drill Calibration Video",
    "url": "https://www.youtube.com/watch?v=TXHAmmjNj5s",
    "category": "Education",
    "tasks": [
        {
            "task": "Calibrating a grain drill for proper seed planting.",
            "subtasks": [
                "Determine the number of seeds per pound.",
                "Use the calibration worksheet to calculate the required pounds per acre.",
                "Measure the circumference of the gauge wheel.",
                "Adjust the transmission and notch settings of the grain drill.",
                "Measure and mark the seed cups using a ruler.",
                "Run the grain drill for a specified number of turns to collect seed.",
                "Zero the scale before collecting the seed sample.",
                "Use a calculator and spreadsheet to determine the required amount of seed.",
                "Adjust the drilling mechanism to achieve the correct seed metering."
            ]
        },
        {
            "task": "Calibrate an air seeder grain drill.",
            "subtasks": [
                "Follow the same calibration process as described for the Great Plains drill."
            ]
        },
        {
            "task": "Calibrate a John Deere type box drill.",
            "subtasks": [
                "Follow the same calibration process as described for the Great Plains drill."
            ]
        },
        {
            "task": "Calibrate a Great Plains type box drill.",
            "subtasks": [
                "Ensure all seed cups are empty and clean.",
                "Set the transmission and notch settings according to the drill model.",
                "Measure the gauge wheel circumference and input into the calibration worksheet.",
                "Adjust the drill setpoints based on previous experience and starting points.",
                "Collect seed from the calibration run to calculate the correct settings.",
                "Fine-tune the settings using the ruler to measure the seed metering.",
                "Mark the lid with the settings for future reference.",
                "Verify calibration accuracy in the field."
            ]
        }
    ]
}