{
    "index": "vs6h9ndpB6c",
    "title": "Growing Corn Basics Time Lapse - 6 days",
    "url": "https://www.youtube.com/watch?v=vs6h9ndpB6c",
    "category": "People & Blogs",
    "tasks": [
        {
            "task": "Cross a dirt road by walking along it and stepping on the dirt to move forward.",
            "subtasks": [
                "Walk along the dirt road.",
                "Place one foot on the dirt surface.",
                "Lift the other foot and move it forward.",
                "Repeat with the other foot to maintain forward movement."
            ]
        },
        {
            "task": "Stop a combine by turning off its engine.",
            "subtasks": [
                "Identify the combine's engine.",
                "Operate the switch or lever to turn off the engine."
            ]
        },
        {
            "task": "Use a sewing machine to stitch together burlap or canvas.",
            "subtasks": [
                "Position the fabric on the sewing machine's foot pedal.",
                "Foot pedal the sewing machine to stitch the fabric."
            ]
        },
        {
            "task": "Load a wheelbarrow with manure or dirt.",
            "subtasks": [
                "Approach a wheelbarrow.",
                "Scoop a shovelful of manure or dirt with a shovel.",
                "Transfer the shovelful into the wheelbarrow.",
                "Repeat until the wheelbarrow is filled."
            ]
        },
        {
            "task": "Guy a pivot.",
            "subtasks": [
                "Position the helper on the pivot arm.",
                "Brace the pivot point with a pole or similar object."
            ]
        },
        {
            "task": "Fuel a tractor.",
            "subtasks": [
                "Locate the fuel tank on the tractor.",
                "Use a fuel hose or can to fill the tank."
            ]
        },
        {
            "task": "Adjust the combine header.",
            "subtasks": [
                "Approach the combine's header.",
                "Unlock the header adjustment mechanism.",
                "Make necessary adjustments for the grain pickup."
            ]
        },
        {
            "task": "Install a new fan belt on the combine.",
            "subtasks": [
                "Locate the fan belt routing diagram.",
                "Remove the old fan belt.",
                "Install the new fan belt according to the diagram."
            ]
        },
        {
            "task": "Drive a forklift to stack hay bales.",
            "subtasks": [
                "Operate the forklift to pick up a hay bale.",
                "Drive to the stacking location.",
                "Lower the hay bale onto the stack.",
                "Repeat with additional bales."
            ]
        },
        {
            "task": "Manually turn a shaft to advance a hay baler cutter reel.",
            "subtasks": [
                "Stand near the hay baler.",
                "Grip the manually turned shaft.",
                "Rotate the shaft to advance the cutter reel."
            ]
        },
        {
            "task": "Clean the combine's air inlet using a shop vac.",
            "subtasks": [
                "Position a shop vac near the combine.",
                "Attach the vac hose to the air inlet.",
                "Activate the vac to suction debris from the inlet."
            ]
        },
        {
            "task": "Locate and stir compost in a wheelbarrow.",
            "subtasks": [
                "Identify the compost pile.",
                "Grasp a shovel or pitchfork.",
                "Scoop compost into the wheelbarrow.",
                "Stir the compost to mix it thoroughly."
            ]
        }
    ]
}