{
    "index": "z9ldLnidFTk",
    "title": "The famous farm - Nuwakot - Nepal",
    "url": "https://www.youtube.com/watch?v=z9ldLnidFTk",
    "category": "Travel & Events",
    "tasks": [
        {
            "task": "Adjust trailer coupling to connect to semi tractor",
            "subtasks": [
                "Identify appropriate trailer coupling",
                "Align coupling with semi tractor hitch",
                "Secure coupling to semi tractor"
            ]
        },
        {
            "task": "Load trailer with crops harvested from the field",
            "subtasks": [
                "Position trailer in the field",
                "Operate装载机 or similar equipment to load crops",
                "Compact crops into trailer compartments",
                "Secure crops inside trailer to prevent shifting during transport"
            ]
        },
        {
            "task": "Connect baler to the tractor",
            "subtasks": [
                "Position baler in proximity to the field",
                "Attach baler to the tractor",
                "Adjust straps or chains to secure baler to the tractor"
            ]
        },
        {
            "task": "Operate baler to collect and compress crops",
            "subtasks": [
                "Drive tractor with baler attached towards harvested crops",
                "Monitor and direct the flow of crops into the baler",
                "Start and operate baler mechanisms to compress crops into bales",
                "Secure bales in place after formation"
            ]
        },
        {
            "task": "Drive semi tractor equipped with trailer to the loading dock",
            "subtasks": [
                "Survey the route to the loading dock for safety",
                "Operate steering mechanisms to navigate the tractor and trailer",
                "Adjust speed as necessary for safe operation"
            ]
        },
        {
            "task": "GAUGE Tire pressure of tractor/trailer",
            "subtasks": [
                "Access the tire pressure gauge",
                "Locate the correct tires on the tractor and trailer to check",
                "Measure the pressure in each tire",
                "Compare measured pressure to the recommended specifications",
                "If pressure is low, add air to bring it up to the correct level"
            ]
        },
        {
            "task": "ATTACH Correct trailer to semi truck",
            "subtasks": [
                "Identify the correct trailer for the load",
                "Position the trailer alongside the semi truck",
                "Secure the trailer to the semi truck using proper coupling",
                "Test the connection to ensure it's secure",
                "Open and adjust the parking brakes on the trailer"
            ]
        },
        {
            "task": "Evaluate whether the day's work is finished",
            "subtasks": [
                "Assess the progress in terms of acres harvested and baled",
                "Plan remaining tasks for the day or next day if needed",
                "Clean and maintain equipment used for the day's work",
                "The transcript provides a detailed sequence of actions related to operating a semi tractor-trailer and agricultural equipment in a farming setting. Key tasks include adjusting the trailer coupling, loading the trailer with harvested crops, connecting and operating a baler, driving the semi tractor to the loading dock, maintaining tire pressure, and evaluating the day's work. Each main task is broken down into specific subtasks to outline the physical actions required. The list assumes that these tasks are performed manually by an operator, focusing on the bodily movements and operations involved. Tasks are grouped under MAINTASK headers followed by their respective SUBTASKS for clarity."
            ]
        }
    ]
}