{
  "index": "80BBZ09u9Is",
  "title": "Marcel Fafchamps: Mobilizing P2P Diffusion for New Agricultural Practices",
  "url": "https://www.youtube.com/watch?v=80BBZ09u9Is",
  "category": "Education",
  "video_id": "80BBZ09u9Is",
  "tasks": [
    {
      "task": "Hosting and presenting a seminar on the diffusion of agricultural technology in Bangladesh using a specific example of the System of Rice Intensification (SRI).",
      "task_start": 1033.76,
      "task_end": 1038.559,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": [
        {
          "text": "Introduce collaborators and research objectives.",
          "segment_id": 500,
          "match_score": 100.0,
          "start": 1033.76,
          "end": 1038.559
        },
        {
          "text": "Explain the challenge of targeting beneficiaries for agricultural technology training.",
          "segment_id": 62,
          "match_score": 100.0,
          "start": 131.92,
          "end": 136.319
        },
        {
          "text": "Describe the use of model farmers (trainee farmers) to teach other farmers.",
          "segment_id": 144,
          "match_score": 100.0,
          "start": 293.68,
          "end": 297.52
        },
        {
          "text": "Detail the experimental design, including treatment groups, incentives, and assignment mechanisms.",
          "segment_id": 500,
          "match_score": 100.0,
          "start": 1033.76,
          "end": 1038.559
        },
        {
          "text": "Justify the use of weights for proper statistical analysis considering non-random assignment.",
          "segment_id": 1238,
          "match_score": 100.0,
          "start": 2610.0,
          "end": 2613.599
        },
        {
          "text": "Present results on increased adoptions and yields among teacher trainees and their students.",
          "segment_id": 220,
          "match_score": 100.0,
          "start": 450.639,
          "end": 455.919
        },
        {
          "text": "Discuss the role of knowledge transfer versus example-setting in adoption rates.",
          "segment_id": 245,
          "match_score": 100.0,
          "start": 502.0,
          "end": 506.4
        },
        {
          "text": "Highlight the social return on investment for the training program.",
          "segment_id": 171,
          "match_score": 100.0,
          "start": 350.16,
          "end": 353.36
        }
      ]
    },
    {
      "task": "Hosting and presenting a seminar on the diffusion of agricultural technology in Bangladesh using a specific example of the System of Rice Intensification (SRI).\" That covers the overall main event.",
      "task_start": 1033.76,
      "task_end": 1038.559,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": [
        {
          "text": "The transcript mentions Marcel introducing his co-authors (Assad Islam, Abdul-Malek, and Debyean Pakrashi). Then he gives an overview of the research objectives. So a subtask could be \"SUBTASK: Introduce collaborators and research objectives.\"",
          "segment_id": 52,
          "match_score": 100.0,
          "start": 111.6,
          "end": 114.399
        },
        {
          "text": "He discusses the challenge of targeting beneficiaries for agricultural technology training. The system SRI (which doesn't require additional inputs but is difficult to master) makes this challenging. He mentions that training everyone is costly. Then they tried a referral method but found it didn't work as expected. So a subtask could be \"SUBTASK: Explain the challenge of targeting beneficiaries for agricultural technology training.\"",
          "segment_id": 36,
          "match_score": 100.0,
          "start": 81.119,
          "end": 83.439
        },
        {
          "text": "Describe the use of model farmers (trainee farmers) to teach other farmers.\"",
          "segment_id": 144,
          "match_score": 100.0,
          "start": 293.68,
          "end": 297.52
        },
        {
          "text": "Detail the experimental design, including treatment groups, incentives, and assignment mechanisms.\"",
          "segment_id": 500,
          "match_score": 100.0,
          "start": 1033.76,
          "end": 1038.559
        },
        {
          "text": "Justify the use of weights for proper statistical analysis considering non-random assignment.\"",
          "segment_id": 1238,
          "match_score": 100.0,
          "start": 2610.0,
          "end": 2613.599
        },
        {
          "text": "Present results on increased adoptions and yields among teacher trainees and their students.\"",
          "segment_id": 220,
          "match_score": 100.0,
          "start": 450.639,
          "end": 455.919
        },
        {
          "text": "Discuss the role of knowledge transfer versus example-setting in adoption rates.\" (He mentioned both knowledge and modeling channels might contribute.)",
          "segment_id": 245,
          "match_score": 100.0,
          "start": 502.0,
          "end": 506.4
        },
        {
          "text": "He did a cost-benefit analysis, finding a high social return on investment. Subtask: \"SUBTASK: Highlight the social return on investment for the training program.\"",
          "segment_id": 171,
          "match_score": 100.0,
          "start": 350.16,
          "end": 353.36
        },
        {
          "text": "When he says \"role models,\" they used a baseline where farmers nominated each other as role models for agricultural technology. In the assignment, some students were assigned to teachers they nominated (above median) versus those they didn't. So there's a subtask here: \"SUBTASK: Detail the role of being a 'role model' in the assignment mechanism and discuss the results related to such nominations.\"",
          "segment_id": 52,
          "match_score": 100.0,
          "start": 111.6,
          "end": 114.399
        }
      ]
    },
    {
      "task": "Hosting and presenting a seminar on the diffusion of agricultural technology in Bangladesh using SRI.",
      "task_start": 1033.76,
      "task_end": 1038.559,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": [
        {
          "text": "Introduce collaborators and research objectives (focusing on BRAC's efforts to train farmers on SRI).",
          "segment_id": 144,
          "match_score": 100.0,
          "start": 293.68,
          "end": 297.52
        },
        {
          "text": "Explain the challenge of targeting beneficiaries for SRI training (difficulty in mastering, expensive training, earlier methods like referrals didn't work as intended).",
          "segment_id": 62,
          "match_score": 100.0,
          "start": 131.92,
          "end": 136.319
        },
        {
          "text": "Describe the intervention: using model farmers (trainees who teach two farmers each) with incentives, balanced via weights, and matched on role models (some criteria students vs. unlisted).",
          "segment_id": 500,
          "match_score": 100.0,
          "start": 1033.76,
          "end": 1038.559
        },
        {
          "text": "Detail the experimental setup: villages, BRAC’s identification of 30 potential adopters, randomization, teacher selection, and matching.",
          "segment_id": 500,
          "match_score": 100.0,
          "start": 1033.76,
          "end": 1038.559
        },
        {
          "text": "Justify how they accounted for non-random assignment using weighting (stratified sampling).",
          "segment_id": 533,
          "match_score": 100.0,
          "start": 1098.48,
          "end": 1100.96
        },
        {
          "text": "Present statistical results: higher SRI adoption and higher yields in teacher trainees and students, with students' quiz performance related to teacher knowledge.",
          "segment_id": 144,
          "match_score": 100.0,
          "start": 293.68,
          "end": 297.52
        },
        {
          "text": "Discuss the role of knowledge transmission versus example in the success (students learned more when matched to role models and model teachers, but this also depends on the students' previous knowledge and skill).",
          "segment_id": 144,
          "match_score": 100.0,
          "start": 293.68,
          "end": 297.52
        },
        {
          "text": "Highlight the social return on investment (about 150% return, justifying the program despite some over-adoption in the incentivized group).",
          "segment_id": 97,
          "match_score": 100.0,
          "start": 202.319,
          "end": 205.519
        },
        {
          "text": "Analyze the impact of incentives on adoption and teacher performance.\" Another nuance—students whose teachers were incentivized performed slightly better on the quiz (perhaps because teachers paid more attention to the course material).",
          "segment_id": 144,
          "match_score": 100.0,
          "start": 293.68,
          "end": 297.52
        }
      ]
    },
    {
      "task": "",
      "task_start": null,
      "task_end": null,
      "task_match_score": 0.0,
      "task_time_method": "none",
      "subtasks": []
    },
    {
      "task": "Hosting and presenting a seminar on the diffusion of agricultural technology in Bangladesh using the System of Rice Intensification (SRI) as a case study.",
      "task_start": 1033.76,
      "task_end": 1038.559,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": []
    }
  ]
}