{
  "index": "flP2ogyRDMM",
  "title": "Unknown Title",
  "url": "https://www.youtube.com/watch?v=flP2ogyRDMM",
  "category": "Unknown Category",
  "video_id": "flP2ogyRDMM",
  "tasks": [
    {
      "task": "When considering the challenges faced by female rice farmers, including access to resources and recognition, as well as the economic impact of supporting female farmers through education and policy.",
      "task_start": 146.879,
      "task_end": 150.319,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": [
        {
          "text": "Recognizing the significant contribution of women in rice cultivation globally.",
          "segment_id": 17,
          "match_score": 100.0,
          "start": 45.12,
          "end": 47.52
        },
        {
          "text": "Understanding the perception and role of women in farming families in different regions, such as Sub-Saharan Africa, South Asia, and Southeast Asia.",
          "segment_id": 17,
          "match_score": 100.0,
          "start": 45.12,
          "end": 47.52
        },
        {
          "text": "Acknowledging the unpaid and unrecognized labor of women farmers, especially in the Philippines, and the barriers they face in accessing farming resources and technologies.",
          "segment_id": 17,
          "match_score": 100.0,
          "start": 45.12,
          "end": 47.52
        },
        {
          "text": "Analyzing the impact of limited access to resources and training on the productivity and poverty levels of female farmers.",
          "segment_id": 62,
          "match_score": 100.0,
          "start": 146.879,
          "end": 150.319
        },
        {
          "text": "Highlighting the need for support systems and policies that recognize women's roles in agriculture and provide them with opportunities to improve productivity and livelihood.",
          "segment_id": 74,
          "match_score": 81.25,
          "start": 168.959,
          "end": 172.56
        },
        {
          "text": "Discussing the potential benefits of empowering women farmers, such as increased income and better access to education and healthcare for their families.",
          "segment_id": 17,
          "match_score": 100.0,
          "start": 45.12,
          "end": 47.52
        },
        {
          "text": "Reflecting on the importance of addressing gender disparities in farming and the role of communities and organizations in promoting gender equality in agriculture.",
          "segment_id": 88,
          "match_score": 78.57142857142857,
          "start": 199.2,
          "end": 203.599
        }
      ]
    }
  ]
}