{
  "index": "M-mUYXsXlyE",
  "title": "Farm managers series   Ending Employment",
  "url": "https://www.youtube.com/watch?v=M-mUYXsXlyE",
  "category": "Education",
  "video_id": "M-mUYXsXlyE",
  "tasks": [
    {
      "task": "Terminate an employee at a Vermont or New Hampshire farm following legal requirements and procedures.",
      "task_start": 243.26,
      "task_end": 247.97,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": [
        {
          "text": "Verify if the state is an at-will employment state (already determined as such, but if necessary, verify).",
          "segment_id": 15,
          "match_score": 81.81818181818181,
          "start": 41.46,
          "end": 46.71
        },
        {
          "text": "Confirm that the reason for termination is not related to a protected class under discrimination laws (race, color, national origin, religion, sex, age, physical or mental disability, etc.), particularly checking laws in Vermont and New Hampshire.",
          "segment_id": 18,
          "match_score": 87.87878787878788,
          "start": 48.18,
          "end": 53.489
        },
        {
          "text": "Deliver the termination notice in private, with another supervisor present if possible.",
          "segment_id": 62,
          "match_score": 70.0,
          "start": 159.11,
          "end": 163.97
        },
        {
          "text": "Be clear and firm in the decision, avoiding debate. Provide specific reasons for termination (e.g., repeated tardiness, underperforming).",
          "segment_id": 88,
          "match_score": 66.66666666666666,
          "start": 222.829,
          "end": 227.03
        },
        {
          "text": "Ensure the employee's final paycheck is processed according to state law (Vermont/New Hampshire: within 72 hours; otherwise, refer to Department of Labor). Arrange for a manual check if practical.",
          "segment_id": 90,
          "match_score": 70.0,
          "start": 227.03,
          "end": 231.92
        },
        {
          "text": "Collect any company property issued to the employee (keys, equipment, uniforms) and have the employee sign a receipt for returned items.",
          "segment_id": 97,
          "match_score": 100.0,
          "start": 243.26,
          "end": 247.97
        },
        {
          "text": "If the termination is due to performance issues, document previous feedback and attempts to correct the behavior.",
          "segment_id": 88,
          "match_score": 66.66666666666666,
          "start": 222.829,
          "end": 227.03
        },
        {
          "text": "Handle upset employees by escorting them to their vehicle or ensuring they leave safely, and address any potential threats by contacting law enforcement.",
          "segment_id": 39,
          "match_score": 68.9655172413793,
          "start": 106.829,
          "end": 110.85
        }
      ]
    },
    {
      "task": "Follow-up actions after terminating an employee at a Vermont or New Hampshire farm.",
      "task_start": 243.26,
      "task_end": 247.97,
      "task_match_score": 100.0,
      "task_time_method": "task_text_match",
      "subtasks": [
        {
          "text": "Provide a limited reference for the former employee upon request, providing only factual information about their employment period and duties, withholding reasons for termination.",
          "segment_id": 97,
          "match_score": 100.0,
          "start": 243.26,
          "end": 247.97
        }
      ]
    },
    {
      "task": "Document the termination process for legal and professional reasons.",
      "task_start": 222.829,
      "task_end": 227.03,
      "task_match_score": 66.66666666666666,
      "task_time_method": "task_text_match",
      "subtasks": [
        {
          "text": "Keep records of any performance issues or documented feedback given to the employee, including dates and specifics.",
          "segment_id": 119,
          "match_score": 63.1578947368421,
          "start": 295.97,
          "end": 298.36
        },
        {
          "text": "Maintain a list of reasons for termination and ensure compliance with state wage payment requirements (72-hour rule in VT and NH).",
          "segment_id": 36,
          "match_score": 65.51724137931035,
          "start": 98.04,
          "end": 104.88
        },
        {
          "text": "Update staff and other employees about the termination to prevent rumors and misinformation, maintaining professionalism.",
          "segment_id": 88,
          "match_score": 66.66666666666666,
          "start": 222.829,
          "end": 227.03
        }
      ]
    }
  ]
}